#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    // Масив для зберігання чисел та масив для зберігання довжини підпослідовності
    int a[1000];
    int dp[1000];
    // Зчитування чисел та ініціалізація масиву dp
    for (int i = 0; i < n; i++) {
        cin >> a[i];
        dp[i] = 1;
    }

    int answer = 1;
    // Основний алгоритм для знаходження довжини найдовшої строго зростаючої підпослідовності
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < i; j++) {
            // Якщо поточний елемент більший за попередній та довжина підпослідовності збільшується
            if (a[j] < a[i] && dp[j] + 1 > dp[i]) {
                dp[i] = dp[j] + 1;
            }
        }
        // Оновлення відповіді, якщо знайдено довшу підпослідовність
        if (dp[i] > answer)
            answer = dp[i];
    }

    cout << answer << endl;

    return 0;
}