/*
 * Задача: Self Practice Task 1   Марічка і печиво
 * Автор: Сачковський Андрій
 * Група: AI-11
 */

 /*
суть завдання користовач водить кілкьст пачок і пряніків які потом марічка краде
 але вона робить так шоб остався 1 прянік в пачці  потом рахується сума кражи
 */
#include <iostream>
using namespace std;

int main() {

    int p;
    long long k[100000];
    cin >> p; //кількість пачок 
    for (int i = 0; i < p; i++)
    {
        cin >> k[i]; //кількість пряників в кожній пачці
    }

    long long m[100000];
    for (int i = 0; i < p; i++)//скільки пряників може взяти марічка з кожної пачки
        if (k[i] > 0)
            m[i] = k[i] - 1;
        else
            m[i] = 0;

    long long s = 0; //сума всього 
    for (int i = 0; i < p; i++) {
        s = s + m[i];
    }
    cout << s;

}