/*
 * Задача: Self Practice Task 2  Веселі каруселі
 * Автор: Сачковський Андрій
 * Група: AI-11
 */
/*
 суть завадння користовач водить кілкіьсть грошей і каруселів потом водить ціну  за кожен атракціон
 код сорторує шукає найдешевші і віднімає від суми грошей яка є в марічки 
  */
#include <iostream>
using namespace std;

int main() { 
    int k, n, a[100];
    cin >> k >> n;

    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }

    // сортування бульбашкою
    for (int i = 0; i < n - 1; i++) {
        for (int j = 0; j < n - 1; j++) {
            if (a[j] > a[j + 1]) {
                int t = a[j];
                a[j] = a[j + 1];
                a[j + 1] = t;
            }
        }
    }

    int d = 0;
    int i = 0;
    while (i < n && k >= a[i]) { //перевірка чи марічці хватить грошей і чи кілкьість актракціонів не більше чим скільки існує 
        k = k - a[i];
        i++;
        d++;
    }

    cout << d;
    return 0;
}