/*
 * Задача: Self Practice Task 3 Фінансова грамотність
 * Автор: Сачковський Андрій
 * Група: AI-11
 */


/*
суть завадння щоб при парній потраченій сумі карточку блокують а при не парній сумі ні 
також важливо щоб було 1 не парне число воно обовязково має бути першим всі інші випадки дадуть ноу 
*/
#include <iostream>
using namespace std;

int main() {

    int a[100000], n; 
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];//користовач водить якісь числа
    }

    long long s = 0; //шукається сума
    for (int i = 0; i < n; i++) {
        s = s + a[i];
    }

    int proverka;
    proverka = s % 2;//якщо сума парна то зразу но якщо ні то треба ще перевірка чи є в масиві користовача число не парне

    int f = 0, g = 0;
    int ne_parni;

    if (proverka == 0) {
        cout << "NO";
        return 0;    
    }

    for (int i = 0; i < n; i++) {
        ne_parni = a[i] % 2;
        if (ne_parni == 1) { 
            f++;             
            g = i;      // знайшли не парне число      
        }
    }

    
    if (f == 1) {
        cout << "YES\n";                 
        cout << a[g];                    
        for (int i = 0; i < n; i++) {
            if (i == g) continue; // виводимо весь масив але обовязково ставимо не парне число на перше місце        
            cout << " " << a[i];         
        }
    }
    else { 
        cout << "NO";
    }
}