/*
 * Задача: lab_5_task_1_variant_22
 * Автор: Сачковський Андрій
 * Група: AI-11
*/
#include <iostream>
//треба знайти середнє арифметичне стовпця і порівнювати його з кожним числом настпуного стопвця 
using namespace std;


int N[1001][1001];

 int main()
 {

int a , b ;
cout << "ведіть кількість рядків ";
cin>>a;

cout<<"ведіть кілкьість стовпців ";
cin>>b;

for (int i = 1 ; i<= a; i++ ){
    for(int j = 1 ; j  <= b; j++){
     
     cin>>N[i][j];
    }
} //отримання даних для матриці



int pid[1001] = {0};

double suma[1001] = {0};
double seredina[1001] = {0};

//знаходжянення середнього значення першого стовпця
for (int i = 1 ; i<= a; i++ ){
     suma[1]+=N[i][1];
}
seredina[1] = suma[1]/a;


cout <<"середнє арифмитичне стопця номер 1: "<<seredina[1]<<endl;

//скільки чисел є більшими за середнє арифметичне попереднього стовпеця
 
for (int j = 2 ; j <= b; j++){

    
    for (int i = 1 ; i <= a; i++){
        if (N[i][j] > seredina[j-1]){
            pid[j]++;
        }
    }

    for (int i = 1 ; i <= a; i++){
        suma[j]+=N[i][j];
    }
    seredina[j] = suma[j]/a;

    cout <<"стовпець "<<j<<": кількість елементів більших за середнє попереднього стовпця = "<<pid[j]<<endl;
}

    return 0;
 }