/* Задача: Лабораторна робота №1. Завдання №2. Варіант №22
    Автор:Пилип'як Олег
    Група: ШІ-12
*/
#include <iostream>
using namespace std;

int main() {
    int n, m;
    // Обчислення першого виразу ++n * ++m
    n=6;
    m=4;
    cout << "Початкове значення чисел:" << endl << "n=" << n << endl << "m=" << m << endl;
    int res_1= ++n * ++m;
    cout << "1. Результат ++n * ++m: " << res_1 << endl;
    cout << "Значення змінних після обчислення 1-го виразу:" <<endl << "n=" << n << endl << "m=" << m << endl;
    //Обчислення другого виразу m++ < n
    n=6;
    m=4;
    cout << "Початкове значення чисел:" << endl << "n=" << n << endl << "m=" << m << endl;
    bool res_2= m++ < n;
    cout << "2. Результат m++ < n: " << boolalpha << res_2 << endl;
    cout << "Значення змінних після обчислення 2-го виразу:" <<endl << "n=" << n << endl << "m=" << m << endl;
    //Обчислення третього виразу n++ > m
    n=6;
    m=4;
    cout << "Початкове значення чисел:" << endl << "n=" << n << endl << "m=" << m << endl;
    bool res_3= n++ > m;
    cout << "3. Результат n++ > m: " << boolalpha << res_3 << endl;
    cout << "Значення змінних після обчислення 3-го виразу:" <<endl << "n=" << n << endl << "m=" << m << endl;
    return 0;
}