// "Автономність портативної зарядної станції" - Белаш Матвій Валіерійович ШІ-12
#include <iostream> //бібліотека для вводу/виводу
#include <string> //бібліотека для роботи з рядками
#include <cmath> //бібліотека для математичних функцій
#include <iomanip> //бібліотека для форматованого виводу
using namespace std;

int main() {
    
    string model; //додаємо комірки для змінних
    double C;
    int years;
    int charge;
    double eff;
    double P;

    cout << "Модель станції: "; //просимо користувача ввести модель станції та перевіряємо довжину введеного рядка
    if (!(cin >> model) || model.length() > 31 ) {
        cout << "Помилка: довжина моделі станції не повинна перевищувати 31 символ." << endl;
        return 1;
    }
   

    cout << "Паспортна ємність (Вт·год): "; //просимо користувача ввести паспортну ємність та перевіряємо чи введене значення більше 0
    if (!(cin >> C) ||C <= 0 ) {
        cout << "Помилка: паспортна ємність мусить бути більше 0." << endl;
        return 1;
    }
    C = round(C * 10.0) / 10.0; // округлюємо значення ємності до одного знаку після коми 

    cout << "Вік станції (років): "; //просимо користувача ввести вік станції та перевіряємо чи введене значення знаходиться в межах від 0 до 20
    if (!(cin >> years) || years < 0 || years > 20) {
        cout << "Помилка: вік станції мусить бути від 0 до 20." << endl;
        return 1;
    }

    cout << "Рівень заряду (%): "; //просимо користувача ввести рівень заряду та перевіряємо чи введене значення знаходиться в межах від 0 до 100
    if (!(cin >> charge) || charge < 0 || charge > 100) {
        cout << "Помилка: рівень заряду мусить бути від 0 до 100." << endl;
        return 1;
    }

    cout << "ККД інвертора (%): "; //просимо користувача ввести ККД інвертора та перевіряємо чи введене значення знаходиться в межах від 0 до 100
    if (!(cin >> eff) || eff <= 0 || eff > 100) {
        cout << "Помилка: ККД інвертора мусить бути більше 0 і не більше 100." << endl;
        return 1;
    }
    eff = round(eff * 100.0) / 100.0; // округлюємо значення ККД до двох знаків після коми

    cout << "Потужність приладу (Вт): "; //просимо користувача ввести потужність приладу та перевіряємо чи введене значення більше 0
    if (!(cin >> P) || P <= 0) {
        cout << "Помилка: потужність приладу мусить бути більше 0." << endl;
        return 1;
    }

    const double DEGRADATION_RATE_PCT = 2.0; // встановлюємо константу для коефіцієнта деградації батареї (2% на рік)

   
    double C_eff = C * pow(1.0 - DEGRADATION_RATE_PCT / 100.0, years);//розраховуємо різні параметри станції та її роботи
    double E_stored = C_eff * charge / 100.0;
    double E_useful = E_stored * eff / 100.0;
    double E_loss = E_stored - E_useful;
    double T = E_useful / P;

    int h = T; // розраховуємо години та хвилини роботи станції
    int m = (T - h) * 60.0;
    
    cout << "----------------------------------------" << endl; //виводимо підсумкову інформацію про станцію та її роботу
    cout << "Модель станціЇ: " << model << endl;
    cout << "Фактична ємність: " << fixed << setprecision(1) << C_eff << " Вт * год" << endl;
    cout << "Корисна енергія: " << E_useful << " Вт * год" << endl;
    cout << "Втрати на перетворенні напруги: " << E_loss << " Вт * год" << endl;
    cout << "Час роботи: " << h << " годин " << m << " хвилин " << endl;
    cout << "----------------------------------------" << endl; // виводимо підсумкову інформацію про станцію та її роботу
    
    return 0;
}
