/*
Назва задачі: Автономність портативної зарядної станції 
Автор: Королюк Соломія
Група: ШІ-13
*/

#include <iostream> // Підключення бібліотеки для вводу/виводу
#include <string> // Підключення бібліотеки для роботи з рядками
#include <cmath> // Підключення бібліотеки для математичних функцій (pow)
#include <iomanip> // Підключення бібліотеки для форматування виводу (setprecision)

using namespace std; // Використання простору імен std для зручності

int main() {

    string model;
    double C, eff, P;
    int years, charge;

    const double degradation_rate = 2.0; // Константа для коефіцієнта деградації

    //Ввід даних 
    // fail() - метод, який перевіряє, чи відбувся збій під час останньої операції вводу. Якщо відбулося, він повертає true, інакше - false.
    // peak() != '\n' - перевірка на наявність сторонніх символів після вводу числа. Якщо після числа є інші символи (наприклад, букви), то це вважається некоректним вводом.

    cout << "Введіть модель станцій: ";
    cin >> model;

    if (model.length() > 31 || model.length() < 1 || cin.peek() != '\n') {
        cout << "Некоректний ввід даних. Модель станцій не повинна перевищувати 31 символ або бути порожньою." << endl;
        return 1;
    }

    cout << "Введіть паспортну ємність станцій (Вт·год): ";
    cin >> C;

    if (cin.fail() || C <= 1 || cin.peek() != '\n') {
        cout << "Некоректний ввід даних. Паспортна ємність станцій повинна бути більше 1 а також не містити сторонніх символів." << endl;
        return 1;
    }

    cout << "Введіть вік станції (років): ";
    cin >> years;

    if (cin.fail() || years < 0 || years > 20 || cin.peek() != '\n') {
        cout << "Некоректний ввід даних. Вік станцій не може бути від'ємним чи більшим, ніж 20 років та не повинен містити сторонніх символів." << endl;
        return 1;
    }

    cout << "Введіть рівень заряду станцій (0-100%): ";
    cin >> charge;

    if (cin.fail() || charge < 0 || charge > 100 || cin.peek() != '\n') {
        cout << "Некоректний ввід даних. Рівень заряду станцій повинен бути в межах 0-100 та не повинен містити сторонніх символів." << endl;
        return 1;
    }

    cout << "Введіть ККД інвентора (0-100%): ";
    cin >> eff;

    if (cin.fail() || eff < 0 || eff > 100 || cin.peek() != '\n') {
        cout << "Некоректний ввід даних. ККД інвертора повинен бути в межах 0-100 та не повинен містити сторонніх символів." << endl;
        return 1;
    }

    cout << "Введіть потужність приладу (Вт): ";
    cin >> P;

    if (cin.fail() || P <= 0 || cin.peek() != '\n') {
        cout << "Некоректний ввід даних. Потужність приладу повинна бути більше 0 та не повинна містити сторонніх символів." << endl;
        return 1;
    }

    // Переводимо щорічну втрату ємності з відсотків у частку та враховуємо вік станції.
    double C_eff = C * pow(1 - degradation_rate / 100, years); // Фактична ємність, у Вт·год

    // Визначаємо енергію, накопичену з урахуванням поточного рівня заряду.
    double E_stored = C_eff * charge / 100.0; // Запасена енергія, у Вт·год

    // Враховуємо ККД інвертора, щоб отримати енергію, доступну для приладу.
    double E_useful = E_stored * eff / 100.0; // Корисна енергія, у Вт·год

    // Обчислюємо енергію, втрачену під час перетворення інвертором.
    double E_loss = E_stored - E_useful; // Втрати енергії, у Вт·год

    // Визначаємо час роботи приладу за корисною енергією та його потужністю.
    double T = E_useful / P; // Час роботи, у годинах

    // Відокремлюємо повні години від дробової частини часу роботи.
    int h = int(T); // Повні години роботи, у годинах

    // Переводимо дробову частину години у хвилини для зручного відображення.
    int m = int((T - h) * 60); // Додатковий час роботи, у хвилинах


    cout << endl;
    cout << "Модель: " << model << endl;
    cout << "Паспортна ємність: " << fixed << setprecision(1) << C << " Вт·год" << endl; // Вивід паспортної ємності з точністю до 1 знаку після коми
    cout << "Вік станцій: " << years <<  " р." << endl;
    cout << "Фактична ємність: " << fixed << setprecision(1) << C_eff << " Вт·год" << endl;
    cout << "Рівень заряду: " << charge << " %" << endl;
    cout << "ККД інвертора: " << fixed << setprecision(2) << eff << " %" << endl;
    cout << "Запас енергії: " << fixed << setprecision(1) << E_stored << " Вт·год" << endl;
    cout << "Корисна енергія: " << fixed << setprecision(1) << E_useful << " Вт·год" << endl;
    cout << "Втрати на перетворення: " << fixed << setprecision(1) << E_loss << " Вт·год" << endl;
    cout << "Час роботи: " << fixed << setprecision(2) << T << " год" << " = " << h << " год " << m << " хв" << endl;

    return 0;
}
