/*
Задача з алготестеру, 1 варіант.
Мельник Олександра
Lab 1v1
1 сек., 256 МіБ
Умова:
У вашого персонажа є H хітпойнтів та M мани.
Персонаж 3 рази використає закляття, кожне з яких може використати хітпойнти та ману одночасно.
Якщо якесь закляття забирає і хітпойнти і ману - ваш персонаж програє, отже для виграшу треба використовувати при одному заклинанні АБО хітпойнти, АБО ману.
Якщо в кінці персонаж буде мати додатню кількість хітпойнтів та мани (𝐻,𝑀 >0) - він виграє, в іншому випадку програє.
Ваше завдання у випадку виграшу персонажа вивести YES, вивести NO у іншому випадку.
Вхідні дані
2 цілих числа 𝐻 та 𝑀 - хітпойнти та мана персонажа
3 рядки по 2 цілих числа, ℎ𝑖 та 𝑚𝑖 - кількість хітпойнтів та мани, які ваш персонаж потратить за хід на 𝑖 заклинання
Вихідні дані
𝑌⁢𝐸⁢𝑆 - якщо ваш персонаж виграє
𝑁⁢𝑂 - у всіх інших випадках*/ 
#include <iostream>
using namespace std;
int main()
{
    long long H, m, h1, m1;
    int k=0;
    cin>>H>>m;
    for (int i=0; i<3; i++)
    {
        cin>>h1>>m1;
        H-=h1;
        m-=m1;
        if (h1>0 && m1>0)
        {
            k--;
        }
    }
    if (H>0 && m>0 && k==0)
    {
        cout<<"YES";
    }
    else 
    {
        cout<<"NO";
    }
} 

