// Lab 1, task 2, Мельник Олександра, варіант 3
#include <iostream>
#include <iomanip>
using namespace std;
int main()
{
    int n,m;
    cout<<"Введіть значення n: "<<endl;
    cin>>n;
    cout<<"Введіть значення m: "<<endl;
    cin>>m;

    // 1 вираз n---m
    // Спочатку для віднімання використовується поточне значення числа n, від якого віднімається m, після чого виконується постфіксний декремент числа n
    int result1=n-- -m;
    cout<<result1<<endl;
    // 2 вираз m--<n
    // Спочатку виконується порівняння поточного значення числа m з числом n, після чого відбувається постфіксний декремент числа m
    int result2=m-- <n;
    cout<<result2<<endl;
    // 3 вираз n++>m
    // Спочатку виконується порівняння поточного значення числа n з числом m, після чого відбувається постфіксний інкремент числа n
    int result3=n++ >m;
    cout<<result3<<endl;
}