/*
Хелловін
Умова:
До Зеника і Марічки на Хелловін завітав їхній старий друг Андрій. Офіційна причина його візиту — дізнатися про справи друзів та просто побалакати з ними.
Але Зенику і Марічці добре відомі справжні наміри Андрія — він просто хоче дістати від друзів цукерок.
У Зеника і Марічки є по одному мішку цукерок. Усього в мішку Зеника є 𝑛 цукерок, причому 𝑖-та із них коштує 𝑎𝑖 гривень.
Аналогічно, у мішку Марічки є 𝑚 цукерок, і ціна 𝑖-ї рівна 𝑏𝑖 гривень. Вони хочуть дати Андрію дві цукерки — одну з мішка Зеника, а іншу — з мішка Марічки.
Будучи доволі жадібними, воно готові віддати Андрію лише найдешевші цукерки.
Тобто, як і з першого мішка, так і з другого, вони виберуть по найдешевшій цукерці. Якою буде вартість отриманого Андрієм подарунка?
Іншими словами, знайдіть сумарну вартість двох цукерок, які отримає Андрій.
Вхідні дані
У першому рядку задано два цілих числа 𝑛 та 𝑚 — кількості цукерок в мішках Зеника та Марічки відповідно.
У другому рядку задано 𝑛 цілих чисел, розділених пробілами. Вони описують вартості Зеникових цукерок.
У третьому рядку аналогічно описані 𝑚 цукерок Марічки.
Вихідні дані
У єдиному рядку виведіть одне ціле число — вартість подарунку, який отримає Андрій.
*/
#include <iostream>
#include <algorithm>
using namespace std;
int main()
{
    int n,m;
    cin>>n>>m;
    int cheapestN=2000, cheapestM=2000;
    int f[n], g[m];
    for (int i=0; i<n; i++)
    {
        cin>>f[i];
        cheapestN=min(cheapestN,f[i]);
    }
    for (int i=0; i<m; i++){
        cin>>g[i];
        cheapestM=min(cheapestM,g[i]);
    }
    cout<<cheapestM+cheapestN;
}