/*
Скільки років?
Умова:
За вікном вже 2025 рік!
Зеник разом із своїми друзями весело проводять час на зимових канікулах. Всім дуже весело! Але в один момент Зеник зрозумів, що в цьому році йому буде цілих 15 років! І йому стало дуже цікаво, а в якому році йому буде 𝑛 років?

Вхідні дані
В єдиному рядку задано ціле число 𝑛 — вік Зеника.

Вихідні дані
В єдиному рядку виведіть в якому році Зенику буде 𝑛 років.
*/ 

#include <iostream>
using namespace std;
int main()
{
    long n,birth=2010;
    cin>>n;
    cout<<birth+n;
}