/*
Рейтинг Петрика
Умова:
Маловідомий програміст Петро любить усім розказувати, який у нього високий рейтинг на сайті «Horsecoder». 
Його справжній рейтинг рівний 𝑥, але він може назвати будь-яке число з відрізку [𝑥 −𝑦,𝑥 +𝑦]. 
Богдан натомість вперто відмовляється вірити, що рейтинг Петрика може бути більшим за 𝑧.
Допоможіть Петрику — скажіть, у який максимальний рейтинг Богдан зможе повірити, або визначте, що такого рейтингу не існує.

Вхідні дані
У єдиному рядку містяться три цілі числа 𝑥, 𝑦 та 𝑧.

Вихідні дані
У єдиному рядку виведіть ціле число — відповідь на задачу, або -1, якщо такого рейтингу не існує.
*/

#include <iostream>
#include <algorithm>
using namespace std;
int main()
{
    long x,y,z;
    cin>>x>>y>>z;
    int max=min(x+y,z);
    if (max<x-y){
        cout<<-1<<endl;

    }
    else {
        cout<<max<<endl;
    }
}