
/*  
Lab 1 Task 2
Дохнюк Богдан 
ШІ-14
Варіант 5 
*/
#include <iostream>
using namespace std;

int main() {

int m,n;
cout<<"Введіть значення  m та n :";
// введення даних
cin>>m>>n;   
/*спочатку значення змінної m зменшується на 1 потім значення змінної n збільшується на 1
після цього від нового m - нове n */
cout<<"1) (--m-++n) = "<<(--m-++n)<<" ; m = "<<m<<" ; n = " <<n<<endl;
// спочатку m * n  потім добуток порівнюється з n і після цього n  збільшується на 1
cout<<"2) (m*n<n++) = "<<(m*n<n++)<<" ; m = "<<m<<" ; n = "<<n<<endl;
// перевіряється чи значення n > m потім n зменшується на 1 а m збільшується на 1
cout<<"3) (n-->m++) = "<<(n-->m++)<<" ; m = "<<m<<" ; n = "<<n<<endl;

return 0;
}