
/* 
Задача: Аналізатор надійності пароля 
Дохнюк Богдан 
Ші-14 
 */
#include <iostream>
using namespace std ;

int main (){

int dov, count ;
char c, v, s;
count = 0;

// 1. Введення довжини
cout<<"Довжина пароля: "<<endl;	
cin>>dov;

if ((dov<1) || (dov>64))
{
cout<<"Помилка. Введіть коректне значення від 1 до 64  "<<endl ;
return 1;
}
	
// 2. Наявність цифр
cout<<"Чи є цифри (y/n): "<<endl;
cin>>c;	
if (!(c=='y') && !(c=='n'))
{
cout<<"Помилка. Введіть коректне значення "<<endl ;
return 1;
}

if (c =='y') count++;

// 3. Наявність великих літер
cout<<"Чи є великі літери (y/n): "<<endl;
cin>>v;	
if (!(v=='y') && !(v=='n'))
{
cout<<"Помилка. Введіть коректне значення "<<endl ;
return 1;
}	

if (v=='y') count++;

// 4. Наявність спеціальних символів
cout<<"Чи є спеціальні символи (y/n): "<<endl;	
cin>>s;	
if (!(s=='y') && !(s=='n'))
{
cout<<"Помилка. Введіть коректне значення "<<endl ;
return 1;
}

if (s =='y'){  
count++;
}
// Перевірка на мінімальні вимоги (if else)
cout<<"Мінімальні вимоги : ";
if ((dov<8)||(count<2)){
cout<<"НЕ ПРОЙДЕНО"<<endl;	
}
else {
cout<<"ПРОЙДЕНО"<<endl;
}
// Визначення рівня надійності (if, else if)
 
cout<<"Рівень надійності : ";
 
int level = 0;
 
if (dov < 6) {
level = 1;
cout<<level<<" Дуже слабкий"<<endl;
} 
else if ((dov<8) || (count==0)) {
level = 2;
cout<<level<<" Слабкий"<<endl;
} 
else if (count==1) {
level = 3;
cout<<level<<" Середній"<<endl;
} 
else if ((dov>=12) && (count==3)) {
level = 5;
cout<<level<<" Дуже надійний"<<endl;
}
else {    
level = 4;
cout<<level<<" Надійний"<<endl;
}

// Рекомендація (switch case)
cout<<"Рекомендація : ";
switch (level) {
	
case 1 :
cout<<"Пароль надто короткий. Мінімум 8 символів."<<endl;
break;
case 2:
cout<<"«Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи"<<endl;
break;
case 3:
cout<<"Додайте ще один тип символів або збільште довжину до 12"<<endl;
break;
case 4:
cout<<"Хороший пароль. Для максимуму 12+ символів і всі три типи символів"<<endl;	
break;
case 5:
cout << "Відмінно. Змінювати нічого не потрібно." << endl;
break;
default:
cout<<"Відмінно. Змінювати нічого не потрібно"<<endl;
break;      
}
// Попередження про пароль тільки з літер
if (c == 'n' && s == 'n') {
cout<<"Попередження: пароль тільки з літер підбирається швидше." ;
}
       
return 0;
}