/*
    Задача: Алготестер. Лабораторна робота №1. Завдання №1. Варіант №1
    Автор: Гайдук Маргарита
    Група: ШІ-12
*/
#include <iostream>
using namespace std;
int main() {
    // Введення хітпойнтів і мани персонажа
    long long H, M;
    cin>> H >> M;
    // Введення витрат хітпойнтів і мани для кожного з трьох заклять
    long long h1, h2, h3, m1, m2, m3; 
    cin >> h1 >> m1;
    cin >> h2 >> m2;
    cin >> h3 >> m3;
    // Перевірка заклять: персонаж програє, якщо хоч одне закляття забирає і хітпойнти, і ману одночасно
    bool win = true; 
    if (h1 > 0 && m1 > 0) 
    {
        win = false;
    }
    if (h2 > 0 && m2 > 0) 
    {
        win = false;
    }
    if (h3 > 0 && m3 > 0) 
    {
        win = false;
    }
    // Підрахунок хітпойнтів і мани, що залишилися після трьох заклять
    H -= h1 + h2 + h3;
    M -= m1 + m2 + m3;
    // Виведення результату
    if (win && H>0 && M>0) 
    {
        cout<<"YES"<<endl;
    }
    else
    {
        cout<<"NO"<<endl;
    }
    return 0;
}