/* Аналізатор надійності пароля
   Ярошик Наталія
   ШІ-14
*/
#include <iostream>
using namespace std;

int main(){
    int len; //довжина пароля
    char num, bigl, ch; //чи є цифри, чи є великі літери, чи є спец символи

    //перевіряємо чи користувач вводить правильні дані
    cout << "Довжина пароля (1-64)" << endl;
    cin >> len;
    if(len < 1 || len > 64){
        cout << "Введіть дійсне значення";
        return 1;
    }

    cout << "Чи є цифри (y/n)" << endl;
    cin >> num;
    if(num != 'y' && num != 'n'){
        cout << "Введіть дійсне значення";
        return 1;
    }

    cout << "Чи є великі літери (y/n)" << endl;
    cin >> bigl;
    if(bigl != 'y' && bigl != 'n'){
        cout << "Введіть дійсне значення";
        return 1;
    }

    cout << "Чи є спеціальні символи  (y/n)" << endl;
    cin >> ch;
    if(ch != 'y' && ch != 'n'){
        cout << "Введіть дійсне значення";
        return 1;
    }
    //збільшуємо к-сть символів якщо користувач ввів "y"
    int typesCount = 0;
    if (num == 'y') typesCount++;
    if (bigl == 'y') typesCount++;
    if (ch == 'y') typesCount++;

    /*перевіряємо чи пройдено мінімальні вимоги вводу 
    (символів >= 8 та к-сть типів символів не менше 2)*/

    if(len >= 8 && typesCount >= 2){
        cout << "Мінімальні вимоги: ПРОЙДЕНО" << endl;
    }else{
        cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << endl;
    }

    int level; //рівень надійності паролю

    //перевіряємо який рівень надійності у паролю
    if(len < 6){
        level = 1;
        cout << "Рівень надійності: 1 - Дуже слабкий" << endl;
    }else if(len < 8 || typesCount == 0){
        level = 2;
        cout << "Рівень надійності: 2 - Слабкий" << endl;
    }else if(typesCount == 1){
        level = 3;
        cout << "Рівень надійності: 3 - Середній" << endl;
    }else if(len >= 12 && typesCount == 3){
        level = 5;
        cout << "Рівень надійності: 5 - Дуже надійний" << endl;
    }else{
        level = 4;
        cout << "Рівень надійності: 4 - Надійний" << endl;
    }
    //відповідно до рівня надійності надаємо рекомендації
    switch(level){
        case 1:
            cout << "Рекомендація: Пароль надто короткий. Мінімум 8 символів." << endl;
            break;
        case 2:
            cout << "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl;
            break;
        case 3:
            cout << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12." << endl;
            break;
        case 4:
            cout << "Рекомендація: Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl;
            break;
        case 5:
            cout << "Рекомендація: Відмінно. Змінювати нічого не потрібно." << endl;
            break;
    }

    return 0;
}