/*
Lab 1 task 2, Цьона Олена, ШІ-12, Варіант 20
*/
#include <iostream>

using namespace std;

/*
Вирази для обчислення:
1) m - ++n
2) ++m > --n
3) --n < ++m
*/

int main()
{
    int m_start, n_start;
    cout << "Введіть m: ";
    cin >> m_start;
    cout << "Введіть n: ";
    cin >> n_start;

    cout << "Початкові значення:" << endl 
         << "m: " << m_start << endl 
         << "n: " << n_start << endl << endl;

    // 1 вирвз
    int m = m_start;
    int n = n_start;

    /*
    спочатку виконується префіксний інкремент ++n (значення n збільшується на 1),
    після чого від значення m віднімається нове значення n.
    */
    int result1 = m - ++n;
    cout << "1) Результат операції m - ++n: " << result1 << endl
         << "Значення m: " << m << endl 
         << "Значення n: " << n << endl << endl;

    // 2 вираз
    m = m_start;
    n = n_start;

    /*
    спочатку збільшується m на 1 (префіксний ++m) та зменшується n на 1 (префіксний --n),
    після чого нові значення порівнюються оператором ">" (більше).
    */
    bool result2 = ++m > --n;
    cout << "2) Результат операції ++m > --n: " << result2 << endl
         << "Значення m: " << m << endl 
         << "Значення n: " << n << endl << endl;

    // 3 вираз
    m = m_start;
    n = n_start;

    /*
    спочатку зменшується n на 1 (префіксний --n) та збільшується m на 1 (префіксний ++m),
    після чого нові значення порівнюються оператором "<".
    */
    bool result3 = --n < ++m;
    cout << "3) Результат операції --n < ++m: " << result3 << endl
         << "Значення m: " << m << endl 
         << "Значення n: " << n << endl;

    return 0;
}