/*Автономність портативної зарядної станції
Росіцький Назар
ШІ-11*/
#include <iostream> //Підключення бібліотеки iostream, щоб вводити та виводити дані
#include <string> //Підключення бібліотеки string, щоб зберігати дані про рядок
#include <cmath> //Підключення бібліотеки cmath, щоб підносити числа до степеня
#include <iomanip> //Підключення бібліотеки iomanip, щоб виводити числа з певною кількістю знаків після коми
using namespace std; //Використовуємо функції стандартної бібліотеки, щоб не писати постійно std::

int main() {

    //оголошення змінних
    string model;
    double C, eff, P, C_eff, E_stored, E_useful, E_loss, T;
    int years, charge, h, m;

    //Отримання моделі
    cout << "Модель станції: ";
    getline(cin, model);

    //Перевірка значення 
    if(model.find(" ") != string::npos){
        cout << "Модель не може містити пробіли";
        return 1;
    } else if(model.length() > 31){
        cout << "Модель не може довшою за 31 літеру";
        return 1;
    } else if(model.empty()){
        cout << "Модель не може бути пустою";
        return 1;
    }

    //Отримання ємності
    cout << "Паспортна ємність, Вт·год: ";
    cin >> C;
    //Перевірка значення 
    if(C <= 0){
        cout << "Введіть дійсне значення";
        return 1;
    }

    //Отримання віку
    cout << "Вік станції, років: ";
    cin >> years;
    //Перевірка значення
    if (cin.fail() || cin.peek() == ',' || cin.peek() == '.' || years > 20 || years < 0){
       cout << "Недопустимий формат вводу: значення має бути цілим числом від 0 до 20";
       return 1;
    }

    //Отримання заряду
    cout << "Рівень заряду, %: ";
    cin >> charge;
    //Перевірка значення
    if (cin.fail() || cin.peek() == ',' || cin.peek() == '.' || charge > 100 || charge < 0){
       cout << "Недопустимий формат вводу: значення має бути цілим числом від 0 до 100";
       return 1;
    }

    //Отримання ККД
    cout << "ККД інвертора, %: ";
    cin >> eff;
    //Перевірка значення
    if (cin.fail() || eff > 100 || eff <= 0){
       cout << "Недопустимий формат вводу: значення має бути цілим числом до 100 та більше за 0";
       return 1;
    }

    //Отримання потужності
    cout << "Потужність приладу, Вт: ";
    cin >> P;
    //Перевірка значення
    if(P <= 0){
        cout << "Введіть дійсне значення";
        return 1;
    }

    //Обчислення результатів
    C_eff = C * pow(98.0 / 100.0, years); //Ємність що залишилась
    E_stored = C_eff * charge / 100.0; //Енергія, що зберігається
    E_useful = E_stored * eff / 100.0; //Корисна енергія
    E_loss = E_stored - E_useful; //Втрата енергії
    T = E_useful / P; //Час роботи приладу
    h = floor(T); //цілі години роботи
    m = floor((T-h)*60.0); //цілі хвилини роботи

    //Виведення результатів, використовуємо setprecision(), щоб виводити потрібну нам кількість знаків після коми
    cout << "Модель:                 " << model << endl;
    cout << "Паспортна ємність:      " << fixed << setprecision(1) << C << " Вт·год" << endl;
    cout << "Вік станції:            " << years << " р." << endl;
    cout << "Фактична ємність:       " << C_eff << " Вт·год" << endl;
    cout << "Рівень заряду:          " << charge << " %" << endl;
    cout << "ККД інвертора:          " << setprecision(0) << eff << " %" << endl;
    cout << "Запас енергії:          " << setprecision(1) << E_stored << " Вт·год" << endl;
    cout << "Корисна енергія:        " << E_useful << " Вт·год" << endl;
    cout << "Втрати на перетворенні: " << E_loss << " Вт·год" << endl;
    cout << "Час роботи:             " << setprecision(2) << T << " год = " << h << " год " << m << " хв" << endl;

}
   