/*  

Депутатські гроші
Обмеження: 2 сек., 256 МіБ

Часто-густо громадяни намагаються з’ясувати, наскільки багатими є депутати. Дехто вірить, що матеріальні статки окремих депутатів є необмеженими.

Тож уявіть собі депутата, у якого є необмежена кількість купюр усіх номіналів (1, 2, 5, 10, 20, 50, 100, 200 та 500 гривень). Він хоче придбати подарунок для своєї тещі, що коштує 𝑛 гривень.

Незважаючи на те, що наш герой-олігарх є нескінченно багатим, він також є нескінченно скупим та педантичним. Саме тому він хоче оплатити покупку готівкою без решти. Яка мінімальна кількість купюр йому для цього знадобиться?

Вхідні дані
У єдиному рядку задано одне натуральне число 𝑛 — вартість подарунку.

Вихідні дані
У єдиному рядку виведіть одне ціле число — мінімальну кількість купюр, що необхідна для покупки подарунка.

*/

#include <iostream>

int main() {
    long long n;
    std::cin >> n;

    long long count = 0;

    count += n / 500;
    n %= 500;

    count += n / 200;
    n %= 200;

    count += n / 100;
    n %= 100;

    count += n / 50;
    n %= 50;

    count += n / 20;
    n %= 20;

    count += n / 10;
    n %= 10;

    count += n / 5;
    n %= 5;

    count += n / 2;
    n %= 2;

    count += n; // залишок оплачуємо купюрами по 1 грн

    std::cout << count << '\n';

    return 0;
}