#include <iostream>

using namespace std;

int main() {
    long long a, b;
    // Введення двох цілих чисел a та b випитий чай вранці та ввечері
    cin >> a >> b;
    // Перевірка умови, чи різниця між a та b кратна 12, щоб знати чи кількість випитого чаю вранці та ввечері може бути рівномірно розподілена протягом дня
    if ((a - b) % 12 == 0) {
        // Виведення випитого чаю за день
        cout << (a + b) / 2 * 13 << endl;
    } else {
        cout << "-1" << endl;
    }

    return 0;
}