/*
Грабовенський Кирило СШІ-13


EPIC 1
practise task
Автономність портативної зарядної станції


*/






#include <iostream>
#include <clocale> 
#include <windows.h>


using namespace std;


int main()
{


    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);


    cout << "вкажіть модель зарядної станції\n";


    string model;


    cin >> model;
    if (model.length() > 31)
    {
        cout << "ВИВІД ПРОГРАМИ\n";
        cout << "задовга назва має бути не більш як 31 символ\n";
        cout << "Модель:\n" << model << "\n";
        return 1;
    }



    cout << "вкажіть паспортну ємність(Вт * год)\n";


    float C{}; // C - паспортна ємність

    cin >> C;


    if (C < 0)
    {
        cout << "ВИВІД ПРОГРАМИ\n";
        cout << "Модель:\n" << model << "\n";
        cout << "неможливо, число не може бути менше нуля\n";
        cout << "Паспортна ємність:\n" << C << "Вт * год\n";
        return 1;
    }



    cout << "вкажіть вік станції\n";


    int years;


    cin >> years;
    if (years > 20)
    {
        cout << "ВИВІД ПРОГРАМИ\n";


        cout << "Модель:\n" << model << "\n";


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        cout << "не підтримується данний вік має бути менше 20\n";


        return 1;
    }

    if (years < 0)
    {
        cout << "ВИВІД ПРОГРАМИ\n";

        cout << "Модель:\n" << model;


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "не правильний вік як в тебе опинилась станція з відємним віком в тебе що телепорт в часі\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        return 1;
    }



    cout << "вкажіть рівень заряду\n";


    int charge;


    cin >> charge;


    if (charge > 100)
    {
        cout << "ВИВІД ПРОГРАМИ\n";


        cout << "Модель:\n" << model << "\n";


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        cout << "звідки в тебе заряд більший ніж 100%?\n";


        cout << "Рівень заряду становить\n" << charge << "%\n";


        return 1;


    }



    if (charge < 0)
    {


        cout << "ВИВІД ПРОГРАМИ\n";


        cout << "Модель:\n" << model << "\n";


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        cout << "звідки в тебе заряд менший ніж 0%?\n";


        cout << "Рівень заряду становить\n" << charge << "%\n";


        return 1;


    }





    cout << "напишіть ККД інвестора\n";


    double eff; //eff - ккд інвертора


    cin >> eff;


    if (eff > 100)
    {
        cout << "ВИВІД ПРОГРАМИ\n";


        cout << "Модель:\n" << model << "\n";


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        cout << "Рівень заряду становить\n" << charge << "%\n";


        cout << "вітаю ти створив вічний двигун\n";


        cout << "ККД інвестора становить\n" << eff << "%\n";


        return 1;


    }



    if (eff < 0)
    {
        cout << "ВИВІД ПРОГРАМИ\n";


        cout << "Модель:\n" << model << "\n";


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        cout << "Рівень заряду становить\n" << charge << "%\n";


        cout << "Що? Як?\n";


        cout << "ККД інвестора становить\n" << eff << "%\n";


        return 1;


    }



    cout << "напишіть потужність\n";


    double p; //p - потужність


    cin >> p;


    if (p < 0)
    {
        cout << "ВИВІД ПРОГРАМИ\n";


        cout << "Модель:\n" << model << "\n";


        cout << "Паспортна ємність:\n" << C << "Вт * год\n";


        cout << "Вік станції\n" << years << "років/рік/роки\n";


        cout << "Рівень заряду становить\n" << charge << "%\n";


        cout << "ККД інвестора становить\n" << eff << "%\n";


        cout << "потужнісь менша 0? Нічого собі\n";


        cout << "потужність становить:\n" << p << "Вт\n";


        return 1;
    }

    double C_eff1 = (1 - 2 / 100) ^ years; // дія  поділена на двоє; C_eff1 - 1 частина;C_eff - фактична ємність
    double C_eff = C * C_eff1;


    double E_stored = C_eff * charge / 100; //E_stored - енергія запас енергії


    double E_useful = E_stored * eff / 100; // E_useful - корисна енергія


    double E_loss = E_stored - E_useful; // E_loss - витрачена енергія


    double T = E_useful / p; // T - час роботи;


    int h = T; // h - повні години


    int m = (T - h) * 60; // m - хвилини






    cout << "ВИВІД ПРОГРАМИ\n";


    cout << "Модель:\n" << model << "\n";


    cout << "Паспортна ємність:\n" << C << "Вт * год\n";


    cout << "Вік станції\n" << years << "р.\n";


    cout << "Фактична ємність\n" << C_eff << "Вт * год\n";


    cout << "Рівень заряду становить\n" << charge << "%\n";


    cout << "ККД інвестора становить\n" << eff << "%\n";


    cout << "Запас енергії становить\n" << E_stored << "Вт * год\n";


    cout << "Корисна енегргія\n" << E_useful << "Вт * год\n";


    cout << "Витрати на перетворенні становлять\n" << E_loss << "Вт * год\n";


    cout << "Час роботи становить\n" << h << "год" << m << "хв\n";


    return 0;


}
