/*
Задача: Автономність портативної зарядної станції
Автор: Шмигельсий Владислав
Номер групи: СШІ-12

*/

#include <iostream>
#include <cmath>
#include <iomanip>
#include <string>
int main()
{
    using namespace std; // щоб не писати std:: перед кожним елементом зі стандартної бібліотеки //

    string model;               // Введення текстової змінної для моделі станції будь-якої довжини//
    cout << "Модель станції: "; // Виведення тексту на екран//
    cin >> model;               // Ввід даних користувачем//
    if (model.length() > 31)
    {
        cout << "Модель станції повинна бути не більше 31 символу";
        // Встановлення умови,яка обмежує довжнину назви моделі до 31 символу//
        return 1;
    }

    // Створення змінних для введення даних користувачем//
    double c; // Створення змінної з плаваючою комою для введення паспортної ємності станції//
    cout << "Паспортна ємність (Вт·год): ";
    cin >> c;
    if (c <= 0)
    {
        cout << "Паспортна ємність повинна бути більше 0";
        return 1; // Встановлення умови, яка обмежує паспортну ємність станції//
    }

    int years; // Створення цілочисельної змінної для введення віку станції//
    cout << "Вік станції (років): ";
    cin >> years;
    if (years < 0 || years > 20)
    {
        cout << "Вік станції повинен бути від 0 до 20 років";
        return 1;
    }

    double charge;
    cout << "Рівень заряду (%): ";
    cin >> charge;
    if (charge < 0 || charge > 100)
    {
        cout << "Рівень заряду повинен бути від 0 до 100%";
        return 1;
    }

    double eff;
    cout << "ККД інвертора (%): ";
    cin >> eff;
    if (eff < 0 || eff > 100)
    {
        cout << "ККД інвертора повинно бути від 0 до 100";
        return 1;
    }

    double P;
    cout << "Потужність приладу (Вт): ";
    cin >> P;
    if (P <= 0)
    {
        cout << "Потужність приладу повинна бути більше 0";
        return 1;
    }

    const double Capacity_loss = 2.0; /* Встановлення сталого значення для відсотоку
     втрати ємності акумулятора щороку */

    double C_eff = c * pow(1.0 - (Capacity_loss / 100.0), years);
    // Обчислення фактичної ємності станції з урахуванням зносу за роки (Вт·год)//

    double E_stored = C_eff * charge / 100.0;
    // Обчислення при поточному рівні заряду//

    double E_useful = E_stored * eff / 100.0;
    // Обчислення корисного обсягу енергії,що дійде до приладу//

    double E_loss = E_stored - E_useful;
    // Обчислення втрати енергії під час перетворення//

    double T = E_useful / P;
    // Обчислення часу роботи в годинах//

    int h = int(T);
    // Повні години//
    double m = (int((T - h) * 60));
    // Хвилини, що залишилися//

    // Виведення результатів розрахунку//
    cout << endl;
    cout << "Модель станції: " << model << endl;
    cout << "Паспортна ємність: " << fixed << setprecision(1) << c << " Вт·год" << endl;
    cout << "Вік станції: " << years << " років" << endl;
    cout << "Фактичнаи ємність: " << fixed << setprecision(1) << C_eff << " Вт·год" << endl;
    cout << "Рівень заряду: " << fixed << setprecision(1) << charge << "%" << endl;
    cout << "ККД інвертора: " << fixed << setprecision(2) << eff << "%" << endl;
    cout << "Запас енергії: " << fixed << setprecision(1) << E_stored << " Вт·год" << endl;
    cout << "Корисна енергія: " << fixed << setprecision(1) << E_useful << " Вт·год" << endl;
    cout << "Втрати енергії: " << fixed << setprecision(1) << E_loss << " Вт·год" << endl;
    cout << "Час роботи приладу: " << h << " годин ";
    if (m < 10) {
    cout << "0" << m << " хвилин " << endl;
} else {
    cout << m << " хвилин " << endl;
}
    // Додавання 0, якщо хвилини менше 10, щоб хвилини завжди відображалися у двозначному форматі//
    return 0;
}
