/*
Мельник Олександра ШІ-13
Lab 3v2
Обмеження: 1 сек., 256 МіБ

Вам дано 2 масиви розміром N та M. Значення у цих масивах унікальні.
Ваше завдання вивести у першому рядку кількість елементів, які наявні в обох масивах одночасно, у другому кількість унікальних елементів в обох масивах разом.
*/
#include <iostream>
using namespace std;
int f[105],g[105];
int main(){
    int N,M;
    int q1=0, q2=0;
    cin>>N;
    for (int i=0; i<N; i++){
        cin>>f[i];
    }
    cin>>M;
    for (int j=0; j<M; j++){
        cin>>g[j];
    }
    for (int i=0; i<N; i++){
        for (int j=0; j<M; j++){
            if (f[i]==g[j]){
                q1++;
            }
        }
    }
    q2=N+M-q1;
    cout<<q1<<endl<<q2;
}