/*
Вогняне дихання
Обмеження: 2 сек., 256 МіБ

Одного разу Сеньйор розповів Дракону, що минулого вечора він 𝑘 разів бачив над лісом дим. Як ви знаєте, диму без вогню не буває. Дракон пригадав, що вчора він гуляв лісом та час від часу заради розваги дмухав вогнем, як це інколи роблять всі поважні дракони.
Всього Дракон дмухав вогнем у 𝑛 точках. Сеньйору раптом стало цікаво — наскільки далеко він може побачити драконів дим?
Нехай відстань, на яку видно дим — 𝑟. Тоді кожного разу, коли Дракон дмухає вогнем, дим можуть побачити лише ті, хто знаходиться на відстані не більшій ніж 𝑟 від дракона.
Знаючи координати хатинки Сеньйора, а також усіх місць,
де дмухав вогнем Дракон, скажіть, яка найменша можлива відстань 𝑟, при якій Сеньйор міг бачити дим хоча б 𝑘 разів.
*/
#include <iostream>
#include <cmath>
#include <iomanip>
#include <vector>
#include <algorithm>
using namespace std;

int main()
{
    long long X,Y,x,y;
    int n,k;
    cin>>X>>Y;
    cin>>n>>k;
    vector <double> distance(n);
    for (int i=0; i<n; i++)
    {
        cin>>x>>y;
        long long lenx=X-x;
        long long leny=Y-y;
        distance[i]=sqrt(pow(lenx,2)+pow(leny,2));
        
    }
    sort(distance.begin(), distance.end());
    cout<<fixed<<setprecision(8)<<distance[k-1];
    
}
