
/* 
Епік 2. Алготестер 1. Варіант 2.
Авторка: Ташогло Влада
Група: ші-11
*/

#include <iostream>
#include <algorithm>

using namespace std;

int main() {
    // Початкові довжини ніжок та величини, які потрібно відпиляти
    long long h[4], d[4];

    // Зчитуємо довжини ніжок
    for (int i = 0; i < 4; i++) cin >> h[i];
    // Зчитуємо величини відпилювань для кожної ніжки
    for (int i = 0; i < 4; i++) cin >> d[i];

    // Перевіряємо, чи не намагаються відпиляти більше, ніж є у ніжки
    for (int i = 0; i < 4; i++) {
        if (d[i] > h[i]) {
            cout << "ERROR\n";
            return 0;
        }
    }

    // Флаг, який показує, чи стіл перевернувся хоча б один раз під час маніпуляцій
    bool flipped = false;

    // Поетапно відпилюємо кожну ніжку і перевіряємо стан столу після кожного кроку
    for (int i = 0; i < 4; i++) {
        h[i] -= d[i];

        // Знаходимо найбільшу та найменшу довжину серед усіх ніжок після відпилювання
        long long h_max = *max_element(h, h + 4);
        long long h_min = *min_element(h, h + 4);

        // Якщо найдовша ніжка не менше, ніж у 2 рази довша за найкоротшу,
        // стіл перевертається
        if (h_max >= 2 * h_min) {
            flipped = true;
        }
    }

    // Якщо стіл не перевертався і всі ніжки однакової довжини та позитивні,
    // то він цілісний і паралельний підлозі
    if (!flipped && h[0] == h[1] && h[1] == h[2] && h[2] == h[3] && h[0] > 0) {
        cout << "YES" << endl;
    } else {
        cout << "NO" << endl;
    }

    return 0;
}