/*Коли Коля та Вася прийшли робити ремонт на «Екстралогіку» — першим, що вони побачили в офісі, був стіл для настільного тенісу. Поки всі інші працювали, Коля та Вася вирішили пограти. Через декілька годин прийшов директор і накричав на заробітчан через те, що вони нічим не займаються. Тож Вася і Коля мусили йти працювати.

По дорозі вони сперечалися, хто ж виграв і з яким рахунком. Оскільки вони записували результати кожної подачі, то це можна порахувати. Але оскільки гра тривала дуже довго — порахувати це вручну дуже тяжко.

Всього відбулося 𝑛 подач. Про кожну з них ми знаємо, хто переміг. За виграну подачу гравець отримує одне очко. Партія вважається виграною, коли один з гравців набере не менше одинадцяти очок з перевагою щонайменше у два очки. Наприклад, за рахунків 11:9, 4:11, 15:13 партія закінчується, а за рахунків 11:10 та 99:98 — ні. Як тільки Коля і Вася закінчили одну партію — вони починають іншу.

Знаючи, хто переміг кожної подачі — виведіть загальний рахунок по партіях в грі Коля-Вася. А якщо вони не дограли останню партію, то і її рахунок теж.

Вхідні дані
У першому рядку задано ціле число 𝑛 — загальна кількість подач.

У другому рядку задано 𝑛 символів 𝑐𝑖. 𝑐𝑖 =𝙺, якщо 𝑖-ту подачу виграв Коля, та 𝑐𝑖 =𝚅, якщо 𝑖-ту подачу виграв Вася.

Вихідні дані
У першому рядку виведіть загальний рахунок гри по партіях у форматі 𝑘 :𝑣, де 𝑘 — кількість партій, у яких переміг Коля, а 𝑣 — кількість партій, у яких переміг Вася.

Якщо вони не дограли останню партію, то в другому рядку в такому ж форматі виведіть рахунок останньої партії.*/

#include <iostream>
#include <cmath>
using namespace std;

int main() {
    int n;
    int k = 0, v = 0;
    int colia_games = 0, vasia_games = 0;
    
    cin >> n;
    string s;
    cin >> s;
    
    for (int i = 0; i < n; i++) {
        if (s[i] == 'K') {
            k += 1;
        }
        else if (s[i] == 'V') { 
            v += 1;
        }
        
 
        if ((k >= 11 || v >= 11) && abs(k - v) >= 2) {
            if (k > v) {
                colia_games += 1;
            }
            else {
                vasia_games += 1;
            }

            k = 0;
            v = 0;
        }
    }
    cout << colia_games << ":" << vasia_games << endl;
    if (k > 0 || v > 0) {
        cout << k << ":" << v << endl;
    }
    return 0;
}
