/*
Складний екзамен
Обмеження: 2 сек., 256 МіБ

У Зеника сьогодні дуже складний екзамен з лінійної алгебри та аналітичної геометрії. Зеник звісно дуже любить цей предмет, але вчити його неймовірно складно.

Ярослав Михайлович, який викладає алгебру та геометрію, це розуміє, тому допомагає студентам як може. Він ввів правило, що тому хто прийде зі щасливим квиточком він поставить 5 автоматом. Щасливим вважається квиток який містить в своєму номері 47. Наприклад, квиток з номером 12347568 щасливий, а з номером 12374578 — ні.

Зеник хотів серйозно підготуватися, але як тут підготуєшся, коли лінь. Тому він вирішив йти спати, а зранку поїхати в університет на тролейбусі. Він надіється, що йому попадеться щасливий квиток.

Зранку Зенику попався квиток з номером 𝑛. Скажіть чи здасть він екзамен, або чи доведеться йому йти на перездачу. Якщо він здасть екзамен виведіть YES, в іншому випадку — NO.

Вхідні дані
В єдиному рядку задано одне ціле число 𝑛 — номер квитка, який купив Зеник.

Вихідні дані
В єдиному рядку виведіть YES якщо Зенику попався щасливий квиток. Якщо ж квиток Зеника не щаливий виведіть NO.
*/


#include <iostream>
using namespace std;
int main(){
    string n;
    cin >> n;
    for (int i = 0; i < n.length(); i++)
    {
        if(n[i] == '4' && n[i+1] == '7')
        {
            cout << "YES" << endl;
            return 0;
        }
       
    }

    cout << "NO" << endl;
    


    return 0;
}  