#include <iostream>
#include <iomanip>
#include <cmath>
 
using namespace std;
 
int main() {   
    int m, n;
    cout << "Введіть m: ";
    cin >> m;
    cout << "Введіть n: ";
    cin >> n;

    // Зберігаємо початкові значення, щоб відновлювати їх перед кожним виразом
    int m0 = m;
    int n0 = n;
 
    // Вираз 1: n++ - m
    // Постфіксний інкремент: у виразі береться старе n, і лише після обчислення значення n збільшується на 1
    int res = n++ - m;
    cout << "результат виразу n++-m = " << res << endl;
    cout << "\nнове значення m = " << m << endl;
    cout << "нове значення n = " << n << endl;
 
    // Відновлення початкових значень
    m = m0;
    n = n0;
 
    // Відношення 2: m-- > n
    // Порівнюється старе m з n, після порівняння m зменшується на 1
    bool expr1 = (m-- > n);
    cout << boolalpha << "\nВідношення (m-- > n) = " << expr1 << endl;
    cout << "нове значення m = " << m << endl;
    cout << "нове значення n = " << n << endl;
 
    // Відновлення початкових значень
    m = m0;
    n = n0;
 
    // Відношення 3: n-- > m
    // Порівнюється старе n з m, після порівняння n зменшується на 1
    bool expr2 = (n-- > m);
    cout << boolalpha << "\nВідношення (n-- > m) = " << expr2 << endl;
    cout << "нвое значення m = " << m << endl;
    cout << "нове значення n = " << n << endl;
 

 
    return 0;
}
 