/*
Задача: Дороги та міста
Виконав: Давидович Святослав
Група: ШІ-11
*/
/* 
Умова: У країнi, де є n мiст, пронумерованих вiд 1 до n включно, буде побудовано m дорiг.
Кожна дорога сполучає між собою пару різних міст.
Після кожної побудованої дороги треба визначити кількість компонент зв’язності.
*/
/* 
Ідея реалізації: Для представлення компонент зв'язності використано вказівники (реалізовано як індекси у масиві ptr[]:
0-ий індекс - 1-ше місто і т.д.), де кожна група міст має свій ідентифікатор(корінь). 
При додаванні нової дороги за допомогою циклів знаходимо корені обох міст і об'єднуємо компоненти в одну,
паралельно "зв'язуючи" міста з коренем для швидшого виконання подальших операцій.
*/
#include <iostream>

using namespace std;

int main() {
    int ptr[100010];

    int n, m;

    cin >> n >> m;

    int c = n;

    for (int i = 0; i<n; i++){
        ptr[i] = i;
    }

    for (int x = 0; x<m; x++){
        int a, b;
        cin >> a >> b;
        a--;
        b--;

        int root_a = a;
        while (ptr[root_a]!=root_a){
            root_a = ptr[root_a];
        }

        while(ptr[a]!=root_a){
            int next = ptr[a];
            ptr[a]=root_a;
            a = next;
        }

        int root_b = b;
        while (ptr[root_b]!=root_b){
            root_b = ptr[root_b];
        }

        while(ptr[b]!=root_b){
            int next = ptr[b];
            ptr[b]=root_b;
            b = next;
        }

        if (root_a!=root_b){
            ptr[root_b]=root_a;
            c--;
        }
        
        cout << c << "\n";
    }
}