/*
    Задача: Алготестер. Лабораторна робота №1. Завдання №1. Варіант №1
    Автор: Сукaч Андрій
    Група: ШІ-14
*/
#include <iostream>
using namespace std;

int main() {
    
    long long H, M; // хітпойнти і мана 
    cin >> H >> M;
    long long h1, m1, h2, m2, h3, m3; // хітпойнти і мана для кожного закляття
    cin >> h1 >> m1;
    cin >> h2 >> m2;
    cin >> h3 >> m3;
    if ((h1 > 0 && m1 > 0) || (h2 > 0 && m2 > 0) || (h3 > 0 && m3 > 0)) { // перевірка чи закляття забирає і хітпойнти і ману
        cout << "NO" << endl; // якщо так, то персонаж програє
        return 0;
    }
    H -= (h1 + h2 + h3);
    M -= (m1 + m2 + m3);
    if (H > 0 && M > 0) { // перевірка чи персонаж має додатню кількість хітпойнтів та мани
        cout << "YES" << endl; // якщо так, то персонаж виграє
    } else {
        cout << "NO" << endl; // якщо ні, то персонаж програє
    }
    return 0;
}

