/*
    Задача: Алготестер. Лабораторна робота №1. Завдання №1. Варіант №2
    Автор: Сукaч Андрій
    Група: ШІ-14
У вас є стіл, у якого є 4 ніжки, довжини яких вам дано.

Ви хочете зробити ніжки рівної довжини, для цього ви відпиляєте 𝑑 від кожної ніжки (тобто вам буде дано 4 числа, кожне з яких буде означати відпилювання від відповіної ніжки стола).

Якщо під час відпилювання найдовша ніжка стола буде у 2 рази більша-рівна ніж найменша ніжка - стіл перевернеться, але відпилювати ніжки це вам не завадить.

Тобто якщо ℎ𝑚𝑎𝑥 >=2 ∗ℎ𝑚𝑖𝑛 то стіл перевертається. Увага, це може статися і між початком та кінцем відпилювання, наприклад коли відпиляють 2, але ще не встигнуть відпиляти 3тю ніжку. Також ми вважаємо що перед відпилюванням стіл не перевернеться.

Ваше завдання сказати чи після усіх маніпуляцій стіл буде цілий та паралельний підлозі.

Якщо довжина, яку відріжуть буде більша за довжину ножки - вам треба вивести ERROR.

Увага! Навіть якщо стіл перевернеться - ви все одно відпилюєте ніжки і можете отримати ERROR.
Input
4 цілих числа ℎ1,2,3,4 - довжини ніжок стола 4 цілих числа 𝑑1,2,3,4 - довжина, яку відпиляють від відповідної ножки

Output
YES - якщо стіл буде стояти паралельно площині підлоги та довжина найменшої ніжки не буде рівна нулю.

ERROR - у випадку якщо ви відпиляєте більшу довжину ніж має ножка

NO - у інших випадках*/
#include <iostream>
using namespace std;

int main() {
uint h1, h2, h3, h4;
cin >> h1 >> h2 >> h3 >> h4;
uint d1, d2, d3, d4;
cin >> d1 >> d2 >> d3 >> d4;

if (d1 > h1 || d2 > h2 || d3 > h3 || d4 > h4) { // якщо пилять більше ніж довжина ніжки
    cout << "ERROR" << endl;
    return 0;
}


//чи перевернеться перед відпилюванням
uint hmin = min(min(h1, h2), min(h3, h4)); //шукаю мінімум
uint hmax = max(max(h1, h2), max(h3, h4)); //шукаю максимум
if (hmin == 0 || hmax >= 2 * hmin) { 
    cout << "NO" << endl;
    return 0;
}

//Ніжки після відпилювання
uint hd1 = h1 - d1; 
uint hd2 = h2 - d2; 
uint hd3 = h3 - d3;
uint hd4 = h4 - d4;


//чи перевернеться після відпилювання
uint hdmin = min(min(hd1, hd2), min(hd3, hd4)); //шукаю мінімум після відпилювання
uint hdmax = max(max(hd1, hd2), max(hd3, hd4)); //шукаю максимум після відпилювання
if (hdmin == 0 || hdmax >= 2 * hdmin) { 
    cout << "NO" << endl;
    return 0;
}
if (hd1 == hd2 && hd2 == hd3 && hd3 == hd4 && hdmax >= 2 * hdmin) { // якщо всі ніжки мають однакову довжину
    cout << "YES" << endl;
} else {
    cout << "NO" << endl;
}
}