/*Задача: Лабораторна робота №1. Завдання №2. Варіант №22
    Автор: Сукaч Андрій
        Група: ШІ-14
        Обчислити значення виразів. Пояснити отримані результати.
        (++n*++m); (m++<n); (n++>m);*/
#include <iostream>

using namespace std;
int main() {
int n = 0;
int m = 0;
cout << "Введіть ціле число n: ";
cin >> n;
cout << "Введіть ціле число m: ";
cin >> m;

cout << "крок 1: (++n * ++m) значення до обчислення = " << "n="<< n << ", " << "m=" << m << endl;
int a = (++n) * (++m);
cout << " результат = " << a << endl;
cout <<"значення після обчислення = " << "n="<< n << ", " << "m=" << m << endl;
cout << " "<< endl;

cout << "крок 2: (m++<n) значення до обчислення = " << "n="<< n << ", " << "m=" << m << endl;
int b = (m++ < n);
cout << " результат (1 = істина, 0 = хибність) = " << b << endl;
cout <<"значення після обчислення = " << "n="<< n << ", "<< "m=" << m << endl;
cout << " "<< endl;
cout << "крок 3: (n++>m) значення до обчислення = " << "n="<< n << ", " << "m=" << m << endl;
int c = (n++ > m);
cout << " результат (1 = істина, 0 = хибність) = " << c << endl;
cout <<"значення після обчислення = " << "n="<< n << ", "<< "m=" << m << endl;

return 0;
}