/*Epic_1 (Автономність портативної зарядної станції),
Чернихівський Максим, ШІ-14*/
#include <iostream> // для cin та cout
#include <cmath> // для pow та round
#include <string>
using namespace std;

int main(){

    cout << "Модель станції: ";
    string model = "";
    if (cin >> model && (model.length() <= 31) && (model.length() > 0)) {} else {cout << "Назва може містити до 31-го символа."; return 1;};

    cout << "Паспортна ємність (Вт·год): ";
    int C = 0;
    if (cin >> C && C > 0) {} else {cout << "Ємність мусить бути більша за 0."; return 1;}

    cout << "Вік станції (років): ";
    int years = 0;
    if (cin >> years && years > 0 && years < 20) {} else {cout << "Вік станції мусить бути від 0 до 20 років."; return 1;}

    cout << "Рівень заряду (%): ";
    int charge = 0;
    if (cin >> charge && charge > 0 && charge) {} else {cout << "Заряд мусить бути від 1 до 100."; return 1;}

    cout << "ККД інвертора (%): ";
    int eff = 0;
    if (cin >> eff && eff > 0 && eff <= 100) {} else {cout << "ККД мусить бути від 1 до 100."; return 1;}
    
    cout << "Потужність приладу (Вт): ";
    int P = 0;
    if (cin >> P && P > 0) {} else {cout << "Потужнсть мусить бути більша за 0."; return 1;}
    
    double C_eff, E_stored, E_useful, E_loss, T;
    int h, m;

    C_eff = C * pow((1 - 2.0 / 100), years); // Обчислюємо фактичну ємність з урахуванням віку, Вт·год
    E_stored = C_eff * charge / 100; // Обчислюємо запас енергії при поточному заряді, Вт·год
    E_useful = E_stored * eff / 100; // Обчислюємо корисну енергію, що дійде до приладу, Вт·год
    E_loss = E_stored - E_useful; // Обчислюємо втрати на перетворенні напруги, Вт·год
    T = E_useful / P; // Обчислюємо час роботи, годин
    h = T; // Знаходимо кількість повних годин
    m = (T - h) * 60; // Знаходимо хвилини, що залишились

    C_eff = round(C_eff*10)/10; // Округлюємо числа
    E_stored = round(E_stored*10)/10;
    E_useful = round(E_useful*10)/10;
    E_loss = round(E_loss*10)/10;
    T = round(T*100)/100;

    cout << "Модель:                      " << model << "\n"
    << "Паспортна ємність:           " << C << " Вт*год" << "\n"
    << "Вік станції:                 " << years << " р." << "\n"
    << "Фактичка ємність:            " << C_eff << " Вт*год" << "\n"
    << "Рівень заряду:               " << charge << " %" << "\n"
    << "ККД інвертора:               " << eff << " %" << "\n"
    << "Запас енергії:               " << E_stored << " Вт*год" << "\n"
    << "Корисна енергія:             " << E_useful << " Вт*год" << "\n"
    << "Втрати на перетворенні:      " << E_loss << " Вт*год" << "\n";
    
    if(m>=10){ // Переводимо хвилини в двоцифровий формат і виводимо
        cout << "Час роботи:                  " << T << " год = " << h << " год " << m << " хв" ;
    } else {
        cout << "Час роботи:                  " << T << " год = " << h << " год 0" << m << " хв" ;
    }
   
    return 0;

}