/*
Задача: Аналізатор пароля
Автор: Вероніка Третяк
Група: ШІ-13
*/
#include <iostream>
using namespace std;

int main() {
    //Введення змінних
    int length;
    int level;
    char num, lett, symb;

    //Визначаємо довжину пароля та перевіряємо її
    cout << "Введіть довжину пароля: " ;
    cin >> length;

    if ( length < 1 || length > 64) {
        cout << "Помилка: Довжина пароля має бути від 1 до 64 символів." << endl; 
        return 1;
    }
    //Визначаємо наявність цифр, великих літер та спеціальних символів у паролі
    cout << "Чи пароль містить цифри? (y/n): ";
    cin >> num;
    if (num != 'y' && num != 'n') {
        cout << "Помилка: Введіть 'y' або 'n'." << endl;
        return 1;
    }
    cout << "Чи пароль містить великі літери? (y/n): ";
    cin >> lett;
    if (lett != 'y' && lett != 'n') {
        cout << "Помилка: Введіть 'y' або 'n'." << endl;
        return 1;
    }   
    cout << "Чи пароль містить спеціальні символи? (y/n): ";
    cin >> symb;
    if (symb != 'y' && symb != 'n') {
        cout << "Помилка: Введіть 'y' або 'n'." << endl;
        return 1;
    }

    int type = 0;
    //Перевіряємо кількість типів символів у паролі
    if (num == 'y')
    type++;
    if (lett == 'y')
    type++;
    if (symb == 'y')
    type++; if (length >= 8 && type >= 2) {
        cout << "Мінімальні вимоги: ПРОЙДЕНО" << endl;
    } else {
        cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << endl;
    }
    //Визначаємо рівень складності пароля
    if (length < 6)
    level = 1;
    else if (length < 8 || type == 0)
    level = 2;
    else if (type == 1 )
    level = 3;
    else if (length >= 12 && type == 3)
    level = 5;
    else
    level = 4;

    //Виводимо рівень складності пароля та рекомендації
    cout << "Рівень складності пароля: " << level << " - ";

    
    switch(level) {
        case 1:
            cout << "Дуже слабкий\n";
            cout << "Рекомендація: Пароль надто короткий. Мінімум 8 символів.";
            break;
        case 2:
            cout << "Слабкий\n";
            cout << "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи.";
            break;
        case 3:
            cout << "Середній\n";
            cout << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12.";
            break;
        case 4:
            cout << "Надійний\n";
            cout << "Рекомендація: Хороший пароль. Для максимуму 12+ символів і всі три типи символів.";
            break;
        case 5:
            cout << "Дуже надійний\n";
            cout << "Рекомендація: Відмінно. Змінювати нічого не потрібно.";
            break;
            default:
            cout << "Невідомий рівень надійності.";
            break;
    }
    if ( !(num == 'y' || symb == 'y')){
        cout << "Попередження: пароль тільки з літер підбирається швидше." << endl;
    }
    return 0;
    }