/* Автономність портативної зарядної станції
   Ярошик Наталія
   ШІ-14 */
#include <iostream> //бібліотека для введення та виведення даних
#include <cmath> //бібліотека для математичних функцій (наприклад піднесення до степеня)
#include <string> //для текстових рядків
#include <iomanip> //для форматування виводу даних

using namespace std;

int main(){
    //присвоюємо значення змінним
    string model;
    double C, eff, P;
    int years, charge;

    //виводимо і зчитуємо текст
    cout << "Модель станції: ";
    //перевіряємо чи виконуються задані умови
    if(!(cin >> model) || model.length()>31){
        cout << "Помилка. Введено некоректні дані.";
        return 1;
    }

    cout << "Паспортна ємність (Вт·год): ";
        if(!(cin >> C) || C<=0){
        cout << "Помилка. Введено некоректні дані.";
        return 1;
    }

    cout << "Вік станції (років): ";
        if(!(cin >> years) || years < 0 || years > 20){
        cout << "Помилка. Введено некоректні дані.";
        return 1;
    }

    cout << "Рівень заряду (%): ";
        if(!(cin >> charge) || charge < 0 || charge > 100){
        cout << "Помилка. Введено некоректні дані.";
        return 1;
    }

    cout << "ККД інвертора (%): ";
        if(!(cin >> eff) || eff <= 0 || eff > 100){
        cout << "Помилка. Введено некоректні дані.";
        return 1;
    }

    cout << "Потужність приладу (Вт): ";
        if(!(cin >> P) || P<=0){
        cout << "Помилка. Введено некоректні дані.";
        return 1;
    }

    double C_eff, E_stored, E_useful, E_loss, T;
    int h, m;

    //обчислюємо фактичну ємність
    C_eff = C * pow(1 - 2.0 / 100, years);

    //обчислюємо запас енергії при поточному заряді
    E_stored = C_eff * charge / 100;
    
    //обчислюємо корисну енергія, що дійде до приладу
    E_useful = E_stored * eff / 100;

    //обчислюємо втрати на перетворенні напруги
    E_loss = E_stored - E_useful;

    //обчислюємо час роботи
    T = E_useful / P;

    //обчислюємо повні години
    h = (int)T;

    //обчислюємо хвилини, що залишились
    m = (int)((T - h) * 60);

    cout << " " << endl;

    //виводимо результат
    cout << fixed;
    cout << "Модель:                  " << model << endl;

    cout << setprecision(1); //один знак після коми
    cout << "Паспортна ємність:       " << C << " Вт·год" << endl;
    cout << "Вік станції:             " << years << " р." << endl;
    cout << "Фактична ємність:        " << C_eff << " Вт·год" << endl;
    cout << "Рівень заряду:           " << charge << " %" << endl;
    
    cout << setprecision(2); //два знаки після коми
    cout << "ККД інвертора:           " << eff << " %" << endl;

    cout << setprecision(1);
    cout << "Запас енергії:           " << E_stored << " Вт·год" << endl;
    cout << "Корисна енергія:         " << E_useful << " Вт·год" << endl;
    cout << "Втрати на перетворенні:  " << E_loss << " Вт·год" << endl;

    cout << setprecision(2);
    cout << "Час роботи:              " << T << " год = " << h << " год " << setfill('0') << setw(2) << m << " хв";

    return 0;
}