/*
Назва задачі: Lab 1 Task 2
Автор: Діхтяр Юлія
Група: ai-13
*/

/*
Обчислити вирази:
1) m + --n
2) m++ < ++n
3) n-- < --m

Для кожного виразу вивести результат
і значення m та n після обчислення.
*/

#include <iostream>
int main()
{
    int initialM, initialN;

    std::cout << "Введіть початкове значення m: ";
    std::cin >> initialM;

    std::cout << "Введіть початкове значення n: ";
    std::cin >> initialN;

    int m, n;

    // --n спочатку зменшує n на 1, потім до нового значення n додається m.
    m = initialM;
    n = initialN;
    int result1 = m + --n;

    std::cout << "1) m + --n: " << "результат = " << result1 << ", m = " << m << ", n = " << n << std::endl;


    // m++ бере початкове значення m для порівняння, а після цього збільшує m на 1.
    // ++n спочатку збільшує n на 1, тому в порівнянні бере участь нове значення n.
    m = initialM;
    n = initialN;
    bool result2 = m++ < ++n;

    std::cout << "2) m++ < ++n: " << "результат = " << result2 << ", m = " << m << ", n = " << n << std::endl;


    // n-- бере початкове значення n для порівняння, а після цього зменшує n на 1.
    // --m спочатку зменшує m на 1, тому в порівнянні бере участь нове значення m.
    m = initialM;
    n = initialN;
    bool result3 = n-- < --m;

    std::cout << "3) n-- < --m: " << "результат = " << result3 << ", m = " << m << ", n = " << n << std::endl;

    return 0;
}
