#include <iostream>
using namespace std;

int main() {
    int n; cout << "Введіть довжину пароля (1-64): ";
    cin >> n;
    if (n <= 0 || n > 64) {
        cout << "Помилка: довжина пароля повинна бути додатнім числом, не більшим за 64" << endl;
        return 0;
    }
    int t = 0, security = 4;
    char num; cout << "Чи є цифри у паролі? (y/n): ";
    cin >> num; 
    if ( num == 'y' )  t++;
    else if ( num != 'n' && num != 'y' ) {
        cout << "Помилка: введіть 'y' або 'n' для наявності цифр у паролі" << endl;
        return 0;
    }
    char big; cout << "Чи є великі літери у паролі? (y/n): ";
    cin >> big;
    if (big == 'y') t++;
    else if ( big != 'n' && big != 'y' ) {
        cout << "Помилка: введіть 'y' або 'n' для наявності великих літер у паролі" << endl;
        return 0;
    }
    char spec; cout << "Чи є спеціальні символи у паролі? (y/n): ";
    cin >> spec;
    if (spec == 'y') t++;
    else if ( spec != 'n' && spec != 'y' ) {
        cout << "Помилка: введіть 'y' або 'n' для наявності спеціальних символів у паролі" << endl;
        return 0;
    }
    cout << "Мінімальні вимоги: "; 
    if ( n >= 8 && t >= 2 ) cout << "ПРОЙДЕНО" << "\n";
    else cout << "НЕ ПРОЙДЕНО" << "\n";

    cout << "Рівень надійності: " ;
    if ( n < 6 ) security = 1;
    else if ( (n >= 6 && n < 8 ) || t == 0 ) security = 2;
    else if ( n >= 8 && t == 1 ) security = 3;
    else if ( n >= 12 && t == 3 ) security = 5;
    
    
    
    switch (security) {
        case 1:
            cout << "1 - Дуже слабкий" << "\n" << "Рекомендація: Пароль надто короткий. Мінімум 8 символів" << "\n";
            break;
        case 2:
            cout << "2 - Слабкий" << "\n" << "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << "\n";
            break;
        case 3:
            cout << "3 - Середній" << "\n" << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12" << "\n";
            break;
        case 5:
            cout << "5 - Дуже надійний" << "\n" << "Рекомендація: Відмінно. Змінювати нічого не потрібно." << "\n";
            break;
        default:
            cout << "4 - Надійний" << "\n" << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12" << "\n";
            break;
    }
    if ( spec == 'n' && num == 'n') cout << "Попередження: пароль тільки з літер пiдбирається швидше." << "\n";
}