/*Lab 2, Task 1, Variant 15
Максімко Павло - СШІ-13*/

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    //Константою оголошуємо точність, щоб значення було весь час одним і не мінялося
    const double EPSILON = 0.0001;

    double sum = 0;

    cout << "Загальна формула елемента: a[n] = (n!) ^ 2 / (2 ^ (n ^ 2))" << endl;
    cout << "За рекурентними перетвореннями: a[n + 1] = ((n + 1)!) ^ 2 / (2 ^ ((n + 1) ^ 2))" << endl;
    cout << "a[n + 1] / a[n] = (((n + 1)!) ^ 2 / (2 ^ ((n + 1) ^ 2))) / ((n!) ^ 2 / (2 ^ (n ^ 2)))" << endl;
    cout << "a[n + 1] / a[n] = (n + 1) ^ 2 * 2 ^ (n ^ 2) / 2 ^ (n ^ 2 + 2 * n + 1)" << endl;
    cout << "a[n + 1] / a[n] = (n + 1) ^ 2 / 2 ^ (2 * n + 1)" << endl;
    cout << "a[n + 1] = a[n] * (n + 1) ^ 2 / 2 ^ (2 * n + 1)" << endl;

    //Обчислюємо перший елемент і додаємо до суми, адже пізніше в коді застосовуємо рекурентну форму
    double a = pow(1, 2) / pow(2, pow(1, 2)); 
    sum += a;

    int i = 1;
    while(true)
    {
        //Оскільки в загальній формулі є факторіал, то обчислення можуть бути занадто складні
        //Тому рекурентно обраховуємо кожен наступний елемент, щоб не використовувати загальну формулу
        a = a * pow(i + 1, 2)/ pow(2, (2 * i + 1));

        //Значення елементів спадає, завдяки чому, умова точності виконається і цикл закінчиться
        if(a < EPSILON) break;

        //Оскільки перевірка точності стоїть вище, то коли елемент буде менший від епсилону, то до суми він не додасться
        sum += a;
        i++;
    }

    cout << "Сума елементів до точності " << EPSILON << ": " << sum << endl;
    return 0;
}