/*
Лабораторна робота №2
Варіант: 14
Автор: Петро Стецюк
Група: ШІ-12
*/
#include <iostream>
#include <cmath>

using namespace std;
int main() {
    double const eps = 0.0001; // Задана точність
    double sum = 0, a_n= 1.0/3.0;    // Сума ряду, перший член ряду (при n=1)
    int n = 1; // лічильник 
    // Цикл додає елементи, поки поточний доданок не стане меншим за eps
    while (a_n>=eps)
    {
        sum+=a_n;// Додаємо поточний доданок до суми
        a_n=a_n*pow((double)n/(n+1), n);// Обчислюємо наступний доданок за рекурентною формулою
        n++;
    }

    // Блок виведення 
    cout<<"Сума ряду: "<<sum<<endl;
    cout<<"Кількість доданків: "<<n-1<<endl;

    return 0;
}