/*Човган Софія Ші 14
У вашого персонажа є H хітпойнтів та M мани.
Персонаж 3 рази використає закляття, кожне з яких може використати хітпойнти та ману одночасно.
Якщо якесь закляття забирає і хітпойнти і ману - ваш персонаж програє, отже для виграшу треба використовувати при одному заклинанні АБО хітпойнти, АБО ману.
Якщо в кінці персонаж буде мати додатню кількість хітпойнтів та мани (𝐻,𝑀 >0) - він виграє, в іншому випадку програє.
Ваше завдання у випадку виграшу персонажа вивести YES, вивести NO у іншому випадку.
*/
#include <iostream>
using namespace std;

int main() {
    long long H, M;
    cin >> H >> M;

    long long hi, mi;

    for (int t = 0; t < 3; t++) {
        cin >> hi >> mi;

        if (hi > 0 && mi > 0) {
            cout << "NO";
            return 1;
        }

        H = H - hi;
        M = M - mi;
    }

    if (H <= 0 || M <= 0) {
        cout << "NO";
    }
    else {
        cout << "YES";
    }

    return 0;
}