/*Аналізатор надійності пароля
  Човган Софія ШІ 14*/

#include <iostream>
using namespace std;
int main(){
    int pl;
    char numb, let, sps;
cout << "Введіть довжину пароля: ";
cin >> pl; 
if(pl < 1 || pl > 64){
    cout << "Довжина пароля має бути від 1 до 64";
    return 1;
}
//Перевірка сиволів 
cout << "Чи є цифри (y/n) ";
cin >> numb; 
if( numb != 'y' && numb != 'n'){
    cout << "Доступні опції лише y або n, спробуйте ще раз";
    return 1;
}
cout << "Чи є великі літери (y/n) ";
cin >> let; 
if(let != 'y' && let != 'n'){
    cout << "Доступні опції лише y або n, спробуйте ще раз";
    return 1;
}
cout << "Чи є спеціальні символи (y/n) ";
cin >> sps; 
if( sps != 'y' && sps != 'n'){
    cout << "Доступні опції лише y або n, спробуйте ще раз";
    return 1;
}
// Перевірка на кількість типів символів та довжину - Мінімальні умови
int types = 0;
if (numb =='y'){
    types++;
}if (let =='y'){
    types++;
}
if (sps =='y'){
    types++;
}
if (types >= 2 && pl >= 8){
    cout << "Мінімальні вимоги: ПРОЙДЕНО" << endl;

}
else { cout <<"Мінімальні вимоги: НЕ ПРОЙДЕНО" << endl;
 }
//Визначення рівня надійності
int level;

if (pl < 6) {
    level = 1;
}
else if (pl < 8 || types == 0) {
    level = 2;
}
else if (types == 1) {
    level = 3;
}
else if (pl >= 12 && types == 3) {  
    level = 5;
}
else {
    level = 4;
}
//Виведення відповідних даних на основі інформації. рівень, рекомендація.
switch(level){
    case 1:
    cout << "Рівень надійності: 1 - Дуже слабкий " << endl  << " Рекомендація: Пароль надто короткий. Мінімум 8 символів.";
    break;
    case 2:
    cout << "Рівень надійності: 2 - Cлабкий " << endl  << 
    "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." 
    << endl;
    break;
    case 3:
    cout << "Рівень надійності: 3 - Середній " << endl  << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12.";
    break;
    case 4:
    cout << "Рівень надійності: 4 - Надійний " << endl  << "Рекомендація: Хороший пароль. Для максимуму 12+ символів і всі три типи символів.";
    break;
    case 5:
    cout <<"Рівень надійності: 5 - Дуже надійний " << endl  <<  "Рекомендація: Відмінно. Змінювати нічого не потрібно.";
    break;

    default:
    cout << "Помилка визначення рівня.";
    break;
}
//Виведення попередження
if(!(numb == 'y' && sps == 'y')){
    cout << endl << "Попередження: пароль тільки з літер підбирається швидше.";
}

    return 0;
}

