/*Човган Софія ШІ 14
На величезному пасовищі пасеться жеребець та кобила, 
це пасовище можна розглядати як стандартну площину. Жеребець стоїть у точці (𝑥1,𝑦1), а кобила — в точці (𝑥2,𝑦2). 
Жодна з координат коней не дорівнює нулю.
Стадар (пастух, що пасе коней) встановив два безмежних паркана по осях координат.
Скажіть, чи можуть зустрітися жеребець і кобила, не перетинаючи паркан.*/

#include <iostream>
using namespace std;

int main() {
    int x1, y1, x2, y2;

    cin >> x1 >> y1;
    cin >> x2 >> y2;

    if (((x1 > 0 && x2 > 0) || (x1 < 0 && x2 < 0)) &&
        ((y1 > 0 && y2 > 0) || (y1 < 0 && y2 < 0))) {
        cout << "Yes";
    }
    else {
        cout << "No";
    }

    return 0;
}