/*Човган Софія ШІ 14
Всім відомо, що щасливим числом є таке додатне ціле, десятковий запис якого містить тільки четвірки та сімки.
Наприклад, щасливими є числа 4, 7, 47, 7777 та 4744474.
Нещасливими натомість вважають всі інші числа.
Вам дано число 𝑛 — представте його у вигляді суми двох нещасливих чисел.*/
#include <iostream>
using namespace std;

int main(){
    int n;
     cin >> n;
     if( n == 2 ){
        cout << " 1 1";

        return 0;
     }
     int x, y;
    x = 2;
    y = n - 2;
    if (y %10 == 4 || y % 10 == 7) {
    x++;
    y--;
}
     cout << x << " " << y;

    return 0;
}