/*Епік 2. Лабораторна робота №1. Варіант №12. Завдання №2
Автор: Михайло Матішак
Група: ШІ-11*/
#include <iostream>

using namespace std;

int main(){
    int n, m, a, b, c;
    cout << "Введіть значення n: "; // Зчитування значення n від користувача
    cin >> n;
    cout << "Введіть значення m: "; // Зчитування значення m від користувача
    cin >> m;
    a = - -m-++n;
    // Виведення результатів
    cout << "Отримане значення a: " << a << endl;
    b = m * n < n++;
    cout << "Отримане значення b: " << b << endl;
    c = n-- > m++;
    cout << "Отримане значення c: " << c << endl;
    return 0;
}