/*
    Автономність портативної зарядної станції
    Автор: Рудика Вадим
    Група: ШІ-12
*/

#include <iostream>
#include <cmath>
#include <iomanip>

using namespace std;
int main() {
    //оголошення змінних для вводу
    string model;
    double C, eff, P;
    int years, charge;
    cout << "Модель станції: ";
    cin >> model;
/*Ввід усіх величин. Тут у циклі while йде перевірка на помилки при вводі,
та за наявності помилки користувачеві пропонується повторно ввести дані.
Наприклад тут перевірка на довжину моделі (не більше 31 символу),
fail() перевіряє, чи не було помилки під час введення (наприклад, якщо користувач ввів літери замість числа)
clear() знімає "прапорець" помилки, а ignore() очищує буфер вводу
*/
    while (cin.fail() || model.length() > 31) {
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Помилка, назва моделі має становити менше 32 символів: ";
        cin >> model;
    }

    cout << "Паспортна ємність (Вт x год, > 0): ";
    cin >> C;

    while (cin.fail() || C <= 0) {
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Помилка! Введіть значення більше 0: ";
        cin >> C;
    }

    cout << "Вік станції (років, 0-20): ";
    cin >> years;

    while (cin.fail() || years < 0 || years > 20) {
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Помилка! Введіть вік від 0 до 20: ";
        cin >> years;
    }

    cout << "Рівень заряду (%, 0-100): ";
    cin >> charge;

    while (cin.fail() || charge < 0 || charge > 100) {
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Помилка! Введіть заряд від 0 до 100: ";
        cin >> charge;
    }

    cout << "ККД інвертора (%, > 0, <= 100): ";
    cin >> eff;

    while (cin.fail() || eff <= 0 || eff > 100) {
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Помилка! Введіть ККД більше 0 і не більше 100: ";
        cin >> eff;
    }

    cout << "Потужність приладу (Вт, > 0): ";
    cin >> P;

    while (cin.fail() || P <= 0) {
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Помилка! Введіть потужність більше 0: ";
        cin >> P;
    }
//оголошення змінних для обчислень
    float C_eff, E_stored, E_useful, E_loss, T;
    int h, m;
    // Обчислюємо фактичну ємність з урахуванням втрати 2 % за рік, Вт x год 
    C_eff = C * pow(1 - 2.0 / 100, years);
     // Обчислюємо запас енергії при поточному рівні заряду, Вт x год
    E_stored = C_eff * charge / 100;
    // Обчислюємо корисну енергію після втрат в інверторі, Вт x год
    E_useful = E_stored * eff / 100;
    // Обчислюємо втрати енергії під час перетворення, Вт x год
    E_loss = E_stored - E_useful;
    // Обчислюємо час роботи приладу, години
    T = E_useful / P;
    // Визначаємо повну кількість годин
    h = int(T);
    // Визначаємо кількість хвилин після повних годин
    m = int(((T - h) * 60));
//вивід результатів, fixed і setprecision використовуються для форматування чисел з плаваючою комою (1 - це скільки знаків після коми буде виведено)
    cout << "\n";
    cout << "Модель:                 " << model << "\n";

    cout << fixed << setprecision(1);
    cout << "Паспортна ємність:      " << C << " Вт x год\n";

    cout << "Вік станції:            " << years << " р.\n";

    cout << fixed << setprecision(1);
    cout << "Фактична ємність:       " << C_eff << " Вт x год\n";

    cout << "Рівень заряду:          " << charge << " %\n";

    cout << fixed << setprecision(2);
    cout << "ККД інвертора:          " << eff << " %\n";

    cout << fixed << setprecision(1);
    cout << "Запас енергії:          " << E_stored << " Вт x год\n";
    cout << "Корисна енергія:        " << E_useful << " Вт x год\n";
    cout << "Втрати на перетворенні: " << E_loss << " Вт x год\n";
//setw і setfill використовуються для форматування виводу часу (щоб хвилини завжди були двозначними)
    cout << fixed << setprecision(2);
    cout << "Час роботи:             " << T << " год = " << h << " год " << setw(2) << setfill('0') << m << " хв\n";

    return 0;
}
