#include <iostream>

using namespace std;

int main() {
    int n, m;
    cin >> n;
    cin >> m;

    cout << "(n++ - m) = ";
    cout << (n++ - m) << endl;
	// Виведеться просто результат n - m, а вже потім n збільшиться на 1, 
    // бо оператор ++ стоїть після змінної n

    cout << "(m-- > n) = ";
	cout << (m-- > n) << endl;
	// Виведеться просто результат m > n, а вже потім m зменшиться на 1
    // бо оператор -- стоїть після змінної n

    cout << "(n-- > m) = ";
    cout << (n-- > m) << endl;
	// Виведеться просто результат n > m, а вже потім n зменшиться на 1
    // бо оператор -- стоїть після змінної n

    return 0;
}