#include <iostream>

using namespace std;

int main() {
	int n, m;
	cin >> n;
	cin >> m;

	cout << "(++n * ++m) = ";
	cout << (++n * ++m) << endl;
	// Виведеться просто результат (n+1) * (m+1), бо оператор ++ є префіксальний

	cout << "(m++ < n) = ";
	cout << (m++ < n) << endl;
	// Виведеться просто результат m < n, а вже потім m, збільшиться на 1
	// бо оператор ++ є постфіксальний 

	cout << "(n++ > m) = ";
	cout << (n++ > m) << endl;
	// Виведеться просто результат n > m, а вже потім n збільшиться на 1
	// бо оператор ++ є постфіксальний 

	return 0;
}