/*
Офісна Вулиця. Частина 1
*/

#include <iostream>

int main()
{
	// Ініціалізуємо всі змінні для вводу
	int n, i;
	const int max_size = 100000;
	int arr[max_size];

	// Отримуємо розмір масиву та числа
	std::cin >> n;
	for (i = 0; i < n; i++) { std::cin >> arr[i]; }

	// Ініціалізуємо всі змінні для сортування
	int arr_i[max_size];
	int element_value, d0, d1, d_mid, j;

	// Одразу задаємо перший елемент сортування
	// Аби if i != 0 не стояв в циклі та 
	// "викрадав" обчисленні потужності кожного циклу
	arr_i[0] = 0;

	for (i = 1; i < n; i++) {

		// Задаємо значення поточного елементу, як окрему змінну
		// За для легшої читабельності
		element_value = arr[i];

		// Задаємо діапазон значень, які вже є відсортовані
		d0 = 0;
		d1 = i-1;

		// Повторюємо зменшення кожного діапазону вдвічі
		// Допоки діапазон не стане 1 елементом
		while (d1 - d0 > 0) {
			// Задаємо середню позицію діапазону
			d_mid = d0 + (d1 - d0) / 2;

			// Порівнюємо чи поточний елемент більший за елемент посередині
			if (element_value > arr[arr_i[d_mid]]) {

				// Задаємо початок нового діапазону як середню позицію минулого
				// Але оскільки поточний елемент за нього більший то зміщуємо ще +1
				// Кінець нового діапазону залишається як минулий
				d0 = d_mid + 1;

			} else {

				// Початок нового діапазону залишається як минулий
				// Задаємо кінець нового діапазону як середню позицію минулого
				// Але оскільки поточний елемент за нього не є більшим то зміщуємо на -1
				d1 = d_mid - 1;
			}
		}

		// Порівнюємо поточний елемент і елемент поруч з яким він буде
		if (element_value > arr[arr_i[d0]]) {
			// Якщо поточний більший, то він буде йти після нього
			// Інакше ж поточний буде перед ним
			d0++;
		}

		// Зміщуємо всі елементи що будуть йти після поточного на +1
		// Для додавання вільного місця для поточного
		for (j = i; j > d0; j--) {
			arr_i[j] = arr_i[j - 1];
		}

		// Вставляємо поточний елемент у відповідне відсортоване місце
		arr_i[d0] = i;
	}

	// Виводимо відсортований порядок номерів
	for (i = 0; i != n; i++) {
		std::cout << arr_i[i] + 1 << " ";
	}
}
