/*Epic1_Haiduchok_ShI11*/
#include <iostream>
#include <cmath>
#include <string>
#include <iomanip>

using namespace std;

int main () 
{
    //Задаю початкові значення змінним
    string model;

    int C = 0;

    int years = 0;

    int charge = 0;

    int eff = 0;

    int P = 0;

//Виводжу текст та міняю значення змінної через вхідні дані

    cout << "Модель станції:";

    cin >> model;

    if (model.length() > 31) //Створюю обмеження у 31 символ, у разі більшої кількості видасть помилку
    {
        cout << "Помилка. Довжина назви моделі не може перевищувати 31 символ";
        return 0;
    }
    
    cout << "Паспортна ємність:";

    cin >> C;

    if ((C < 0)) //Створюю обмеження, Ємність повинна бути більша за 0
    {
        cout << "Помилка. Ємність менша за 0";
        return 0;
    }

    cout << "Вік станції:";

    cin >> years;

    if ((years < 0 ||  years > 20)) //Створюю обмеження, вік повинен бути від 0 до 20
    { 
        cout << "Помилка: вік станції мусить бути від 0 до 20";
        return 0;
    }

    cout << "Рівень заряду:"; 
    cin >> charge;

    if((charge < 0 || charge > 100)) //Створюю обмеження, Рівень заряду повинен бути від 0 до 100
    {
        cout << "Помилка. Заряд мусить бути від 0 до 100";
        return 0;
    }

    cout << "ККД інвертора:"; 
    cin >> eff;

    if((eff < 0 || eff > 100)) //Створюю обмеження, ККД повинен бути більше 0, не більше 100
    {
        cout << "Помилка. ККД мусить бути від 0 до 100";
        return 0;
    }

    cout << "Потужність:";
    cin >> P;

    if((P < 0)) //Створюю обмеження, Потужність повинна бути більше 0
    {
        cout << "Помилка. Потужність менша за 0";
        return 0;
    }

//Шукаю Фактичну ємність, від 1 коефіцієнт деградації у відсотках на рік(одразу переводжу у десяткові) та підношу до степення, що дорівнює віку
    double C_eff = C * pow((1 - 0.02), years); 
    // Задаю умову, якщо вік = 0, тоді Фактична ємність = Паспортній ємності
    if (years == 0)
    {
        C_eff = C;
    }
    // Шукаю запас енергії, Фактичну ємність множу на заряд у вигляді десяткового дробу
    double E_stored = C_eff * charge / 100;
    // Шукаю Корисну енергію, Запас енергії множу на ККД у вигляді десяткового дробу( Вт*год * 0,..)
    double E_useful = E_stored * eff / 100;
    //Шукаю Втрати на перетворенні напруги, від Запасу енергії віднімаю Корисну енергію( Вт*год - Вт*год)
    double E_loss = E_stored - E_useful;
    //Шукаю Час роботи у годинах, Корисну енергію ділю на Потужність( Вт*год/Вт)
    double T = E_useful / P;
    //Шукаю Повні години, для змінної h задаю значення цілої частини змінної Т
    int h = (int) T;
    //Шукаю Хвилини, що залишились, від Часу роботи відмінаю Повні години та множу це на 60((години-години)*кількість хв у годині), це все приводимо до цілої частини
    int m = (int) ((T - h) * 60);
    //Виводжу усі обрахунки у термінах, задаю кількість знаків після коми
    cout << "Модель:\t\t\t\t\t"  << model <<endl;
    cout << "Паспортна ємність:\t\t\t" << fixed << setprecision(1) << C << " Вт·год" <<endl;
    cout << "Вік станції:\t\t\t\t" << years << " р." <<endl;
    cout << "Фактична ємність з урахуванням віку:\t" << fixed << setprecision(1) << C_eff << " Вт·год" <<endl;
    cout << "Рівень заряду:\t\t\t\t" << charge << " %" <<endl;
    cout << "ККД інвертора:\t\t\t\t" << fixed << setprecision(2) << eff << " %" <<endl;
    cout << "Запас енергії:\t\t\t\t" << fixed << setprecision(1) << E_stored << " Вт·год" <<endl;
    cout << "Корисна енергія:\t\t\t"<<fixed<<setprecision(1)<< E_useful << " Вт·год"<<endl;
    cout << "Втрати на перетворенні:\t\t\t"<<fixed<<setprecision(1)<< E_loss << " Вт·год"<<endl;
    cout << "Час роботи:\t\t\t\t"<<setprecision(2)<< T << " год  = "<<setprecision(0)<<h<<" год "<< setfill('0') << setw(2)<<m<<" хв" <<endl; //Виділяю 2 комірки на два знаки, якщо змінна m видасть одне число, перед ним буде стояти 0

return 0;
}