/*
Автономність портативної зарядної станції
Лупій Роман
Група ШІ-13
*/

// підключення бібліотек
#include <iostream>
#include <string>
#include <cctype>
#include <cmath>
#include <iomanip>
using namespace std;// підключення простору імен

int main() {
    

    string model;// створеня змінних 
    int C;
    int years;
    int charge;
    double eff;
    int P;
    cout << "ВВедіть модель станції(Тільки літери): "; // введеня даних користовачем
    cin >> model;
    cout << "Введіть паспортну ємність станції (Вт·год): ";
    cin >> C;
    cout << "Введіть вік станції (років): ";
    cin >> years;
    cout << "Введіть рівень заряду (%): ";
    cin >> charge;
    cout << "Введіть ККД станції (%): ";
    cin >> eff;
    cout << "Введіть потужність станції(Вт): ";
    cin >> P;

    if (model.length() >= 31) {
        cout << "Помилка: назва має бути менше 31 символу!" << endl;
        return 0;
    } // 1. Перевірка на довжину назви

 
if (model.find_first_of("0123456789") != string::npos) {
    cout << "Помилка: назва не має містити цифр!" << endl;
    return 0;
}   // 2. Перевірка на відсутність цифр
    
    if  (C < 0) {
        cout << "Помилка: паспортна ємність станції має бути додатним числом!" << endl;
        return 0;
    } // 3. Перевірка паспортної ємності станції

    if (years < 0 || years > 20) {
        cout << "Помилка: вік станції має бути в межах від 0 до 20!" << endl;
        return 0;
    } // 4. Перевірка віку станціЇ

    if (charge < 0 || charge > 100) {
        cout << "Помилка: рівень заряду має бути в межах від 0 до 100!" << endl;
        return 0;
    } // 5. Перевірка рівня заряду

    if (eff < 0 || eff > 100) {
        cout << "Помилка: ККД станції має бути в межах від 0 до 100!" << endl;
        return 0;
    } // 6. Перевірка ККД станції

    if (P < 0) {
        cout << "Помилка: потужність станції має бути додатним числом!" << endl;
        return 0;
    } // 7. Перевірка потужності станції

    int C_eff = C * pow((100 - 2) / 100.0, years); // Розрахунки 
    int E_stored = C_eff * charge / 100;
    double E_useful = E_stored * eff / 100;
    int E_loss = E_stored - E_useful;
    double T = E_useful / P;
    int h = T;
    int m = (T - h) * 60;
    if (m == 60) {
    h += 1;
    m = 0;
    } // Перевірка на випадок, якщо хвилини дорівнюють 60
    cout << fixed << setprecision(1); // Встановлення точності виводу для чисел з плаваючою комою
     cout << "Запас енергії (Вт·год): " << E_stored << endl;
     cout << "Корисна енергія (Вт·год): " << E_useful << endl;
    cout << "Втрати енергії (Вт·год): " << E_loss << endl;

    cout << fixed << setprecision(2);
    cout << "Час роботи в годинах: " << T << endl;

    cout << "Час роботи: " << h << " год " 
     << setfill('0') << setw(2) << m << " хв" << endl; 

    cout << "Модель станції: " << model << endl; // Вивід результатів користувачу
    cout << "Паспортна ємність станції (Вт·год): " << C << endl;
    cout << "Вік станції (років): " << years << endl;
    cout << "Рівень заряду (%): " << charge << endl;
    cout << "ККД станції (%): " << eff << endl;
    cout << "Потужність станції (Вт): " << P << endl;
    cout << "Ефективна ємність (Вт·год): " << C_eff << endl;


     
}


