/*Lab task 2 - Застосування пріоритетності операцій
Максімко Павло - СШІ-13*/

#include <iostream>

using namespace std;

int main()
{
    int m, n;
    int m_copy, n_copy;

    cout << "Введіть m та n: ";
    cin >> m >> n;
    
    //Прирівнюємо копії змінних, щоб уникнути втрати справжніх значень початкових змінних
    m_copy = m;
    n_copy = n;

    //Не використовуємо дужки через пріоритетність інкремента від віднімання
    int task1 = m_copy - ++n_copy;

    cout << "m - ++n = " << task1 << endl;
    cout << "Інкремент ++ по пріоритету стоїть вище, ніж віднімання -, тому виконується першим." << endl;
    cout << "Тоді: m - ++n = m - (n + 1), що дорівнює: " << task1 << endl;

    //Знову прирівнюємо, адже самі копіїі втратили початкове значення
    m_copy = m;
    n_copy = n;

    //Так само не використовуємо дужки через те, що інкремент та декремент мають більшу пріоритетність, ніж порівняння
    bool task2 = ++m_copy > --n_copy;

    cout << "++m > --n = " << task2 << endl;
    cout << "Спершу виконується інкремент ++ та декремент, які додають до значень m та n - 1 до того, як вони викликані." << endl;
    cout << "Тому це порівняння: (1 + m) > (n - 1), що дорівнює: " << task2 << endl;

    //Той самий принцип прирівнювання, для збереження значень
    m_copy = m;
    n_copy = n;

    //Той самий принцип, що й в попередньому обчисленні 2-го приклада
    bool task3 = --n_copy < ++m_copy;

    cout << "--n < ++m = " << task3 << endl;
    cout << "За тим же принципом: декремент -- та інкремент ++ виконуються швидше ніж порівняння менше <." << endl;
    cout << "Тому це порівняння: (n - 1) < (1 + m), що дорівнює: " << task3 << endl;

    return 0;
}