/*Аналізатор надійності пароля
Максімко Павло - СШІ-13*/

#include <iostream>

using namespace std;

int main()
{
    //Оголошення змінних та їх ініціалізації
    //Оголошую разом з іншими змінними спеціальну змінну symbols_type для подальших перевірок вимог
    int password_length, symbols_type = 0, level;
    
    char is_there_num, capital_letters, special_symbols;
    
    cout << "Введіть довжину пароля: ";

    cin >> password_length;

    //Валідація за перевіркою на правильність введеного типу даних
    //Робиться тільки для довжини пароля, адже вона приймає тільки числа через тип даних int
    if(cin.fail())
    {
        cout << "Довжина пароля повинна бути цілим числом!" << endl;
        return 1; //Повертається 1 при завершенні програми з помилкою
    }
    //Валідація за встановленими задачою межами
    else if(password_length < 1 || password_length > 64)
    {
        cout << "Помилка: Довжина пароля повинна бути від 1 до 64!" << endl;
        return 1; //1 при завершенні програми з помилкою
    }

    cout << "Введіть чи є цифри у вашому паролі (y/n): ";

    cin >> is_there_num;
    //Оскільки is_there_num це тип даних char і встановлені задачею значення це 'y' або 'n',
    //то для валідації достатньо перевірити чи дорівнює ця змінна цим значенням
    if(!(is_there_num == 'y' || is_there_num == 'n'))
    {
        cout << "Помилка: Потрібно відповісти y або n!" << endl;
        return 1; //1 при завершенні програми з помилкою
    }
    
    //Добавляємо 1 до змінної для подальших перевірок вимог
    if(is_there_num == 'y') symbols_type++;

    cout << "Введіть чи є великі літери у вашому паролі (y/n): ";

    cin >> capital_letters;
    //Аналогічна валідація до змінної is_there_num
    if(!(capital_letters == 'y' || capital_letters == 'n'))
    {
        cout << "Помилка: Потрібно відповісти y або n!" << endl;
        return 1; //1 при завершенні програми з помилкою
    }

    //Добавляємо 1 до змінної для подальших перевірок вимог
    if(capital_letters == 'y') symbols_type++;

    cout << "Введіть чи є спеціальні символи у вашому паролі (y/n): ";

    cin >> special_symbols;
    //Аналогічна валідація до змінної is_there_num
    if(!(special_symbols == 'y' || special_symbols == 'n'))
    {
        cout << "Помилка: Потрібно відповісти y або n!" << endl;
        return 1; //1 при завершенні програми з помилкою
    }

    //Добавляємо 1 до змінної для подальших перевірок вимог
    if(special_symbols == 'y') symbols_type++;


    //Перевірка мінімальних вимог
    cout << "Мінімальні вимоги: ";

    if(password_length >= 8 && symbols_type >= 2) cout << "ПРОЙДЕНО!" << endl;

    else cout << "НЕ ПРОЙДЕНО!" << endl;


    //Перевірка рівня надійності
    cout << "Рівень надійності пароля: ";

    //Завдяки розгалуженню постійно перевіряти попередні умови не потрібно
    //Наступні умови автоматично будуть не задовільні, якщо перша буде виконуватися - і навпаки 
    if(password_length < 6) 
    {
        cout << "1 - Дуже слабкий" << endl;
        level = 1;
    }
    else if(password_length < 8 || symbols_type == 0) 
    {
        cout << "2 - Слабкий" << endl; 
        level = 2;
    }
    else if(symbols_type == 1) 
    {
        cout << "3 - Середній" << endl;
        level = 3;
    }
    else if(password_length >= 12 && symbols_type == 3) 
    {
        cout << "5 - Дуже надійний" << endl;
        level = 5;
    }
    //Оскільки попередньо було визначено конкретні умови для кожного рівня - непотрібно писати окрему умову для рівня 4
    else 
    {
        cout << "4 - Надійний" << endl;
        level = 4;
    }

    //Надання рекомендацій до пароля
    cout << "Рекомандація до пароля: ";
    switch(level)
    {
        //level весь час порівнюється зі значеннями case
        //коли жодне не підходить береться default значення
        case 1:
            cout << "Пароль надто короткий. Мінімум 8 символів." << endl;
            break;
        case 2:
            cout << "Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl;
            break;
        case 3:
            cout << "Додайте ще один тип символів або збільште довжину до 12." << endl;
            break;
        case 5:
            cout << "Відмінно. Змінювати нічого не потрібно." << endl;
            break;
        default:
            cout << "Хороший пароль. Для максимуму - 12+ символів і всі три типи символів." << endl;
            break;
    }

    //Перевірка на попередження
    if(is_there_num == 'n' && special_symbols == 'n')
    {
        cout << "Попередження: Пароль тільки з літер підбирається швидше." << endl;
    }

    return 0; //Повертається 0 при успішному завершенні програми
}