#include <iostream>
using namespace std;
/* Задача: Lab 1v1
 * Щербак Орислав
 * Група ШІ - 11
 */
int main() {
    long long H, M; // хітпойнти та мана персонажа
    cin >> H >> M;
    bool win = true; // вважаємо, що персонаж виграє, поки не доведено інше
    for (int i = 0; i < 3; i++) {
        long long h, m; // витрати хітпойнтів та мани на закляття
        cin >> h >> m;

        if (h > 0 && m > 0) { // закляття забирає і хітпойнти, і ману тоді програш
            win = false;
        }
        H -= h; // віднімаємо хітпойнти
        M -= m; // віднімаємо ману
    }
    if (H <= 0 || M <= 0) { // в кінці має лишитись додатна кількість обох
        win = false;
    }
    if (win) {
        cout << "YES" << endl; // персонаж виграв
    } else {
        cout << "NO" << endl; // персонаж програв
    }
    return 0;
}