#include <iostream>
using namespace std;
/* Задача: Лабораторна робота, завдання 1 (варіант 7)
 * Щербак Орислав
 * Група ШІ - 11
 */
int main() {
    int m = 5;
    int n = 3;
    cout << "1)m+--n = " << m + --n << endl; // виведення результату першого завдання
    m = 5;
    n = 3;
    cout << "0 - false, 1 - true" << endl; // пояснення результату
    cout << "2)m++<++n = " << (m++ < ++n) << endl; // виведення результату другого завдання
    m = 5;
    n = 3;
    cout << "3)n--<--m = " << (n-- < --m) << endl; // виведення результату третього завдання
    return 0;
}