
/*
Algotster Lab 1v3, Рубаха олексій, ШІ-13
*/

#include <iostream>

using namespace std;

int main(){

    //обявлення змінної N як константи з значенням 5 для кількості кубів
    const int N = 5;
    //обявлення масиву a розміром N для зберігання значень кубів
    long long a[N];

    //введення значень кубів з консолі
    for (int i = 0; i<N; i++){
        cin >> a[i];
    }

    //ініціалізація змінної max першим елементом масиву a
    long long max = a[0];

    /*
    перевірка кожного елемента масиву a на умови, якщо елемент менший або рівний 0, виводимо "ERROR",
    якщо елемент менший або рівний max, оновлюємо max, інакше виводимо "LOSS"
    */
    for (int i = 0; i<N; i++){
        if (a[i] <= 0){
            cout << "ERROR";
            return 0;
        }
        if (a[i] <= max){
            max = a[i];
        }else{
            cout << "LOSS";
            return 0;
        }
    }

    //якщо всі елементи масиву a пройшли перевірку, виводимо "WIN"
    cout << "WIN";

    return 0;
}