
/*
Зуби, Рубаха Олексій, ШІ-13
*/

#include <iostream>

using namespace std;

int main(){
    //Введення кількості зубів та поріг загостреності
    int n, k;
    cin>>n>>k;

    //Поточна кількість зубів, що відповідають порогу загостреності
    int current = 0;
    //Максимальна кількість зубів, що відповідають порогу загостреності
    int answer = 0;

    //Введення загостреності зубів
    for (int i = 0; i < n; i++){
        int x;
        cin >> x;

        //Якщо загостреність зуба більша або дорівнює порогу, збільшуємо поточну кількість зубів,
        //що відповідають порогу
        if (x >= k){
            current++;
            //Якщо поточна кількість зубів, що відповідають порогу, більша за максимальну кількість зубів,
            //що відповідають порогу, оновлюємо максимальну кількість зубів, що відповідають порогу
            if (current > answer)
                answer = current;
        }else{
            current = 0;
        }
    }

    //Виведення максимальної кількості зубів, що відповідають порогу загостреності
    cout << answer;

    return 0;
}