/* 
Lab 1 task 2, Мадяр Андрій, ШІ-13, варіант 16
Код: */
#include <iostream>
using namespace std;
int main() {
    // оголошую змінні
    int n = 0, m = 0;
    //ввід змінних
    cout << "Введіть змінну n:" << endl;
    cin >> n;
    cout << "Введіть змінну m:" << endl;
    cin >> m;
    //показ початкових значень для порівняння
    cout << "Початкаві значення: n=" << n << ", m=" << m << endl;
               //виконання дій
    /* 1) ++n*++m
    характеристика:і до змінної n і до змінної m префіксно(перед використанням змінної) додаю 1, потім множу змінні одну на одну
   */
    int res1 = ++n*++m;
    //виведення результату та нових значень змінних
    cout << "1) ++n*++m" << endl;
    cout << "результат: " << res1 << ", нові значення: " << "n=" << n << ", m=" << m << endl;
    /* 2) m++<n
    характеристика: до змінної m постфіксно(після використання змінної) додаю 1 і перевіряю чи m менше n
    */
   int res2 = m++<n;
    //виведення результату та нових значень змінних
    cout << "2) m++<n" << endl;
    cout << "результат: " << res2 << ", нові значення: " << "n=" << n << ", m=" << m << endl;
    /*3) n++>m
    характеристика: до змінної n постфіксно(після використання змінної) додаю 1 і перевіряю чи n більше m
    */
   int res3 = n++>m;
    //виведення результату та нових значень змінних
    cout << "3) n++>m" << endl;
    cout << "результат: " << res3 << ", нові значення: " << "n=" << n << ", m=" << m << endl;
    return 0;
}
