/*
self practise Зуби, Андрій Мадяр, ШІ-13
*/
#include <iostream>
using namespace std;
int main(){ 
    //ввід змінних кількості та коефіцієнту загостреності
    int n, k;
    cin>> n >> k;
    //створення змінних кількості загострених зубів та відповіді Бісеняти
    int count = 0;
    int ans = 0;
    for (int i = 0; i < n; i++){
        //ввід загостреності кожного зуба
        int a;
        cin >> a;
        //перевірка чи він загострений
        if (a >= k){
            count++;
            //збільшення значення відповіді
            if (count > ans)
                ans = count;
        }//обнулення рахунку для реалізації умови підряд загострених зубів
          else{
            count = 0;
        }
    }
   // вивід відповіді Чортеня
    cout << ans << endl;

    return 0;
}
