/*
Умова:
Задано бінарну матрицю 𝑛 ×𝑚. За один хід дозволяється поміняти місцями значення двох елементів. Потрібно визначити, чи можна поміняти їх так, щоб не існувало підматриці розміром 𝑎 ×𝑏, у якої усі елементи рівні 1. Зауважте, що вам дозволяється робити довільну кількість ходів.

Вхідні дані
У першому рядку задано ціле число 𝑡 — кількість тестів.

Далі йдуть 𝑡 тестів у такому форматі:

У першому рядку задано чотири цілих числа 𝑛, 𝑚, 𝑎 та 𝑏.

У наступних 𝑛 рядках задано матрицю, яка складається лише з 0 та 1.

Вихідні дані
Для кожного тесту виведіть YES, якщо отримати шукану матрицю можливо, або NO в іншому випадку.
*/
#include <iostream>
using namespace std;
int main()
{
    long long t;
    cin >> t;
    for (long long i = 0; i < t; i++) {
        long long n,m,a,b,counter;
        counter = 0;
        cin >> n >> m >> a >> b;
        
        for (long long k = 0; k < n; k++) {
            for (long long j = 0; j < m; j++) {
                char val;
                cin >> val;
                if(val == '0'){
                    counter++;
                }
            }
        }
        long long result = (n / a) * (m / b);
        if(counter>= result){
            cout << "YES" << endl;
        }
        else{
            cout << "NO" << endl;
        }
    }

    return 0;
}
// Зараховано