/*
Лабораторна робота №1, Завдання №2, Варіант №23.
Цебуля Вадим
ШІ-12
*/

#include <iostream>
using namespace std;

int main() {
        
        // --- Введення початкових значень ---
        int n, m; 
        cout << "Введіть n: ";
        cin >> n;
        cout << "Введіть m: ";
        cin >> m;

        // Операція (n--) - m: віднімання, потім зменшення n на 1
        cout << "Операція 1: n---m" << endl;
        cout << "Значення до обчислення n = " << n << endl;
        cout << "Значення до обчислення m = " << m << endl;
        int operation_1 = n--- m;
        cout << "Результат: " << operation_1 << endl;
        cout << "Значення після обчислення n = " << n << endl;
        cout << "Значення після обчислення m = " << m << endl;

        // Операція (m--) < n: порівняння, потім зменшення m на 1
        cout <<  "Операція 2: m--<n" << endl;
        cout << "Значення до обчислення n = " << n << endl;
        cout << "Значення до обчислення m = " << m << endl;
        bool operation_2 = m--<n;
        cout << "Результат (1 true, 0 - false): " << operation_2 << endl;
        cout << "Значення після обчислення n = " << n << endl;
        cout << "Значення після обчислення m = " << m << endl;

        // Операція (n++) > m: порівняння, потім збільшення n на 1
        cout <<  "Операція 3: n++>m" << endl;
        cout << "Значення до обчислення n = " << n << endl;
        cout << "Значення до обчислення m = " << m << endl;
        bool operation_3 = n++>m;
        cout << "Результат (1 - true, 0 - false): " << operation_3 << endl;
        cout << "Значення після обчислення n = " << n << endl;
        cout << "Значення після обчислення m = " << m << endl;

        return 0;
}