/*
Lab 1 варіант 3
Персонажу по одному дають сторони 5 кубів 𝑎1.⁢.5, з яких він будує піраміду.
Коли він отримує куб з ребром 𝑎𝑖 - він його ставить на існуючий, перший ставить на підлогу (вона безмежна).
Якщо в якийсь момент об’єм куба у руці (який будуть ставити) буде більший ніж у куба на вершині піраміди - персонаж програє і гра закінчується. Розмір усіх наступних кубів після програшу не враховується.
Тобто якщо 𝑎𝑖−1 <𝑎𝑖 - це програш.
Ваше завдання - сказати як закінчиться гра.
*/

#include <iostream>
#include<string>
using namespace std;

int main() {
    double arr[5] = {};
    string res = "WIN";
    
    cin>>arr[0];
    if (arr[0]>0){
        for (int i = 1; i < 5; i++) {
            cin >> arr[i];
            if (arr[i] <= 0) {
                res = "ERROR";
                break;
            }

            if (arr[i] > arr[i-1]){
                res = "LOSS";
                break;
            }
            
        }
    }

    else{
        res="ERROR";
    }
    cout << res << endl;
    return 0;
}