/*                  Автономність портативної зарядної станції.
                        Виконав: Айзенберг Павло, ШІ-11.                        */

#include <iostream>
#include <iomanip> 
#include <cmath> 
#include <limits>
#include <string>
using namespace std;

int main(){
        
    /* Створюємо змінну для назви моделі і записуємо ввід користувача в неї. */
    string name;
    cout << "Модель станції: ";
    cin >> name;

    // Обмежуємо довжину вводу в 31 символ.
    if (name.length() > 31) {
        cout << "Помилка! Назва не може містити більше 31 символу." << endl;
        return 1;
    }

    // "Заглядаємо" в символ після кінця слова: якщо символ не перехід на новий рядок(\n) - вискочить помилка (обмежуємо ввід 1 словом).
    if (cin.peek() != '\n') {
        cout << "Помилка! Назва моделі має складатися з одного слова." << endl;
        return 1;
    }

    /* Створюємо змінну для значення ємності. Записуємо ввід користувача.*/
    float C;
    cout << ("Паспортна ємність (Вт·год): ");
    cin >> C;

    //Перевіряємо чи значення є числом. Якщо ні, то виводимо помилку.
    if (cin.fail()) {
        cout << "Помилка! Введено не число." << endl;
        return 1;
    }
    /* Задаємо рамки допустимого вводу. Якщо введене значення <= 0, виводимо повідомлення про помилку і повертаємо 0. */
    if (C <= 0){
        cout << ("Помилка! Паспортна ємність має бути більша за нуль. ");
        return 1;
    }

    /* Все те саме, що і до цього (з іншими рамками if). */
    int years;
    cout << ("Вік станції (років): ");
    cin >> years;

    if (cin.fail()) {
        cout << "Помилка! Введено не число." << endl;
        return 1;
    }

    if (years < 0 || years > 20){
        cout << ("Помилка! Вік станції має бути в межах від 0 до 20 років. ");
        return 1;
    }

    int charge;
    cout << ("Рівень заряду (%): ");
    cin >> charge;

    if (cin.fail()) {
        cout << "Помилка! Введено не число." << endl;
        return 1;
    }

    if (charge < 0 || charge > 100){
        cout << ("Помилка! Заряд має бути в межах від 0 до 100. ");
        return 1;
    }    
        
    float eff;
    cout << ("ККД інвертора (%): ");
    cin >> eff;

    if (cin.fail()) {
        cout << "Помилка! Введено не число." << endl;
        return 1;
    }
    
    if (eff <= 0.0f || eff > 100.0f){
        cout << ("Помилка! ККД має бути в межах від 0 до 100. ");
        return 1;
    }

    float P;
    cout << ("Потужність приладу (Вт): ");
    cin >> P;

    if (cin.fail()) {
        cout << "Помилка! Введено не число." << endl;
        return 1;
    }

    if (P <= 0){
        cout << ("Помилка! Потужність має бути додатня. ");
        return 1;
    }

        // Відсоток деградації ємності за рік. 
    const float DEGRADATION_RATE = 2.0f;
        // Вираховуємо фактичну ємність з урахуванням відсотку деградації за роки експлуатації.
    float C_eff = C * pow(1.0f - DEGRADATION_RATE / 100.0f, years);
        // Вираховуємо скільки енергії зараз зберігається в станції з урахуванням заряду.
    float E_stored = C_eff * charge / 100.0f;
        // Вираховуємо скільки з цієї енергії дійде до споживача з урахуванням eff(ККД). 
    float E_useful = E_stored * eff / 100.0f;
        // Вираховуємо кількість втрат енергії. 
    float E_loss = E_stored - E_useful;
        // Тривалість автономної роботи станції при заданій потужності (P). 
    float T = E_useful / P;
        // Створюємо змінну типу int для цілої частки T.
    int h = T;  
        // Переводимо цілу частину години у хвилини.
    int m = ((T - h) * 60);

        /* Вивід: 
        Використовуємо fixed з setprecision() для встановлення кількості цифр після коми. 
        Додаємо одиниці вимірювання наприкинці кожного рядка.
        */

    cout << ("Модель:                       ") << name << endl;
    cout << ("Паспортна ємність:            ") << fixed << setprecision(1) << C << (" Вт·год") << endl;
    cout << ("Вік станції:                  ") << years << (" p.") << endl;
    cout << ("Фактична ємність:             ") << fixed << setprecision(1) << C_eff << (" Вт·год") << endl;
    cout << ("Рівень заряду:                ") << charge << (" %") << endl;
    cout << ("ККД інвертора:                ") << fixed << setprecision(2) << eff << (" %") << endl;
    cout << ("Запас енергії:                ") << fixed << setprecision(1) << E_stored << (" Вт·год") << endl;
    cout << ("Корисна енергія:              ") << fixed << setprecision(1) << E_useful << (" Вт·год") << endl;
    cout << ("Втрати на перетворенні:       ") << fixed << setprecision(1) << E_loss << (" Вт·год") << endl;
    cout << ("Час роботи:                   ") << fixed << setprecision(2) << T << (" год = ") << h << (" год ") << m << (" хв") << endl;

    return 0;
}

