/* Задача №0181:
Мале Бісеня та Дракон полюбляють проводити дозвілля разом. Сьогодні вони грають в одну дуже цікаву гру.

У них є дошка, що складається з 𝑛 рядків та 𝑚 стовпців, всі клітинки якої білі.

Гравці по черзі вибирають одну білу клітинку та зафарбовують її в чорний колір. Бісеня ходить першим. Гравець, який не може зробити хід, тобто на початку ходу якого вся дошка чорна, програє.

Погостривши зубки, Бісеня зрозуміло, що у Дракона велика перевага, адже він двоголовий, а, як то кажуть, «одна голова добре, а дві — краще». Тому воно просить вас допомогти. Вам потрібно сказати за заданими 𝑛 та 𝑚, хто виграє у цій напруженій грі.

Вхідні дані
У єдиному рядку задані два цілих числа 𝑛 та 𝑚 — розміри дошки.

Вихідні дані
Єдине слово — Imp, якщо переможе Бісеня, та Dragon, якщо переможе Дракон.*/

#include <iostream>
using namespace std;

int main(){
    int m; 
    int n;
    cin >> m;
    cin >> n;
    if (((m * n) % 2) == 1){
        cout << "Imp" << endl;
    }
    else{
        cout << "Dragon" << endl;
    }
}