/*Задача №0011:
У першому рядку задано одне натуральне число packs — кількість пачок печива.

У другому рядку задано packs натуральних чисел a — кількість штук печива в 𝑖-й пачці.

Вихідні дані
У єдиному рядку виведіть одне ціле число — максимальну кількість штук печива, яку зможе з’їсти Марічка так, щоб Зеник не помітив цього.*/

#include <iostream>
using namespace std;

int main(){
    long long answer = 0;
    int packs;
    cin >> packs;
    
    for (int i = 0; i < packs; i++){
        int a; 
        cin >> a;

        answer += (a - 1);
    }
    cout << answer << endl;
    return 0;
}