/*
Автономність портативної зарядної станції
Франчук Андрій
ШІ-14 (ai_14)
*/
#include <iostream>
#include <cmath>
using namespace std;

int main() {
    string model; //модель
    float C; // ємність
    int years; // вік акумулятора
    int charge; // поточний рівень заряду
    float eff; // ККД інвертора
    int P; // потужність

    // Введення даних і їх перевірка на правильність

    cout << "Модель станції: ";
    cin >> model;

    cout << "Паспортна ємність (Вт·год): ";
    if (cin >> C && C > 0){}else{
        cout << "Ємність має бути більша від 0";
        return 0;
    }

    cout << "Вік станції (років): ";
    if (cin >> years && years >= 0 && years <= 20){}else{
        cout << "Вік має бути від 0 до 20";
        return 0;
    };

    cout << "Рівень заряду (%): ";
    if (cin >> charge && charge > 0 && charge <= 100){}else{
        cout << "Рівень заряду має бути від 0 до 100";
        return 0;
    }

    cout << "ККД інвертора (%): ";
    if (cin >> eff && eff > 0 && eff < 100){}else{
        cout << "ККД має бути від 0 до 100";
        return 0;
    }

    cout << "Потужність приладу (Вт): ";
    if (cin >> P && P > 0){}else{
        cout << "Потужність має бути більша від 0";
        return 0;
    }
    // Обчислення формул

    float C_eff = C * pow((1 - 2 / 100), years); //Фактична ємність з урахуванням віку, Вт·год

    float E_stored = C_eff * charge / 100; // Запас енергії при поточному заряді, Вт·год

    float E_useful = E_stored * eff / 100; // Корисна енергія, що дійде до приладу, Вт·год

    float E_loss = E_stored - E_useful; // Втрати на перетворенні напруги, Вт·год

    float T = E_useful / P; // Час роботи, годин

    int h = T; // Повні години

    int m = (T - h) * 60; // Хвилини, що залишились

    //Виведення результатів

    cout << "Модель:                      " << model << "\n";
    cout << "Паспортна ємність:           " << C << " Вт*год" << "\n";
    cout << "Вік станції:                 " << years << " р." << "\n";
    cout << "Фактичка ємність:            " << C_eff << " Вт*год" << "\n";
    cout << "Рівень заряду:               " << charge << " %" << "\n";
    cout << "ККД інвертора:               " << eff << " %" << "\n";
    cout << "Запас енергії:               " << E_stored << " Вт*год" << "\n";
    cout << "Корисна енергія:             " << E_useful << " Вт*год" << "\n";
    cout << "Втрати на перетворенні:      " << E_loss << " Вт*год" << "\n";
    cout << "Час роботи:                  " << T << " год = " << h << " год " << m << " хв" ;

    return 0;
}    