/*
    Задача: Алготестер. Лабораторна робота №1. Завдання №1. Варіант №1
    Автор: Ільницька Софія
    Група: ШІ-14
*/

#include <iostream>
using namespace std;

int main() {
    long long H, M; // початкові хітпойнти та мана персонажа
    cin >> H >> M;
    bool lost = false;
    for (int i = 0; i < 3; i++) {
        long long h, m; // витрати i-го закляття: h хітпойнтів, m мани
        cin >> h >> m;

        // Якщо закляття бере ОДНОЧАСНО і hp (h > 0), і ману (m > 0) це миттєвий програш.
        if (h > 0 && m > 0) {
            lost = true;
        }
         // Ресурси витрачаються в будь-якому разі
        H -= h;
        M -= m;
    }

    // Виграш лише якщо не було "забороненого" закляття і в кінці H > 0 та M > 0
    if (!lost && H > 0 && M > 0) {
        cout << "YES" << endl;
    } else {
        cout << "NO" << endl;
    }
    return 0;
}