/*
    Задача: Лабораторна робота №1. Завдання №2. Варіант №22
    Автор: Ільницька Софія
    Група: ШІ-14
*/

#include <iostream>
using namespace std;

int main() {
    int n = 0;
    int m = 0;
    // Введення початкових значень з клавіатури
    cout << "Введіть ціле значення n: ";
    cin >> n;
    cout << "Введіть ціле значення m: ";
    cin >> m;
    cout << " " << endl;

    cout << "Крок 1: ++n * ++m" << endl;  // ++n і ++m збільшують n і m ще ДО обчислення
    cout << "Значення до обчислення: n = " << n << " m = " << m << endl;  
    int first = ++n * ++m;
    cout << "Результат: " << first << endl;
    cout << "Оновлені значення: n = " << n << " m = " << m << endl;
    cout << " " << endl;

    cout << "Крок 2: m++ < n" << endl;  // m++ означає, що у порівнянні "m < n" бере участь СТАРЕ значення m, і лише після порівняння m збільшується на 1
    cout << "Значення до обчислення: n = " << n << " m = " << m << endl;
    bool second = m++ < n;
    cout << "Результат (1 - True, 0 - False): " << second << endl;
    cout << "Оновлені значення: n = " << n << " m = " << m << endl;
    cout << " " << endl;
    
    cout << "Крок 3: n++ > m" << endl;  // n++ означає, що у порівнянні "n > m" бере участь СТАРЕ значення n, і лише після порівняння n збільшується на 1
    cout << "Значення до обчислення: n = " << n << " m = " << m << endl;
    bool third = n++ > m;
    cout << "Результат (1 - True, 0 - False): " << third << endl;
    cout << "Оновлені значення: n = " << n << " m = " << m << endl;
    return 0;
}