/*
   Задача: Зайчик та галявини (алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Зайчик знає, що у лісі є рівно 𝑛 квадратних галявин різного розміру. 
   Так історично склалося, що він знає тільки площі цих галявин — 𝑎𝑖.
   От йому стало цікаво, яка галявина має найбільшу сторону.
   Вхідні дані: У першому рядку задано одне ціле число 𝑛. У наступному рядку задано 𝑛 цілих чисел 𝑎𝑖.
   Вихідні дані: Єдине ціле число — номер галявини (нумерація починається з 0).
 */

#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;

    long long maxArea;
    int maxIndex = 0;

    cin >> maxArea;
    for (int i = 1; i < n; i++) {
        long long a;
        cin >> a;
        if (a > maxArea) {
            maxArea = a;
            maxIndex = i;
        }
    }

    cout << maxIndex << endl;
    return 0;
}