/*
   Задача: Максимум (алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Написати програму, яка знаходить значення найбільшого елемента масиву.
   Вхідні дані: У першому рядку задано одне натуральне число 𝑛 — розмір масиву.
   У другому рядку задано 𝑛 цілих чисел — елементи масиву.
   Вихідні дані: У єдиному рядку виведіть одне ціле число — значення найбільшого елемента масиву.
 */

#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;
    int max;
    cin >> max;
    for (int i = 1; i < n; i++) {
        int x;
        cin >> x;
        if (x > max) {
            max = x;
        }
    }

    cout << max << endl;
    return 0;
}