#include <iostream>

using namespace std;

int main(){

    //оголошення змінних для кількості пачок печива та загальної кількості печива яку може з'їсти Марічка
    int n;
    long long total = 0; // Використовуємо long long, щоб уникнути переповнення

    //Введення кількості пачок печева
    cin >> n;

    for (int i = 0; i < n; ++i) {
        long long a;
        cin >> a; //Введення кількості печива в кожній пачці
        if (a > 0) {
            total += (a - 1); // Марічка з'їдає всі печива, крім одного
        }
    }

    //Виведення загальної кількості печива, яку може з'їсти Марічка
    cout << total;

    return 0;
}