/*
Веселі каруселі
Обмеження: 2 сек., 256 МіБ

Умова: 
Марічка казала, що в суботу піде разом із Зеником на олімпіаду з програмування. Зеник прийшов, а Марічки нема, підманула, підвела!
Замість олімпіади Марічка вирішила піти в місцевий парк атракціонів.
Для того, щоб відвідати якнайбільшу кількість атракціонів, Марічка розпочне з найдешевшого атракціону, потім покатається на другому найдешевшому і так далі, доки в неї вистачить грошей.
Зауважте, що Марічка не відвідує атракціон більше одного разу.
Відомо, що Марічка має 𝑘 гривень, а в парку є 𝑛 атракціонів. 
Для кожного атракціону відома його ціна 𝑐𝑗. Вам необхідно визначити кількість атракціонів, на яких покатається Марічка.

Вхідні дані
У першому рядку задано два цілих числа 𝑘 та 𝑛 — кількість гривень та кількість атракціонів відповідно.
У другому рядку задано 𝑛 цілих чисел 𝑐𝑗 — ціна 𝑗-го атракціону.
Вихідні дані
У єдиному рядку виведіть одне ціле число — кількість атракціонів, на яких покатається Марічка.
*/
#include <iostream>
#include <algorithm>
using namespace std;
int main()
{
    int k,n;
    cin>>k>>n;
    int f[n];
    int count=0;
    for (int i=0; i<n; i++)
    {
        cin>>f[i];

    }
    sort(f,f+n);
    for (int i=0; i<n; i++)
    {
        if (k>=f[i])
        {
            k=k-f[i];
            count++;
        }
        else{
            break;
        }
    }
    cout<<count;
}