/*
Зуби
Обмеження: 2 сек., 256 МіБ

Умова:
Мале Бісеня любить гострити зуби. А Зла Тітонька любить до нього підходити і питатися: «Що, зуби гостриш?».
Бісеняті таке не дуже подобається, тому воно придумало робити таке.
У Малого Бісеняти є 𝑛 зубів. Кожен зуб має коефіцієнт загостреності 𝑎𝑖. Також існує межа загостреності 𝑘.
Якщо коефіцієнт загостреності певного зуба є більшим чи рівним межі загостреності, то такий зуб вважається загостреним.
Мале Бісеня хоче наступного разу, коли Зла Тітонька його щось запитає, показати їй якнайбільше загострених зубів, що розташовані поспіль.
Допоможіть Малому Бісеняті дізнатися, скільки найбільше зубів воно зможе показати.

Вхідні дані
У першому рядку задані два цілих числа 𝑛 та 𝑘 — кількість зубів та межа загостреності відповідно.
В другому рядку задано 𝑛 цілих чисел 𝑎𝑖 — коефіцієнти загостреності зубів.
Вихідні дані
Єдине ціле число — відповідь на задачу.
*/
#include <iostream>
using namespace std;
int main()
{
    long n,k,sum=0, maxsum=0;
    cin>>n>>k;
    int f[n];
    for (int i=0; i<n; i++)
    {
        cin>>f[i];
    }
    for (int i=0; i<n; i++)
    {
        if (f[i]>=k)
        {
            sum++;
            if (sum>maxsum)
            {
                maxsum=sum;
            }
        }
        else{
            sum=0;
        }
    }
    cout<<maxsum;
}
