/*Lab 1 Task 2 Variant 10
Автор:Сенько Вікторія
Група: ШІ-12 group3*/
#include <iostream>
using namespace std;
int main() {
    int n, m;
    cout<<"Введіть значення n та m: ";
    cin>>n>>m;
    //Виконуємо дію віднімання, після виконання значення n збільшується на 1 через постфіксний інкремент
    int res1 = n++ -m;
    cout<<"1)Значення n:"<<n<<" "<<"Значення m:"<<m<<endl;
    //Результат обчисленого виразу
    cout<<"Результат 1)n-- -m: "<<res1<<endl;
    cout<<endl;

    //Порівнюємо значення m та n, після виконання значення m зменшується на 1 через постфіксний декремент
    bool res2 = m--<n;
    cout<<"2)Значення n:"<<n<<" "<<"Значення m:"<<m<<endl;
    //Результат отримуємо у форматі 0 або 1, оскільки відбувається порівняння двох чисел, а не обчислення виразу
    cout<<"Результат 2)m--<n: "<<res2<<endl;
    cout<<endl;

    //Порівнюємо значення n та m, після виконання значення n збільшується на 1 через постфіксний інкремент
    bool res3 = n++>m;
    cout<<"3)Значення n:"<<n<<" "<<"Значення m:"<<m<<endl;
    //Результат отримуємо у форматі 0 або 1, оскільки відбувається порівняння двох чисел, а не обчислення виразу
    cout<<"Результат 3)n++>m: "<<res3<<endl;
    return 0;
}