/*Задача №0021 "Депутатські гроші"*/
#include <iostream>
using namespace std;
int main() {
    long long n;
    cin>>n;
    long long i=0;
    /*Шукаємо максимальну кількість купюр 
    з максимальним номіналом, а потім остачу яка залишилася після цієї дії 
    таким чином обчислюємо, поки не залишиться 0*/
    i += n / 500; n %= 500;
    i += n / 200; n %= 200;
    i += n / 100; n %= 100;
    i += n / 50;  n %= 50;
    i += n / 20;  n %= 20;
    i += n / 10;  n %= 10;
    i += n / 5;   n %= 5;
    i += n / 2;   n %= 2;
    i += n / 1;   n %= 1;
    cout<<i<<endl;
    return 0;
}