/*
Назва задачі:Автономність портативної зарядної станції
Автор:Катерина Лисенко
Номер групи:ШІ-12
*/

#include <iostream> // для вводу-виводу
#include <string> // для роботи з текстовими рядками
#include <cmath> // для математичних функцій
#include <iomanip> // для контролю знаків після коми
using namespace std; // використання стандартного простору імен, щоб не писати std:: перед кожним елементом
int main() {
    // Оголошення змінної для зберігання моделі станції
    string station_model;
    // Виведення запиту на екран для користувача
    cout << "Введіть назву станції: ";
    // Зчитування повного рядка разом з усіма знаками у змінну station_model
    getline(cin, station_model);
    // Перевірка довжини назви станції: якщо вона перевищує 31 символ про помилку і завершуємо програму з кодом 1
    if(station_model.length() > 31) {
        cout << "Назва станції занадто довга!" << endl; // виводимо повідомлення про помилку
        return 1; // Завершення програми з кодом 1, що означає помилку
    }
    // Перевірка наявності пробілів у назві станції
    // Функція find " " шукає пробіл, якщо він знайдений результат буде не рівний string::npos, що означає, що пробіл знайдено
    if(station_model.find(" ") != string::npos) {
        cout << "Назва станції має складатися з одного слова!" << endl; // виводимо повідомлення про помилку
        return 1;// Завершення програми з кодом 1, що означає помилку
    }
    // Оголошення змінної для зберігання паспортної ємності станції(число з плаваючою комою)
    float C;
    // Виведення запиту на екран для користувача на введення паспортної ємності станції
    cout << "Введіть папортну ємність Вт*год:" ; // виводимо повідомлення на екран
    cin >> C; //зчитування введеного значення у змінну C
    // Перевірка на від'ємне значення паспортної ємності
    if ( C<0) {
        cout << "Папортна ємність не може бути від'ємною!" << endl; // виводимо повідомлення про помилку
        return 1;// Завершення програми з кодом 1, що означає помилку
    }
    // Оголошення змінної для цілих чисел для зберігання кількості років використання станції
    int years;
    // Виведення запиту на екран для користувача на введення кількості років використання станції
    cout <<"Введіть кількісь років:" ;// виводимо повідомлення на екран
    cin >> years; // зчитування кількості років у змінну years
    // Перевірка на від'ємне значення кількості років
    if( years < 0) {
        cout << "Кількість років не може бути від'ємною!" << endl;// виводимо повідомлення про помилку
        return 1;// Завершення програми з кодом 1, що означає помилку
}
// Перевірка умови якщо кількоість років більше 20
if (years > 20) {
     cout << "Кількість років не може бути більше 20!" << endl;// виводимо повідомлення про помилку
     return 1;// Завершення програми з кодом 1, що означає помилку
    }
// Оголошення змінної для цілих чисел для зберігання кількості зарядів
    int charge;
    // Виведення запиту на екран для користувача на введення кількості зарядів
    cout << "Введіть кількість зарядів:" ;// виводимо повідомлення на екран
    cin >> charge; // зчитування кількості зарядів у змінну charge
    // Перевірка на від'ємне значення кількості зарядів
    if ( charge < 0) {
        cout << "Кількість зарядів не може бути менше 0 !" << endl;// виводимо повідомлення про помилку
        return 1;// Завершення програми з кодом 1, що означає помилку
 }
 // Перевірка умови якщо кількоість зарядів більше 100
 if ( charge > 100) {
    cout << "Кількість зарядів не може бути більше 100!" << endl;// виводимо повідомлення про помилку
    return 1;// Завершення програми з кодом 1, що означає помилку
 }
 // Оголошення змінної для зберігання ККД інвертора (число з плаваючою комою)
 float eff;
 // Виведення запиту на екран для користувача на введення ККД інвертора
    cout << "Введіть ККД інвентора %:" ;// виводимо повідомлення на екран
    cin >> eff;// зчитування введеного значення у змінну eff
    // Перевірка на від'ємне значення ККД інвертора
    if ( eff < 0) {
        cout << "ККД інвентора не може бути від'ємним!" << endl;// виводимо повідомлення про помилку
        return 1;// Завершення програми з кодом 1, що означає помилку
    }
    // Перевірка умови якщо ККД інвертора більше 100
    if ( eff > 100) {
        cout << "ККД інвентора не може бути більше 100%!" << endl;// виводимо повідомлення про помилку
        return 1;// Завершення програми з кодом 1, що означає помилку
}
// Оголошення змінної для зберігання потужності приладу (число з плаваючою комою)
float P;
cout << "Введіть потужність приладу Вт:" ;// виводимо повідомлення на екран
cin >> P;// зчитування введеного значення у змінну P
// Перевірка на від'ємне значення потужності приладу
if ( P < 0) {
    cout << "Потужність приладу не може бути від'ємною!" << endl;// виводимо повідомлення про помилку
    return 1;// Завершення програми з кодом 1, що означає помилку
}
const double DEGRADATION_PER_YEAR = 2.0;
// оголошення змінної для зберігання фактичної ємності станції (число з плаваючою комою)
double C_eff;
// обчислення фактичної ємності станції з урахуванням втрат ємності за роки використання
C_eff = C * pow(1 - DEGRADATION_PER_YEAR / 100.0, years);
// оголошення змінної для зберігання запасу енергії (число з плаваючою комою)
double E_stored;
// обчислення запасу енергії з урахуванням фактичної ємності станції та рівня зарядів
E_stored = C_eff * charge / 100;
// оголошення змінної для зберігання корисної енергії (число з плаваючою комою)
double E_useful;
// обчислення корисної енергії з урахуванням запасу енергії та ККД інвертора
E_useful = E_stored * eff / 100;
// оголошення змінної для зберігання витрат на перетворенні (число з плаваючою комою)
double E_loss ;
// обчислення витрат на перетворенні з урахуванням запасу енергії та корисної енергії
E_loss = E_stored - E_useful;
// оголошення змінної для зберігання часу роботи приладу в годинах (із дробовою частиною)
double T;
// обчислення часу роботи приладу:корисна енергія ділиться на потужність приладу
T = E_useful / P;
// оголошення змінної для зберігання цілої частини часу роботи приладу в годинах
int h;
// виділення цілої частини часу роботи приладу в годинах
h=T;
// оголошення змінної для зберігання кількості залишку хвилин після виділення цілої частини часу роботи приладу в годинах
int m;
// обчислення кількості залишку хвилин (дробова частина годин множиться на 60 хвилин)
m=(T - h) * 60;

// встановлення формату виводу чисел з плаваючою комою: фіксований формат та точність до одного знаку після коми
cout << fixed << setprecision(1);
// виведення результатів обчислень на екран
cout << "Модель: " << station_model << endl;
cout << "Паспортна ємність: " << C << " Вт*год" << endl;
cout << "Вік станції: " << years << " р."<< endl;
cout << "Фактична ємність: " << C_eff << " Вт*год" << endl;
cout << "Рівень зарядів: " << charge << "%" << endl;
// зміна формату виводу чисел з плаваючою комою: фіксований формат та точність до двох знаків після коми
cout << fixed << setprecision(2);
cout << "ККД інвертора: " << eff << "%" << endl;
// зміна формату виводу чисел з плаваючою комою: фіксований формат та точність до двох знаків після коми
cout << fixed << setprecision(1);
cout << "Запас енергії: " << E_stored << " Вт*год" << endl;
cout << "Корисна енергія: " << E_useful << " Вт*год" << endl;
cout << "Витрати на перетворенні: " << E_loss << " Вт*год" << endl;
// зміна формату виводу чисел з плаваючою комою: фіксований формат та точність до двох знаків після коми
cout << fixed << setprecision(2);
// виведення часу:  спочатку загальний час у годинах, потім у форматі годин та хвилин з двома знаками після коми для хвилин, де одне з них заповняється нулем
cout << "Час роботи: " << T << " год" << "=" << h << " год" << setfill('0') << setw(2) <<  m << " хв" << endl;


// завершення програми з кодом 0, що означає успішне виконання
 return 0;
}