/*
Лабораторна робота №2, Завдання 2, Варіант 3  
Коваль Станіслав
СШІ-12
*/
#include <iostream>
using namespace std;

int main() {
    //Введення значень
    int n, m;
    cout << "Ведіть n: ";
    cin >> n;
    cout << "Ведіть m: ";
    cin >> m;
    int N=n;
    int M=m;

    //Перше завдання n---m, віднімання m потім від n віднімаємо 1
    cout << "Операція 1: n---m: " << endl;
    cout << "Початкові значення: n = " << n << ", m = " << m << endl;
    cout << "Результат: " << (n --- m) << endl;
    cout << "Після операції: n = " << n << ", m = " << m << endl;

    n = N; //Відновлюємо значення n
    m = M; //Відновлюємо значення m
    //Друге завдання m--<n, спершу порівнюємо m та n, потім віднімаємо 1 від m
    cout << "Операція 2: m--<n: " << endl;
    cout << "Результат: " << bool(m -- < n) << " (Якщо 1 - T, якщо 0 - F)" << endl;
    cout << "Після операції: n = " << n << ", m = " << m << endl;

    n = N; //Відновлюємо значення n
    m = M; //Відновлюємо значення m
    //Третє завдання n-- >m, спершу порівнюємо n та m, потім віднімаємо 1 від n
    cout << "Операція 3: n-- >m: " << endl;
    cout << "Результат: " << bool(n -- > m) << " (Якщо 1 - T, якщо 0 - F)" << endl;
    cout << "Після операції: n = " << n << ", m = " << m << endl;

    return 0;
}