/*
Автономність портативної зарядної станції
Коваль Станіслав
СШІ-12
*/

#include <iostream>
#include <string> 
#include <cmath>
#include <iomanip>
using namespace std;

int main() {
//Створення змінної "Модель стануії" і преревірка на виконання умов
    string Station_model;
    cout << "Модель станції: ";
    cin >> Station_model;
    if (Station_model.length() > 31){
        cout << "Помилка: Модель станція мусить мати не більше 31 символа" <<endl;
        return 1;
    }

//Створення змінної "Паспортна ємність, Вт·год" і преревірка на виконання умов
    int C = 0;
    cout << "Паспортна ємність, Вт·год: ";
    cin >> C;
    if (C <= 0){
        cout << "Помилка: Паспортна ємність мусить бути більше 0" << endl;
        return 1;
    }
//Створення змінної "Вік станції, років" і преревірка на виконання умов
    int years = 0;
    cout << "Вік станції, років: ";
    cin >> years;
    if (years < 0 || years > 20){
        cout << "Помилка: Вік станції мусить бути від 0 до 20" << endl;
        return 1;
    }

//Створення змінної "Рівень заряду, %" і преревірка на виконання умов
    int charge = 0;
    cout << "Рівень заряду, %: ";
    cin >> charge;
    if (charge < 0 || charge > 100){
        cout << "Помилка: Рівень заряду мусить бути від 0 до 100" << endl;
        return 1;
    }

//Створення змінної "ККД інвертора, %" і преревірка на виконання умов
    double eff = 0;
    cout << "ККД інвертора, %: ";
    cin >> eff;
    if (eff <= 0 || eff >= 100){
        cout << "Помилка: ККД інвертора мусить бути більше 0, не більше 100" << endl;
        return 1;
    }

//Створення змінної "Потужність приладу, Вт" і преревірка на виконання умов
    int P = 0;
    cout << "Потужність приладу, Вт: ";
    cin >> P;
    if (P <= 0){
        cout << "Помилка: Потужність приладу мусить бути більше 0" << endl;
        return 1;
    }
//Обрахунок Фактичної ємності з урахуванням віку, Вт·год
    double C_eff = C*pow((1-2.0/100), years);

//Обрахунок Запасу енергії при поточному заряді, Вт·год
    double E_stored = C_eff*charge/100;

//Обрахунок Корисої енергії, що дійде до приладу, Вт·год
    double E_useful = E_stored*eff/100;

//Обрахунок Втрати на перетворенні напруги, Вт·год
    double E_loss = E_stored-E_useful;

//Обрахунок Часу роботи, годин
    double T=E_useful/P;

//Обрахунок Повних годин
    int h = (int)T;

//Обрахунок Хвилин що залишились
    int m = (int)((T-h)*60);

    cout << "Модель: " << Station_model <<endl;

    cout << "Паспортна ємність: " << fixed << setprecision(1) << (double)C << " Вт-год" << endl;

    cout << "Вік станцій: " << years << " р." << endl;

    cout << "Фактична ємність: " << setprecision(1) << C_eff << " Вт-год" << endl;

    cout << "Рівень ємності: " << charge << " %" << endl;

    cout << "ККД інвертора: " << setprecision(2) << eff << " %" << endl;

    cout << "Запас енергії: " << setprecision(1) << E_stored << " Вт-год" << endl;

    cout << "Корисна енергія: " << setprecision(1) << E_useful << " Вт-год" << endl;

    cout << "Втрати на перетворені: " << setprecision(1) << E_loss << " Вт-год" << endl;

    cout << "Час робити: " << setprecision(2) << T << " год" << " = " << h << " год " << setfill('0') << setw(2) << m << " хв" << endl;
    return 0;
}