/* 
Задача: Непередбачувана погода
Автор: Дрогомирецька Ольга
Група: ШІ-13

Зеник хоче прогулятися парком з Марічкою. 
Однак він не хоче, щоб його друг замерз під час прогулянки. 
Тому Зеник знайшов в Інтернеті прогноз погоди на наступні n днів. 
Протягом і-го дня він знає, що середня температура повітря в цей день становитиме градуси Цельсія.
За словами Зеника, для прогулянки підходять лише дні, коли середня температура повітря позитивна.
Допоможіть Зеніку визначити дні, які, на його думку, підходять для прогулянки. 
Зауважте, що дні нумеруються, починаючи з одного.

Вхідні дані
Перший рядок містить одне додатне ціле число n — кількість днів, на які Зеник знає прогноз погоди.
Другий рядок містить n цілих чисел ai — середню температуру повітря у відповідні дні.

Вихідні дані
В одному рядку надрукуйте кілька цифр — числа днів, які, на думку Зеника, підходять для прогулянки, у порядку зростання.
Гарантовано, що буде принаймні один такий день.
*/ 
#include <iostream>
using namespace std;
int main() {
    int n;
    cin >> n;

    int a[100];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    for (int i = 0; i < n; i++) {
        if (a[i] > 0) {
            cout << i + 1 << " ";
        }
    }
    return 0;
}