/*
Задача: Цікава гра
Автор: Дрогомирецька Ольга
Група: ШІ-13

Маленький Імп і Дракон люблять проводити свій вільний час разом. 
Сьогодні вони грають у цікаву гру.
Гра відбувається на дошці розміром N * M. Спочатку всі клітинки дошки білі.
Гравці ходять по черзі, і Маленький Імп починає гру. 
Під час свого ходу гравець вибирає одну білу клітинку дошки та зафарбовує її в чорний колір.
Гравець, який не може зробити допустимий хід (оскільки вся дошка вже чорна), програє, а його суперник вважається переможцем.
Ваше завдання — визначити переможця гри.
Вхідні дані
Два цілі числа N і M, розділені пробілом.
Вихідні дані
Виведіть "Імп" (лапки наведено для ясності), якщо Маленький Імп виграє гру, інакше виведіть "Дракон".
*/
#include <iostream>
using namespace std;

int main() {
    int N, M;
    cin >> N >> M;

    if ((N * M) % 2 == 1) {
        cout << "Imp"<< endl;
    } else {
        cout << "Dragon" << endl;
    }
    return 0;
}