/*
Задача: Зуби
Автор: Дрогомирецька Ольга
Група: ШІ-13

Маленький Імп має N зубів. Кожен i-й зуб має коефіцієнт гостроти A_i.
Маленький Імп називає зуб «крутим», якщо його коефіцієнт гостроти не менший за K.
Ваше завдання — знайти максимальну кількість послідовних «крутих» зубів.
Вхідні дані
У першому рядку містяться два цілі числа N і K, розділені пробілом.
У наступному рядку містяться N цілих чисел A_i, розділених пробілами, — коефіцієнти гостроти зубів.
Вихідні дані
Виведіть максимальну кількість послідовних «крутих» зубів.
*/
#include <iostream>
using namespace std;
int main() {
    int n, k;
    cin >> n >> k;

    int a[100000];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
        int current = 0;
        int maxLength = 0;
        for (int i = 0; i < n; i++) {
            if (a[i] >= k) {
                current++;

                if (current > maxLength) {
                    maxLength = current;
                }
            } else {
                current = 0;
            }
        }
        cout << maxLength << endl;
    return 0;
}