/*
Олексійчук Захар ШІ-14
У вашого персонажа є H хітпойнтів та M мани.
Персонаж 3 рази використає закляття, кожне з яких може використати хітпойнти та ману одночасно.
Якщо якесь закляття забирає і хітпойнти і ману - ваш персонаж програє, отже для виграшу треба використовувати при одному заклинанні АБО хітпойнти, АБО ману.
Якщо в кінці персонаж буде мати додатню кількість хітпойнтів та мани (𝐻,𝑀 >0) - він виграє, в іншому випадку програє.
Ваше завдання у випадку виграшу персонажа вивести YES, вивести NO у іншому випадку.*/

#include <iostream>

using namespace std;

int main() {
    long H = 0;
    long M = 0;

    if (!(cin >> H >> M)) {
        cout << "NO\n";
        return 0;
    }

    bool is_valid = true;

    for (int i = 0; i < 3; i++) {
        long h_i = 0;
        long m_i = 0;

        cin >> h_i >> m_i;

        if (h_i > 0 && m_i > 0) {
            is_valid = false;
        }

        H -= h_i;
        M -= m_i;
    }

    if (is_valid && H > 0 && M > 0) {
        cout << "YES\n";
    } else {
        cout << "NO\n";
    }

    return 0;
}