/*
Олексійчук Захар ШІ-14
У вас є стіл, у якого є 4 ніжки, довжини яких вам дано.
Ви хочете зробити ніжки рівної довжини, для цього ви відпиляєте 𝑑 від кожної ніжки (тобто вам буде дано 4 числа, кожне з яких буде означати відпилювання від відповіної ніжки стола).
Якщо під час відпилювання найдовша ніжка стола буде у 2 рази більша-рівна ніж найменша ніжка - стіл перевернеться, але відпилювати ніжки це вам не завадить.
Тобто якщо ℎ𝑚𝑎𝑥 >=2 ∗ℎ𝑚𝑖𝑛 то стіл перевертається. Увага, це може статися і між початком та кінцем відпилювання, наприклад коли відпиляють 2, але ще не встигнуть відпиляти 3тю ніжку. Також ми вважаємо що перед відпилюванням стіл не перевернеться.
Ваше завдання сказати чи після усіх маніпуляцій стіл буде цілий та паралельний підлозі.
Якщо довжина, яку відріжуть буде більша за довжину ножки - вам треба вивести ERROR.
Увага! Навіть якщо стіл перевернеться - ви все одно відпилюєте ніжки і можете отримати ERROR.
*/
#include <iostream>
using namespace std;

int main() {
    long long h[4], d[4];
    for (int i = 0; i < 4; i++) cin >> h[i];
    for (int i = 0; i < 4; i++) cin >> d[i];

    for (int i = 0; i < 4; i++) {
        if (d[i] > h[i]) {
            cout << "ERROR\n";
            return 0;
        }
    }

    bool tipped = false;
    for (int i = 0; i < 4; i++) {
        h[i] -= d[i];

        long long min_h = h[0], max_h = h[0];
        for (int j = 1; j < 4; j++) {
            if (h[j] > max_h) max_h = h[j];
            if (h[j] < min_h) min_h = h[j];
        }
        if (max_h >= 2 * min_h) tipped = true;
    }

    if (!tipped && h[0] == h[1] && h[1] == h[2] && h[2] == h[3] && h[0] > 0)
        cout << "YES\n";
    else
        cout << "NO\n";

    return 0;
}