/*
Олексійчук Захар ШІ-14
Стипендія
Ілона Максимівна вчиться в Університеті імені Юпітера, що розташований у мальовничому каньйоні Іо на планеті Марс.
Сьогодні в Ілони був останній іспит. Тепер вона знає всі свої оцінки за сесію.
Оцінки в Університеті імені Юпітера виставляються в 100-бальній шкалі.
Якщо в студента всі оцінки відмінні (не менші за 90), то йому призначається підвищена стипендія.
Якщо всі оцінки студента не менші за 51, але він не має права на підвищену стипендію, він отримує звичайну стипендію.
Якщо студент має хоч одну незадовільну оцінку (меншу за 51), йому стипендія не призначається.
Оскільки проживання в каньйоні Іо не з дешевих, Ілона хоче чимшвидше знати, чи світить їй стипендія.
Допоможіть їй, а вона за це вас запросить у гості.
*/

#include <iostream>

using namespace std;

int main(){
    int n, a;
    cin >> n;
    int high=0, usual=0;
    for (int i=0; i < n; i++){
        cin >> a;
        if (a >= 90) high++;
        else if (a >= 51) usual++;
        else continue;
    }
    if (high == n) cout << "Pidvyshchena\n";
    else if (usual+high == n) cout << "Zvychaina\n";
    else cout << "Zabud pro stypendiiu\n";

    return 0;
}