/*
    Lab 1 Task 2
    Михайловська Анна
    ШІ-14
    Варіант 8
*/
#include <iostream> // Для cin і cout
using namespace std;

int main() {
    int n, m;

    cout << "Введіть n і m: ";
    cin >> n >> m;

    // Спочатку обчислюється старе n - m, після цього n збільшується на 1.
    int result1 = n++ - m;
    cout << "1) n++ - m = " << result1
         << "; n = " << n << ", m = " << m << '\n';

    // Спочатку перевіряється, чи m > n, а потім m зменшується на 1.
    bool result2 = m-- > n;
    cout << "2) m-- > n = " << result2
         << "; n = " << n << ", m = " << m << '\n';

    // Використовуємо значення після двох попередніх виразів, спочатку перевіряється, чи n > m, а потім n зменшується на 1.
    bool result3 = n-- > m;
    cout << "3) n-- > m = " << result3
         << "; n = " << n << ", m = " << m << '\n';

    return 0; 
}