/*
Task name: Автономність портативної зарядної станції
Name: Vasyl Yakubovskyi
Group: Ші-14(I)
*/



#include <iostream> //Бібліотека для вводу 
#include <string> //Бібліотека для роботи з текстовими зміннами.
#include <cmath> //Бібліотека для математичних дій


using namespace std; //Використовуємо простір імен std, щоб не звертатись кожен раз до нього.
int main() { 
    setlocale(LC_ALL, "uk_UA"); //підключаємо українську мову для виводу у консоль
    cout << "Модель станції - "; // Просимо користувача ввести назву 1)
    string station_name;
    getline(cin, station_name); // Зчитуємо всю назву, навіть із пробілами 
    if (station_name.length() > 31 ) // робимо перевірку на довжину ім'я
    {
        cout << "Помилка. Завелика назва" << endl; // виводимо помилку
        return 1;
    }
    cout << "Паспортна ємність Вт год: "; // Просимо користувача ввести ємність 2)
    double C = 0; // задаємо числову дробову змінну
    cin >> C;
    if (C <= 0) 
    {
        cout << "Помилка. НЕ вірне число. " << endl; // виводимо помилку
        return 1;
    }

    cout << "Вік станції (у роках): "; // Просимо користувача ввести вік 3)
    double years = 0;
    cin >> years;
    if (years < 0 || years > 20) 
    {
        cout << "Помилка. НЕ вірне число." << endl; // виводимо помилку
        return 1;
    }


     cout << "Рівень заряду, %: "; // Просимо користувача ввести рівень заряду 4)
    double charge = 0;
    cin >> charge;
    if (charge < 0 || charge > 100) 
    {
        cout << "Помилка. НЕ вірне число." << endl; // виводимо помилку
        return 1;
    }


     cout << "ККД інвертора, % :  "; // Просимо користувача ввести вік 5)
    double eff = 0;
    cin >> eff;
    if (eff <= 0 || eff > 100) 
    {
        cout << "Помилка. НЕ вірне число." << endl; // виводимо помилку
        return 1;
    }

     cout << "Потужність приладу, Вт:  "; // Просимо користувача ввести вік 6)
    double P = 0;
    cin >> P;
    if (P <= 0) 
    {
        cout << "Помилка. Число мене за нуль." << endl; // виводимо помилку
        return 1;
    }

    double C_eff = C * pow(1.0 - 2.0 / 100.0, years);  // 1. Рахуємо фактичну ємність

    double E_stored = C_eff * charge / 100.0;  // 2. Рахуємо запас енергії

    double E_useful = E_stored * eff / 100.0;    // 3. Рахуємо корисну енергію


    double E_loss = E_stored - E_useful;    // 4. Рахуємо втрати


    double T = E_useful / P;    // 5. Рахуємо Загальний час роботи у годинах 


    int h = T;    // 6. Рахуємо повні години 


    int m = (T - h) * 60;    // 7. Рахуємо хвилини, що залишилися                                  

    // Виводимо результат: 
    cout << "      Результат:    " << endl;

    cout << "Модель станції: \t" << station_name <<  endl;     

    cout << "Паспортна ємність: \t" << C << endl;   

    cout << "Вік станції (років): \t"  << years << endl;   

    cout  << "Фактична ємність \t" << C_eff << endl;    

    cout <<  "Рівень заряду (%): \t" << charge << endl;    

    cout << "ККД інвертора (%): \t" << eff << endl;   

    cout << "Запас енергії: \t \t" << E_stored << endl;  

    cout << "Корисна енергія: \t" << E_useful << endl; 

    cout << "Втрати на перетворення: " << E_loss << endl;

    cout << "Час роботи (годин): \t" << T << endl;

    cout << "Час роботи (год хв): \t" << h << " год " << m << " хв" << endl;

    return 0;
  
}
