/*
Lab 1 task 2, Танасієнко Іван, ШІ-13, Варіант 19
*/
#include<iostream>


/*
1) - -m-++n
2) m*n<n++
3) n-- > m++
*/
int main()
{
    int m, n;
    
    std::cout << "Початкові значення:" << std::endl << "m: 24" << std::endl << "n: 47" << std::endl;
    /*
    В першій операції ми спочатку двічі змінюємо знак m на протилежний, через що m знову стає додатним, 
    і потім віднімаємо від m значення n, попередньо збільшене префіксом ++.
    */
    m = 24;
    n = 47;
    auto result1 = - -m-++n;
    std::cout << result1 << ' ' << m << ' ' << n << std::endl;

    //В другій операції ми множимо m на n, після чого порівнюємо m зі значенням n чи є значення m більшим. Наприкінці значення n збільшується на 1.
    m = 24;
    n = 47;
    bool result2 = m*n<n++;
    std::cout << result2 << ' ' << m << ' ' << n << std::endl;

    //В третій операції ми порівнюємо значення n зі значенням m, чи є n меншим. Після порівняння ми зменшуємо значення n на 1 і збільшуємо значення m на 1.
    m = 24;
    n = 47;
    bool result3 = n-- < m++;
    std::cout << result3 << ' ' << m << ' ' << n << std::endl; 

    return 0;
}