/*
Lab 1 task 2, Танасієнко Іван, ШІ-13, Варіант 19
*/
#include<iostream>

/*
1) - -m-++n
2) m*n<n++
3) n-- > m++
*/
int main()
{
    int m, n;
    std::cout << "m: ";
    std::cin >> m;
    std::cout << "n: ";
    std::cin >> n;
    std::cout << "Початкові значення:" << std::endl << "m: " << m << std::endl << "n: " << n << std::endl;
    /*
    В першій операції ми спочатку двічі змінюємо знак m на протилежний, через що m повертається до початкового значення, 
    і потім віднімаємо від m значення n, попередньо збільшеного префіксом ++.
    */
    int result1 = - -m-++n;
    std::cout << "Результат першої операції: "<< result1 << std::endl
    << "Значення m: " << m << std::endl << "Значення n: " << n << std::endl;

    //В другій операції ми порівнюємо добуток m та n зі значенням n, чи є добуток m та n меншим. Наприкінці операції значення n збільшується на 1.
    bool result2 = m*n<n++;
    std::cout << "Результат другої операції: "<< result2 << std::endl
    << "Значення m: " << m << std::endl << "Значення n: " << n << std::endl;

    //В третій операції ми порівнюємо значення n зі значенням m, чи є n більшим. Після порівняння ми зменшуємо значення n на 1 і збільшуємо значення m на 1.
    bool result3 = n-- > m++;
    std::cout << "Результат третьої операції: "<< result3 << std::endl
    << "Значення m: " << m << std::endl << "Значення n: " << n << std::endl;

    return 0;
}