#include<iostream>

/*
 Пароль проходить мінімальні вимоги, якщо його довжина не менше 8 символів і кількість типів символів не менше 2.

 Використовуйте таку логіку
if else,  щоб вирішити, чи пароль проходить мінімальні вимоги.
if, else if,  щоб визначити рівень надійності (від 1 до 5).
switch case, щоб видати рекомендацію відповідно до рівня.


Довжина пароля: 14
Чи є цифри (y/n): y
Чи є великі літери (y/n): y
Чи є спеціальні символи (y/n): y
 
Мінімальні вимоги: ПРОЙДЕНО
Рівень надійності: 5 - Дуже надійний
Рекомендація: Відмінно. Змінювати нічого не потрібно.

Довжина пароля — Формат вводу: Ціле число, напр. 12 — Допустимі значення: від 1 до 64
Чи є цифри — Формат вводу: Один символ — Допустимі значення: рівно y або n
Чи є великі літери — Формат вводу: Один символ — Допустимі значення: рівно y або n
Чи є спеціальні символи — Формат вводу: Один символ — Допустимі значення: рівно y або n
 */

int main()
{
    int length, level;
    int types = 0;
    char numbers, capLetters, specSymbols;
    bool minRequirements;

    std::cout << "Довжина пароля: ";
    std::cin >> length;
    std::cout << "Чи є цифри (y/n): ";
    std::cin >> numbers;
    std::cout << "Чи є великі літери (y/n): ";
    std::cin >> capLetters;
    std::cout << "Чи є спеціальні символи (y/n): ";
    std::cin >> specSymbols;

    char typesList[3] = {numbers, capLetters, specSymbols};

    if(length < 1 || length > 64)
    {
        std::cout << "Введіть правильну довжину паролю(від 1 до 64)" << std::endl;
        return 1;
    }
    if(numbers != 'y' && numbers != 'n')
    {
        std::cout << "Введіть дійсне значення(y/n)" << std::endl;
        return 1;
    }
    if(capLetters != 'y' && capLetters != 'n')
    {
        std::cout << "Введіть дійсне значення(y/n)" << std::endl;
        return 1;
    }
    if(specSymbols != 'y' && specSymbols != 'n')
    {
        std::cout << "Введіть дійсне значення(y/n)" << std::endl;
        return 1;
    }

    //Кількість типів
    for(int i = 0; i < 3; i ++)
    {
        if(typesList[i] == 'y')
        {
            types++;
        }
    }
    //Від хорошого життя лаби в перший ж день після захисту не роблять

    //Мінімальні вимоги
    if(length >= 8 && types >= 2)
    {
        minRequirements = true;
    }
    else
    {
        minRequirements = false;
    }

    //Перевірка надійності

    /*
    Довжина менше 6 — Рівень 1 - Дуже слабкий
    Довжина менше 8 АБО типів символів 0 — Рівень 2 - Слабкий
    Типів символів рівно 1 — Рівень 3 - Середній
    Довжина 12 і більше І типів символів рівно 3 — Рівень 5 - Дуже надійний
    Усі інші випадки — Рівень 4 - Надійний
*/

    if(length < 6)
    {
        level = 1;
    }
    else if(length < 8 || types == 0)
    {
        level = 2;
    }
    else if(types == 1)
    {
        level = 3;
    }
    else if(length >= 12 && types == 3)
    {
        level = 5;
    }
    else
    {
        level = 4;
    }

    if(minRequirements)
    {
        std::cout << "Мінімальні вимоги: ПРОЙДЕНО" << std::endl;
    }
    else
    {
        std::cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << std::endl;
    }
    switch(level)
    {
        case 1:
            std::cout << "Рівень надійності: 1 - Дуже слабкий" << std::endl;
            std::cout << "Пароль надто короткий. Мінімум 8 символів." << std::endl;
            break;
        case 2:
            std::cout << "Рівень надійності: 2 - Слабкий" << std::endl;
            std::cout << "Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << std::endl;
            break;
        case 3:
            std::cout << "Рівень надійності: 3 - Середній" << std::endl;
            std::cout << "Додайте ще один тип символів або збільште довжину до 12." << std::endl;
            break;
        case 4:
            std::cout << "Рівень надійності: 4 - Надійний" << std::endl;
            std::cout << "Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << std::endl;
            break;
        case 5:
            std::cout << "Рівень надійності: 5 - Дуже надійний" << std::endl;
            std::cout << "Відмінно. Змінювати нічого не потрібно." << std::endl;
            break;

        //Не виконує практичної функції, необхідне для виконання вимог до коду
        default:
            std::cout << "Щось пішло не так." << std::endl;
            return 1;
    }

    //Що я хотів?

    if(numbers == 'n')
    {
        std::cout << "Попередження: Пароль тільки з літер підбирається швидше." << std::endl;
    }

    //І це все?

    return 0;
}