/*Аналізатор надійності пароля
Група: ШІ-11
Автор: Шведько Юлія*/

#include <iostream>
using namespace std;

int main()
{
    int l; // Задання довжини паролю
    cout << "Довжина пароля: ";
    cin >> l;
    if(l < 1 || l > 64) // Перевірка довжини на допустимі значення
    {
        cout << "Довжина пароля має бути від 1 до 64!" << endl;
        return 1;
    }

    char a; // Чи є цифри?
    cout << "Чи є цифри(y/n): ";
    cin >> a;
    if(a != 'n' && a != 'y') // Перевірка на коректне введення данних
    {
        cout << "Значення має бути yes або no!" << endl;
        return 1;
    }

    char b; // Чи є великі літери?
    cout << "Чи є великі літери(y/n): ";
    cin >> b;
    if(b != 'n' && b != 'y') // Перевірка на коректне введення данних
    {
        cout << "Значення має бути yes або no!" << endl;
        return 1;
    }

    char c; // Чи є спеціальні символи?
    cout << "Чи є спеціальні символи(y/n): ";
    cin >> c;
    if(c != 'n' && c != 'y') // Перевірка на коректне введення данних
    {
        cout << "Значення має бути yes або no!" << endl;
        return 1;
    }

    // Задання кількості типів символів
    int n = 0; 
    if(a == 'y')
    n++;
    if(b == 'y')
    n++;
    if(c == 'y')
    n++;

    // Перевірка чи пройдено мінімальні вимоги
    cout << endl;
    cout << "Мінімальні вимоги: ";
    if(l >= 8 && n >= 2)
    cout << "ПРОЙДЕНО" << endl;
    else
    cout << "НЕ ПРОЙДЕНО" << endl;

    // Визначення рівня надійності паролю
    cout << "Рівень надійності: "; 
    int r;
    if(l < 6)
    {
        r = 1;
        cout << r << " - дуже слабкий" << endl;
    }
    else if(l < 8 || n == 0)
    {
        r = 2;
        cout << r << " - слабкий" << endl;
    }
    else if(n == 1)
    {
        r = 3;
        cout << r << " - середній" << endl;
    }
    else if(l >= 12 && n ==3)
    {
        r = 5;
        cout << r << " - дуже надійний" << endl;
    }
    else
    {
        r = 4;
        cout << r << " - надійний" << endl;
    }

    // Надання рекомендацій відповідно до рівня надійності паролю
    cout << "Рекомендації: "; 
    switch (r)
    {
        case 1:
        cout << "Пароль надто короткий. Мінімум 8 символів." << endl;
        break;
        case 2:
        cout << "Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl;
        break;
        case 3:
        cout << "Додайте ще один тип символів або збільште довжину до 12." << endl;
        break;
        case 5:
        cout << "Відмінно. Змінювати нічого не потрібно." << endl;
        break;
        default:
        cout << "Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl;
        break;
    }

    // Попередження, якщо пароль не містить цифр і спеціальних символів
    if(a == 'n' && c == 'n') 
    cout << "Попередження: пароль тільки з літер підбирається швидше." << endl;

    return 0;
}