/*
    Задача : Автономність портативної зарядної станції
    виконавець: Шикоряк Андрій Олегович
    група: ШІ-13

 */

#include <iostream>
#include <cmath> //Потрібно для піднесння в степінь
#include <iomanip> // для заокргулення, команди fixed, setprecision 
using namespace std;// потрібно для спрощення роботи з cout, cin

int main() {
    //відсоток втрати ємності за рік
    const double YEAR_LOSS = 0.02 ;
    //ініціалізація змінних
    string model_name;
    int C , years, charge,P;
    double eff;


    // зчитування даних для змінних та перевірка на істинність
    cout << "Модель станції: ";
    cin >> model_name;
    if(model_name.length() > 51){
        cout << "Ви ввели неправильну інформацію, назва моделі має бути більше ніж 50 символів" << endl;
        return 1;
    }
    cout << "Паспортна ємність (Вт·год): ";
    cin >> C;
    if (C <= 0){
        cout << "Ви ввели неправильнну інформацію, ємність не може бути менша за 0 або дорівнювати 0" << endl;
        return 1;
    }
    cout << "Вік станції (років): ";
    cin >> years;
    if (years < 0 || years > 20){
        cout << "Ви ввели неправильнну інформацію, вік станції не може бути меншим за 0 або більшим за 20" << endl;
        return 1;
    }
    
    cout << "Рівень заряду (%): ";
    cin >> charge;
    if (charge < 0 || charge > 100){
        cout << "Ви ввели неправильнну інформацію, заряд не може бути меншим за 0 або більшим за 100" << endl;
        return 1;
    }
    cout << "ККД інвертора (%): ";
    cin >> eff;
    if (eff <= 0.0 || eff > 100.0){
        cout << "Ви ввели неправильнну інформацію, ккд не може бути меншим або дорівнювати 0 або більшим за 100" << endl;
        return 1;
    }
    cout << "Потужність приладу (Вт): ";
    cin >> P;
    if (P <= 0){
        cout << "Ви ввели неправильнну інформацію , потужність не може бути менша або дорівнювати 0" <<endl;
        return 1;
    }

    // ініціалізація , зчитування, та розрахунок формул.
    //Фактична ємність з урахуванням віку Вт·год
    double C_eff;
    if (years == 0){
        C_eff = C; // якщо вік = 0 , то станція нова , отже, розрахунок не потрібний
    }else{
        
        C_eff = C * pow(1.0 - YEAR_LOSS, years);
    }
    //Запас енергії, Корисна енергія, що дійде до приладу  Вт·год,
    double E_stored , E_useful;
    //  Втрати на перетворенні напруги Вт·год
    double E_loss;
    // Час роботи у годинах
    double T;
    // Повні години та хвилини
    int h , m;
    //Виконання дій над змінними
    E_stored = C_eff * charge / 100;
    E_useful = E_stored * eff / 100;
    E_loss = E_stored - E_useful;
    T = E_useful / P;
    h = (int)T;
    m = (T - h) * 60;
    
    // Виведення остаточних результатів, заокруглення до порібних результатів
    cout << "-----------------------------------------------------" << endl;
    cout << "Модель: " << model_name << endl;
    cout << "Паспортна ємність: " <<fixed << setprecision(1)<< C << " Вт·год" << endl;
    cout << "Вік станції: " << years << " р."<< endl;
    cout << "Фактична ємність: " <<fixed << setprecision(1)<< C_eff<< " Вт·год" << endl;
    cout << "Рівень заряду: " << charge  << " %" << endl;
    cout << "ККД інвертора: " <<fixed << setprecision(2)<< eff << " %" << endl;
    cout << "Запас енергії: " <<fixed << setprecision(1)<< E_stored << " Вт·год" << endl;
    cout << "Корисна енергія: " << E_useful<<fixed << setprecision(1) << " Вт·год" << endl;
    cout << "Втрати на перетворенні: " << E_loss<<fixed << setprecision(1) << " Вт·год"<< endl;
    // Вивід часу
    cout << "Час роботи: "<<fixed<<setprecision(2) <<T << " год = " ;
    // Перевірка , як правильно виводити хвилини.
    if ( m < 10){
        cout << " " << h <<" год " << "0" << m << " хв" << endl ;
    }
    else{
        cout << "  " <<h <<" год " << m << " хв" << endl ;
    }
    
    
    return 0;
}
