/*
    Задача : Автономність портативної зарядної станції
    виконавець: Шикоряк Андрій Олегович
    група: ШІ-13


 */

#include <iostream>
#include <cmath> //Потрібно для піднесння в степінь
#include <iomanip> // для заокргулення, команди fixed, setprecision 
using namespace std;// потрібно для спрощення роботи з cout, cin

int main() {
    //відсоток втрати ємності за рік
    const double YEAR_LOSS = 0.02;
    //ініціалізація змінних
    string model_name;
    int C;
    int years;
    int charge;
    double eff;
    int P;

    // зчитування даних для змінних та перевірка на істинність
    cout << "Модель станції: ";
    getline(cin,model_name);

    cout << "Паспортна ємність (Вт·год): ";
    cin >> C;
    if (C < 0){
        cout << "Ви ввели неправильнну інформацію, ємність не може бути менша за 0";
        return 1;
    }
    cout << "Вік станції (років): ";
    cin >> years;
    if (years < 0 || years >= 20){
        cout << "Ви ввели неправильнну інформацію, вік станції не може бути меншим за 0 або більшим за 20";
        return 1;
    }
    
    cout << "Рівень заряду (%): ";
    cin >> charge;
    if (charge < 0 || charge > 100){
        cout << "Ви ввели неправильнну інформацію, заряд не може бути меншим за 0 або більшим за 100";
        return 1;
    }
    cout << "ККД інвертора (%): ";
    cin >> eff;
    if (eff <= 0.0 || eff > 100.0){
        cout << "Ви ввели неправильнну інформацію, ккд не може бути меншим за 0 або більшим за 100";
        return 1;
    }
    cout << "Потужність приладу (Вт): ";
    cin >> P;
    if (P <= 0){
        cout << "Ви ввели неправильнну інформацію , потужність не може бути менша за 0";
        return 1;
    }

    // ініціалізація , зчитування, та розрахунок формул.
    //Фактична ємність з урахуванням віку
    double C_eff;
    if (years == 0){
        C_eff = C; // якщо вік = 0 , то станція нова , отже, розрахунок не потрібний
    }else{
        
        C_eff = C * pow(1 - YEAR_LOSS, years);
    }
    //Запас енергії при поточному заряді,розрахунок часткою а не відсотками
    double E_stored = C_eff * charge / 100;
    // Корисна енергія, що дійде до приладу, також розрахунок часткою а не відсотками
    double E_useful = E_stored * eff / 100;
    // Втрати на перетворенні напруги, також розрахунок часткою а не відсотками
    double E_loss = E_stored - E_useful;
    // Час роботи
    double T = E_useful / P;
    // Повні години
    int h = T;
    // Хвилини
    int m = (T - h) * 60;
    
    // Виведення остаточних результатів, заокруглення до порібних результатів
    cout << "-----------------------------------------------------" << endl;
    cout << "Модель: " << model_name << endl;
    cout << "Паспортна ємність: " <<fixed << setprecision(1)<< C << " Вт·год" << endl;
    cout << "Вік станції: " << years << " р."<< endl;
    cout << "Фактична ємність: " <<fixed << setprecision(1)<< C_eff<< " Вт·год" << endl;
    cout << "Рівень заряду: " << charge  << " %" << endl;
    cout << "ККД інвертора: " <<fixed << setprecision(2)<< eff << " %" << endl;
    cout << "Запас енергії: " <<fixed << setprecision(1)<< E_stored << " Вт·год" << endl;
    cout << "Корисна енергія: " << E_useful<<fixed << setprecision(1) << " Вт·год" << endl;
    cout << "Втрати на перетворенні: " << E_loss<<fixed << setprecision(1) << " Вт·год"<< endl;
    // Вивід часу
    cout << "Час роботи: "<<fixed<<setprecision(2) <<T << " год = " ;
    // Перевірка , як правильно виводити хвилини.
    if ( m < 10){
        cout << " " << h <<" год " << "0" << m << " хв" ;
    }
    else{
        cout << "  " <<h <<" год " << m << " хв" ;
    }
    
    
    return 0;
}