#include <iostream>
#include <ctime>
#include <algorithm> 
using namespace std;

/*
На свій день народження Зеник вирішив запросити Марічку до ресторану. Оскільки хотілося чогось вишуканого, його вибір впав на ресторан із цікавою назвою «Шаверма-Кебаб».

Наївшись досхочу котятини, молоді люди вирішили покинути гостинне місце й узяли рахунок для оплати. Але чи то офіціант з’їв не тих грибів, чи то в цьому вишуканому закладі так прийнято, замість рахунку їм принесли аркуш паперу, на якому було написано два різні числа 𝑎 й 𝑏.

Головні герої нічого не зрозуміли, та й уже було темно за вікном, тому вони вирішили розрахуватися такою цілою сумою (у гривнях, без копійок), щоб вона була строго більшою за одне з цих чисел і строго меншою за інше.

Скільки ж грошей вони могли заплатити?

Вхідні дані
У єдиному рядку задано два цілі числа 𝑎 й 𝑏 — числа, що були записані на аркуші паперу.

Вихідні дані
У єдиному рядку виведіть єдине ціле число 𝑐, яке є більшим за одне з чисел на аркуші й меншим за інше. Якщо таких чисел не існує, виведіть -1. Якщо таких чисел декілька, виведіть довільне.*/





int main() {
    int a, b;
    cin >> a >> b;
    
  
    int minimum = min(a, b);
    int maximum = max(a, b);
    
  
    if (maximum - minimum <= 1) {
        cout << -1 << endl;
    } else {
        
        cout << minimum + 1 << endl;
    }
    
    return 0;
}
// Зараховано