#include <iostream>

int main(){
    //оголощуємо змінні
    long long H,M,h1,h2,h3,m1,m2,m3;
    //по 2 за раз, запитуємо їху користувача
    std::cin >> H >> M;
    std::cin >> h1 >> m1;
    std::cin >> h2 >> m2;
    std::cin >> h3 >> m3;
    //перевіряємо чи вистачило хітпоїнтів та мани, та чи не використовувались хітпоінти та мана одночасно
    //виводимо результат, переміг, чи ні
    if(((H-h1-h2-h3)>0 && (M-m1-m2-m3)>0) && !(h1!=0 && m1!=0) && !(h2!=0 && m2!=0) && !(h3!=0 && m3!=0)){
        std::cout << "YES";
    } else{
        std::cout << "NO";
    }
}