#include <iostream>

int main(){
    // Оголошення змінних
    int lenght;
    int types = 0;
    int level = 0;
    char _isNumbers, _isBigLetter, _isSymbols;

    //Перевірка мінімальної та максимальної довжини пароля
    std::cout << "Довжина пароля ";
    std::cin >> lenght;
    if (lenght < 1 || lenght > 64){
        std::cout << "Помилка: довжина мусить бути від 1 до 64";
        return 1;
    };

    //Питаємо користувача Чи є цифри
    std::cout << "Чи є цифри ";
    std::cin >> _isNumbers;
    //Опрацьовуємо ввід, якщо відповідь у то додаємо 1 до кількості типів символів, якщо ні х ні у то видаємо помилку
    if (_isNumbers == 'y'){
        types++;
    } else if(_isNumbers != 'y' && _isNumbers != 'n'){
        std::cout << "Введіть дійсне значення";
        return 1;
    }

    //Питаємо користувача Чи є великі літери
    std::cout << "Чи є великі літери ";
    std::cin >> _isBigLetter;
    //Опрацьовуємо ввід, якщо відповідь у то додаємо 1 до кількості типів символів, якщо ні х ні у то видаємо помилку
    if (_isBigLetter == 'y'){
        types++;
    } else if(_isBigLetter != 'y' && _isBigLetter != 'n'){
        std::cout << "Введіть дійсне значення";
        return 1;
    }

    //Питаємо користувача Чи є спеціальні символи
    std::cout << "Чи є спеціальні символи ";
    std::cin >> _isSymbols;
    //Опрацьовуємо ввід, якщо відповідь у то додаємо 1 до кількості типів символів, якщо ні х ні у то видаємо помилку
    if (_isSymbols == 'y'){
        types++;
    } else if(_isSymbols != 'y' && _isSymbols != 'n'){
        std::cout << "Введіть дійсне значення";
        return 1;
    }

    //Перевіряємо мінімальні вимоги, та виводимо результат
    if (lenght < 8 || types < 2){
        std::cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << std::endl;
    } else{
        std::cout << "Мінімальні вимоги: ПРОЙДЕНО" << std::endl;
    }
    //Перевірка на 1 рівень надійності
    if (lenght < 6){
        std::cout << "Рівень надійності: 1 - Дуже слабкий" << std::endl;
        level = 1;
    //Перевірка на 2 рівень надійності
    } else if (lenght < 8 || types == 0){
        std::cout << "Рівень надійності: 2 - Cлабкий" << std::endl;
        level = 2;
    //Перевірка на 3 рівень надійності
    } else if (types == 1){
        std::cout << "Рівень надійності: 3 - Середній" << std::endl;
        level = 3;
    //Перевірка на 5 рівень надійності
    } else if (types == 3 && lenght >= 12){
        std::cout << "Рівень надійності: 5 - Дуже надійний" << std::endl;
        level = 5;
    //Перевірка на 4 рівень надійності
    } else {
        std::cout << "Рівень надійності: 4 - Надійний" << std::endl;
        level = 4;
    }

    //вивід вказівок та рекомендацій щодо пароля
    switch (level)
    {
    //вказівка для 1 рівня надійності
    case 1:
        std::cout << "Пароль надто короткий. Мінімум 8 символів" << std::endl;
        break;
    //вказівка для 2 рівня надійності
    case 2:
        std::cout << "Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи" << std::endl;
        break;
    //вказівка для 3 рівня надійності
    case 3:
        std::cout << "Додайте ще один тип символів або збільште довжину до 12" << std::endl;
        break;
    //вказівка для 4 рівня надійності
    case 4:
        std::cout << "Хороший пароль. Для максимуму 12+ символів і всі три типи символів" << std::endl;
        break;
    //вказівка для 5 рівня надійності
    case 5:
        std::cout << "Відмінно. Змінювати нічого не потрібно" << std::endl;
        break;
    //default, якщо програма працює помилково
    default:
        break;
    }
    //Перевірка та виведення попередження
    if (_isNumbers == 'n' && _isSymbols == 'n'){
        std::cout << "Попередження: пароль тільки з літер підбирається швидше" << std::endl;
    }
    
}