/*Задача 0521
Євро 2012 уже в Україні. А саме в чотирьох містах: Львові, Києві, Донецьку та Харкові. І як ви, мабуть, знаєте, Зеник дуже любить дівчат. 
І в кожному із цих чотирьох міст в Зеника є різна кількість дівчат. 
Зеник знає, що для перегляду матчів Євро 2012 він відвідає всі чотири міста, і, звісно ж, не проґавить можливості зустрітися з усіма можливими знайомими дівчатами.

Як справжній джентльмен, він не може приїхати в гості з порожніми руками, тому вирішив купити кожній дівчинці по сувеніру. 
І просить вас порахувати, скільки ж сувенірів йому прийдеться купити?

Вхідні дані
У першому рядку задано чотири цілих числа — кількість дівчат у Львові, Києві, Донецьку та Харкові відповідно.

Вихідні дані
У єдиному рядку виведіть одне ціле число — кількість сувенірів, яку має купити Зеник.*/

#include <iostream> 

using namespace std;

int main() {
    
    int n1, n2, n3, n4;
    
    cin >> n1 >> n2 >> n3 >> n4;
    
    cout << n1+n2+n3+n4;
    
    return 0;
}