/*Задача 0011
Зібралися Зеник і Марічка разом з пластунами в похід. Похід — серйозна справа. Потрібно запастись продуктами харчування та розподілити їх споживання по днях так, щоб всім вистачило. 
Цього разу Зеник слідкує за тим, щоб печива вистачило аж до останнього дня походу. Зеник чітко знає, скільки пачок печива повинно залишитись кожного дня, і щовечора перераховує їх. 
Якщо Зеник побачить, що залишилось менше пачок, ніж повинно залишитись за його розрахунками, він неодмінно знайде того, хто з’їв забагато печива, і покарає його.

Марічка дуже любить печиво. Сьогодні, коли всі пластуни покинуть свої намети і підуть купатися в річку, Марічка планує непомітно з’їсти трохи печива. 
Звісно, Марічка не хоче бути покараною і дуже боїться, щоб Зеник не помітив пропажу.

Марічка підгледіла, скільки пачок печива є в рюкзаку Зеника. Також вона знає, скільки штук в кожній пачці. 
Марічці не терпиться дізнатися, скільки ж печива вона зможе з’їсти так, щоб Зеник не помітив. Зеник помітить пропажу печива з деякої пачки тоді і тільки тоді, коли Марічка повністю спустошить її.

Вхідні дані
У першому рядку задано одне натуральне число 𝑛 — кількість пачок печива.

У другому рядку задано 𝑛 натуральних чисел 𝑎𝑖 — кількість штук печива в 𝑖-й пачці.

Вихідні дані
У єдиному рядку виведіть одне ціле число — максимальну кількість штук печива, яку зможе з’їсти Марічка так, щоб Зеник не помітив цього.*/


#include <iostream>

using namespace std;

int main(){
    
    int n;
    long long sum = 0;
    cin >> n;
    
    for(int i = 0; i < n; i++){
        long long cookies;
        cin >> cookies;
        sum += (cookies-1);      
    }
    cout << sum;
    
    return 0;
}


