/*Задача 0481
Діти міряються різними речима. У нашій задачі — апельсинами. Марічка і Софійка міряються з Петриком.

Потрібно визначити, чи Марічка й Софійка разом мають більше апельсинів, ніж Петрик.

Вхідні дані
У першому і єдиному рядку задано три цілі числа 𝑎, 𝑏 та 𝑐 — кількість апельсинів у Марічки, Софійки і Петрика відповідно.

Вихідні дані
У єдиному рядку виведіть відповідь до задачі — YES, якщо дівчата разом мають більше апельсинів, ніж Петрик, або NO в іншому випадку.*/

#include <iostream>

using namespace std;

int main(){
    
    long a, b, c;
    cin >> a;
    cin >> b;
    cin >> c;
    
    if( (a+b) > c ){
        cout << "YES";
    }
    else{
        cout << "NO";
    }
    
    return 0;
}

