/*  
Лабораторна робота завдання 2
Ярошенко Володимир 
11 група 
*/
#include <iostream>

using namespace std;

int main() {
int n; 
int m;
cout << "Введіть n та m: ";
cin >> n >> m;
int res1 = n++ -m; // обчислюєм значення першого виразу, використовуєм постфіксні та префіксні операції 
bool res2 = m-- >n;// обчислюєм значення другого виразу, використовуєм постфіксні та префіксні операції
bool res3 = n++ >m;// обчислюєм значення третього виразу, використовуєм постфіксні та префіксні операції
cout <<  "n++ - m = "<< res1 << endl;
cout << boolalpha ; // використувуєм boolalpha щоб вивести не числові а словесні значення 
cout << "m-- >n = " << res2 << endl;
cout << "n++ >m = " << res3 << endl; 
cout << n << ' ' << m << endl; // виводим кінцеві значення n та m
return 0;
}
