/*
Олексійчук Захар
Найбільша зростаюча підпослідовність
Вам задано послідовність із 𝑛 цілих чисел 𝑎𝑖. Ваша задача — знайти довжину найбільшої зростаючої підпослідовності заданої послідовності. 
Послідовність 𝑥 називається підпослідовністю послідовності 𝑦, якщо з 𝑦 можна видалити деяку кількість елементів (можливо, нульову), щоб залишилась послідовність 𝑥.
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    int arr1[100] = {}; // масив всіх чисел
    int arr2[100] = {}; // масив розмірів послідовностей для кожного елемента
    int maxLen = 0;

    for (int i = 0; i < n; i++) {
        cin >> arr1[i];
    }
    
    for (int i = 0; i < n; i++) {
        arr2[i] = 1;
        for (int j = 0; j < i; j++) {
            if (arr1[j] < arr1[i]) {
                arr2[i] =  max(arr2[i], arr2[j]+1);
            }
        }
        maxLen = max(arr2[i], maxLen);
    }

    cout << maxLen << endl;
}