/*
Задача: Vaccine Capsule
Виконав: Афанасьєв Олексій (ШІ-14)
*/

/*
Умова:

Марічка та Зеник винайшли вакцину від реп’яховірусу!
Тепер нашим героям потрібно відправити їхню вакцину на перевірку в лабораторію. 
Для цього потрібно взяти сферичну капсулу, наповнити її вакциною, запакувати цю капсулу в ящик
і відправити поштою. У Зеника давно в підвалі завалявся ящик розміром 𝑎 ×𝑏 ×𝑐 метрів. 
Це чудова нагода його використати! Залишилося купити сферичну капсулу для вакцини. Але якого ж розміру капсулу купувати?
Допоможіть Зенику та Марічці знайти максимальний діаметр капсули для вакцини, що поміститься в їхній ящик.
*/

#include <cmath>
#include <iostream>

using namespace std;

int main()
{
    int a, b, c;

    cin >> a >> b >> c;

    int min = a;
    if (b < min)
    {
        min = b; 
    }
    if (c < min)
    {
        min = c;
    }

    cout << min;
    return 0;
}
