/*Максимум
Обмеження: 2 сек., 256 МіБ

Написати програму, яка знаходить значення найбільшого елемента масиву.

Вхідні дані
У першому рядку задано одне натуральне число 𝑛 — розмір масиву.

У другому рядку задано 𝑛 цілих чисел — елементи масиву.

Вихідні дані
У єдиному рядку виведіть одне ціле число — значення найбільшого елемента масиву.*/
#include<iostream>

using namespace std;

int main(){
   int n,a,max;
   cin>>n;
   cin>>max;

   for(int i=1; i<n; i++){
    cin>>a;
    if(a>max){
        max=a;
    }
   }
   cout<< max<<endl;
   return 0;
}
