/*
Лабораторна робота 1 варіант 21
Грабовенський Кирило
ШІ-13
task 2
*/
#include <iostream>

using namespace std;

int main()
{

	cout << "enter m\n"; // Запит на введення значення m
	double m; // Оголошення змінної m типу double
	cin >> m; // Зчитування m з клавіатури

	cout << "enter n\n"; // Запит на введення значення n
	double n; // Оголошення змінної n типу double
	cin >> n; // Зчитування n з клавіатури

	//обчислення виразу n++ - m

	double result_1 = (n++) - m; // Постфіксний інкремент: спочатку обчислюється різниця n - m, а потім n збільшується на 1

	cout << "result of action is " << result_1 << endl; // Виведення результату першої дії
	cout << "after (n++) - m" << endl << "n = " << n << endl << "m = " << m << endl; // Виведення поточних значень n та m після інкременту

	//обчислення виразу m-- > n

	bool result_2 = m-- > n; // Постфіксний декремент: спочатку перевіряється умова m > n, а потім m зменшується на 1

	if (result_2 == 1) // Перевірка, чи результат порівняння є істинним (true)
	{
		cout << "result of action is true\n"; // Виведення повідомлення про успішну умову
	}

	if (result_2 == 0) // Перевірка, чи результат порівняння є хибним (false)
	{
		cout << "result of action is false\n"; // Виведення повідомлення про хибну умову
	}

	cout << "after (m--) > n" << endl << "n = " << n << endl << "m = " << m << endl; // Виведення поточних значень n та m після декременту

	//обчислення виразу n-- >m


	bool result_3 = n-- > m; // Постфіксний декремент: спочатку перевіряється умова n > m, а потім n зменшується на 1

	if (result_3 == 1) // Перевірка, чи результат порівняння істинний
	{
		cout << "result of action is true\n"; // Виведення повідомлення про істинність умови
	}


	if (result_3 == 0) // Перевірка, чи результат порівняння хибний
	{
		cout << "result of action is false\n"; // Виведення повідомлення про хибність умови
	}

	cout << "after (n--) > m" << endl << "n = " << n << endl << "m = " << m << endl; // Фінальне виведення значень n та m після всіх операцій
}