/* 
Епік 1. Практичне завдання: Автономність портативної зарядної станції.
Авторка: Дячок Маргарита.
Група: ШІ-14.
*/


#include <iostream> // Для вводу і виводу
#include <iomanip> // Для форматування
#include <cmath> // Для степеня
#include <string> // Для роботи з текстовими рядками
#include <clocale> // Для кирилиці

int main() {
    std::setlocale(LC_ALL, "uk_UA.UTF-8"); // Додаємо кирилицю
    
const double minuts_in_hour = 60.0;
const double capacity_annual_loss = 0.02; // щорічна втрата ємності акамулятора, що становить 2% від початкової ємності.
const double full_capacity = 100.0; // повна ємність акамулятора (100%)

    std::cout << "Модель станції \n (до 31 символа та без пробілів): ";
    std::string model; //назва моделі

    //Перевірка назви моделі на допустимі значення
    std::getline(std::cin, model); //зчитати весь рядок
    for (char c : model) { //посимвольна перевірка на пробіл
        if (c == ' ') { //якхо серед символів знайдено пробіл, то помилка
            std::cout << "Помилка: назва моделі містить пробіли.";
            return 1; //програма закінчилп роботу
        }
    
    } 
    //якщо пробілів не виявлено, перевіряємо на кількість символів
    if (model.length() > 31) { 
        std::cout << "Помилка: назва моделі перевищує допустиму довжину на " << model.length() - 31 << " символів." << std::endl;
        return 1;
    }
   

    
    
    std::cout << "Назва моделі збережена.\n";
    std::cout << "Введіть наступні дані:\n";
    std::cout << "1. Паспортна ємність (Вт*год): \n";
    double C;
    std::cin >> C;
    /*Перевірка значення паспортної ємності на допустимі значення.
    Користувач матиме змогу вводити дані повторно, поки не введе значення,
    що задовольняє умову (і так з усіма наступними вводами від користувача)*/
    while (C <= 0) {
        std::cout << "Помилка: паспортна ємність не може бути відʼємною.\n";
        std::cout << "Будь ласка, спробуйте ще раз.\n";
        std::cin >> C;
    }

    std::cout << "2. Вік станції (років): \n";
    short years;
    std::cin >> years;
    //Перевірка значення віку станції на допустимі значення
    while (years < 0 || years > 20) {
        std::cout << "Помилка: вік станції повинен бути в межах від 0 до 20 років.\n";
        std::cout << "Будь ласка, спробуйте ще раз.\n";
        std::cin >> years;
    }

    std::cout << "3. Рівень заряду (%): \n";
    short charge;
    std::cin >> charge;
    //Перевірка значення рівня заряду на допустимі значення
    while (charge <= 0 || charge > 100) {
        std::cout << "Помилка: % заряду повинен бути в межах від 0 до 100.\n";
        std::cout << "Будь ласка, спробуйте ще раз.\n";
        std::cin >> charge; //даємо користовачу змогу ввести значення ще раз
    }

    std::cout << "4. ККД інвертора (%): \n";
    double eff;
    std::cin >> eff;
    //Перевірка значення ККД інвертора на допустимі значення
    while (eff <= 0 || eff > 100) {
        std::cout << "Помилка: % ККД інвертора повинен бути в межах від 0 до 100.\n";
        std::cout << "Будь ласка, спробуйте ще раз.\n";
        std::cin >> eff;
    }

    std::cout << "5. Потужність приладу (Вт): \n";
    double P;
    std::cin >> P;
    //Перевірка значення потужності приладу на допустимі значення
    while (P <= 0) {
        std::cout << "Помилка: потужність приладу має бути додатною.\n";
        std::cout << "Будь ласка, спробуйте ще раз.\n";
        std::cin >> P;
    }

    std::cout << "Йде розрахунок часу роботи портативної зарядної станції...\n";

    //За формулами обраховуємо необхідні величини
    double  C_eff;
    // Розрахунок фактичної ємності акмулятора з урахуванням віку.
    C_eff = C * std::pow(1.0 - 2.0 / 100.0, years);

    double E_stored;
    // Розрахунок запасу енергії при поточному заряді.
    E_stored = C_eff * charge / 100.0; 

    double E_useful;
    // Розрахунок корисної енергії, що дійде до приладу.
    E_useful = E_stored * eff / 100.0;

    double E_loss;
    // Розрахунок втрат на перетворення напруги.
    E_loss = E_stored - E_useful;

    double T;
    // Розрахунок часу роботи.
    T = E_useful / P;

    int h;
    // Шукаємо цілу частину від часу роботи.
    h = int(T);

    int m;
    // Шукаємо залишок хвилин від часу роботи.
    m = int((T-h) * minuts_in_hour);


    std::cout << "Розрахунок завершено.\n";

    //Виводимо результат роботи програми
    std::cout << std::fixed;
    std::cout << "Модель станції:                         " << model << ". \n";
    std::cout << "Паспортна ємність:                      " << C << " Вт*год. \n";
    std::cout << "Вік станції:                            " << int(years) << " років. \n";
    std::cout << "Фактична ємність з урахуванням віку:    " << std::setprecision(1) << C_eff << " Вт*год. \n";
    std::cout << "Рівень заряду:                          " << int(charge) << "%. \n";
    std::cout << "ККД інвертора:                          " << std::setprecision(2) << eff << "%. \n";
    std::cout << "Запас енергії:                          " << std::setprecision(1) << E_stored << " Вт*год.\n";
    std::cout << "Корисна енергія:                        " << std::setprecision(1) << E_useful << " Вт*год.\n";
    std::cout << "Втрати енергії на перетворення напруги: " << std::setprecision(1) << E_loss << "Вт*год\n";
    std::cout << "Час роботи в годинах:                   " << std::setprecision(2) << T << " год.\n";
    std::cout << "Час роботи (год, хв):                   " << h << " год. " << std::setfill('0') << std::setw(2) << m << " хв.\n";


    
    return 0;
}