/*
Коля, Вася і Теніс, Артем Момоток, ШІ-13
*/
#include <iostream>
#include <cmath>

using namespace std;

int main() {

    // Кількість символів у послідовності
    int n;
    cin >> n;

    // Кількість виграних партій для кожного гравця
    int gameK = 0, gameV = 0;

    // Поточні очки в поточній партії    
    int pointK = 0, pointV = 0;

    // Рядок із символами 'K' і 'V'
    string c;
    cin >> c;

    // Проходимо по всіх символах рядка
    for (int i = 0; i < n; i++) {
        
        // Якщо символ - 'K', додаємо очко гравцю Коля
        if (c[i] == 'K') {
            pointK++;

        // Інакше додаємо очко гравцю Вася
        } else {
            pointV++;
        }

        // Перевіряємо, чи хтось виграв партію; партія виграється, якщо гравець набрав щонайменше 11 очок і має перевагу щонайменше 2 очки
        if ((pointK >= 11 || pointV >= 11) && abs(pointK - pointV) >= 2) {
            
            // Якщо Коля виграв партію
            if (pointK > pointV) {
                gameK++;

            // Якщо Вася виграв партію
            } else {
                gameV++;
            }
            // Скидаємо очки для наступної партії
            pointK = 0;
            pointV = 0;
        }
    }

    // Виводимо кількість виграних партій для кожного гравця
    cout << gameK << ":" << gameV << endl;

    // Якщо після завершення всіх партій залишилися очки, виводимо їх
    if (pointK > 0 || pointV > 0) {
        cout << pointK << ":" << pointV << endl;
    }

    return 0;
}