/*               Аналізатор надійності пароля.
                Виконав: Айзенберг Павло, ШІ-11                 */

#include <iostream>
using namespace std;

int main(){

    //Ініціалізуємо змінні.

    int level;
    int len;
    char digit;
    char capital;
    char symbols;

    // Зчитуємо довжину пароля та задаємо рамки вводу

    cout << "Введіть довжину пароля: ";

    if (!(cin >> len) || (len < 1  || len > 64)){
        cout << "Помилка! Довжина має бути від 1 до 64." << endl;
        return 1;
    }

    // Зчитуємо наявність цифр та задаємо рамки вводу

    cout << "Чи містить пароль цифри? y/n: ";

    if (!(cin >> digit) || (digit != 'y' && digit != 'n')){
        cout << "Помилка! Хибний ввід." << endl;
        return 1;
    }

    // Зчитуємо наявність великих літер та задаємо рамки вводу

    cout << "Чи містить пароль великі літери? y/n: ";

    if (!(cin >> capital) || (capital != 'y' && capital != 'n')){
        cout << "Помилка! Хибний ввід." << endl;
        return 1;
    }

    // Зчитуємо наявність спеціальних символів та задаємо рамки вводу

    cout << "Чи містить пароль спеціальні символи? y/n: ";

    if (!(cin >> symbols) || (symbols != 'y' && symbols != 'n')){
        cout << "Помилка! Хибний ввід." << endl;
        return 1;
    }
    
    // Вираховуємо кількість спеціальних символів через представлення булевих значень у 0 або 1

    int symbols_count = int(digit == 'y') + int(capital == 'y') + int(symbols == 'y');

    cout << "=----------------------=" << endl;

    // Перевіряємо чи виконано мінімальні вимоги і виводимо повідомлення на екран

    if ((len < 8) || (symbols_count < 2)){
        cout << "Мінімальні вимоги не виконано. ";
    }
    else{
        cout << "Пароль прийнято. " << endl;
    }

    //---------------------------------------------------------------------------------------------

    // Визначаємо рівень надійності за умовами

    if (len < 6){
        level = 1;
        cout << "Рівень надійності: 1 - Дуже слабкий." << endl;
    }
    else if (len < 8 || symbols_count == 0){
        level = 2;
        cout << "Рівень надійності: 2 - Слабкий." << endl;
    }
    else if (symbols_count == 1){
        level = 3;
        cout << "Рівень надійності: 3 - Середній." << endl;
    }
    else if (len >= 12 && symbols_count == 3) {
        level = 5;
        cout << "Рівень надійності: 5 - Дуже надійний." << endl;
    }
    else {
        level = 4;
        cout << "Рівень надійності: 4 - Надійний." << endl;
    }
    
    // Переходимо до switch-case конструкції і виводимо повідомлення в залежності від значення level, вирахованого рівнем вище

    switch (level){
        case 1:
        cout << "Рекомендація: Пароль надто короткий. Мінімум 8 символів." << endl;
        break;

        case 2:
        cout << "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl;
        break;

        case 3:
        cout << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12" << endl;
        break;

        case 4:
        cout << "Рекомендація: Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl;
        break;

        case 5:
        cout << "Рекомендація: Відмінно. Змінювати нічого не потрібно." << endl;
        break;

        default:
        break;
    }

    // Виводимо попередження, якщо потрібно

    if(digit == 'n' && symbols == 'n'){
        cout << "Попередження: Пароль тільки з літер підбирається швидше." << endl;
    }

    return 0;
}