/*Epic 2 - Аналізатор надійності пароля
Чернихівський Максим
Ші - 14*/

#include <iostream>

using namespace std;

int main(){
    int type_amount = 0;  // Лічильник кількості додаткових типів символів (цифри, великі літери, спеціальні символи)

    // Введення та валідація довжини пароля
    cout << "Довжина пароля: ";
    int length;
    if (!(cin >> length && length > 0 && length <= 64)) {cout << "Помилка: довжина мусить бути від 1 до 64."; return 1;} else {}

    // Питання щодо наявності цифр у паролі та валідація відповіді
    cout << "Чи є цифри (y/n): ";
    string numbers;
    if (cin >> numbers && (numbers == "y" || numbers == "n")) {
        if (numbers == "y") {type_amount += 1;} 
    } else {cout << "Помилка: використовуйте тільки y або n"; return 1;}

    // Питання щодо наявності великих літер у паролі та валідація відповіді
    cout << "Чи є великі літери (y/n): ";
    string capital;
    if (cin >> capital && (capital == "y" || capital == "n")) {
        if (capital == "y") {type_amount += 1;} 
    } else {cout << "Помилка: використовуйте тільки y або n"; return 1;}

    // Питання щодо наявності спеціальних символів у паролі та валідація відповід
    cout << "Чи є спеціальні символи (y/n): ";
    string special;
    if (cin >> special && (special == "y" || special == "n")) {
        if (special == "y") {type_amount += 1;} 
    } else {cout << "Помилка: використовуйте тільки y або n"; return 1;}

    // Визначення рівня надійності пароля
    int level = 0;
    if (length < 6)
        level = 1;
    else if (length < 8 || type_amount == 0)
        level = 2;
    else if (type_amount == 1)
        level = 3;
    else if (length >= 12 && type_amount == 3)
        level = 5;
    else
        level = 4;

    // Виведення результатів та рекомендацій залежно від розрахованого рівня надійності
    switch (level)
    {
        case 1:
            cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << endl;
            cout << "Рівень надійності: 1 - Дуже слабкий" << endl;
            cout << "Рекомендація: Пароль надто короткий. Мінімум 8 символів." << endl;
            break;
        case 2:
            cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << endl;
            cout << "Рівень надійності: 2 - Слабкий" << endl;
            cout << "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl;
            break;
        case 3:
            cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО" << endl;
            cout << "Рівень надійності: 3 - Середній" << endl;
            cout << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12." << endl;
            break;
        case 4:
            cout << "Мінімальні вимоги: ПРОЙДЕНО" << endl;
            cout << "Рівень надійності: 4 - Надійний" << endl;
            cout << "Рекомендація: Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl;
            break;
        case 5:
            cout << "Мінімальні вимоги: ПРОЙДЕНО" << endl;
            cout << "Рівень надійності: 5 - Дуже надійний" << endl;
            cout << "Рекомендація: Відмінно. Змінювати нічого не потрібно." << endl;
            break;
        default:
            cout << "Виникла невідома помилка." << endl;
            return 1;
            break;
    }
    // Якщо пароль складається виключно з літер виводиться попередження
    if (numbers == "n" && special == "n") {cout << "Попередження: пароль тільки з літер підбирається швидше." << endl;} else {}

    return 0;
}