#include <iostream>
#include <cmath>

using namespace std;
int main()
{
    /*
    назва завдання: Автономність портативної зарядної станції
    автор: Пилипець Остап
    група: ШІ - 12
    
    */
    string stationModel;
    int  years, charge, power, hours, minutes;
    double eff,c_eff,ratedCapacity, e_stored, e_useful, e_loss,time;
    const double ratedcapacityExp = 0.02; //відсоток втрати ємності за рік

    cout <<"Введіть модель станції. Введіть одне слово без пробілів не більше 31 симовла: ";
    cin  >> stationModel;
    if (stationModel.length() > 31){ //перевірка на довжину рядка
        cout <<"Помилка";
        return 1;
    }
    cout <<"Введіть паспортну ємність моделі. Число повинно бути цілим та більшим за 0: ";
    cin  >> ratedCapacity;
    if (ratedCapacity <= 0){ //паспортна ємність не може бути менша або рівна нулю
        cout <<"Помилка";
        return 1;
    }
    cout << "Введіть вік станції. Число має бути цілим від 0 до 20: ";
    cin  >> years;
    if (years < 0 || years > 20){ //перевіряємо вік станції, 
        cout <<"Помилка";
        return 1;
    }
    cout <<"Введіть рівень заряду станції. Число повинно бути цілим від 0 до 100: ";
    cin >> charge;
    if (charge < 0 || charge > 100){ // зарядка повинна бути від 0 до 100
        cout <<"Помилка";
        return 1;
    }
    cout << "Введіть ККД інвертора від 0 до 100: ";
    cin >> eff;
    if (eff <= 0 || eff >100){ // ККД не може бути 0 або менше, також не може бути більшим за 100
        cout <<"Помилка";
        return 1;
    }
    cout <<"Яка потужність приладу? Введіть число більше 0: ";
    cin >> power;
    if (power < 0){// потужність не може бути менше 0
        cout <<"Помилка";
        return 1;
    }
    //обчислюємо фактичну ємність Вт*год. Враховуємо втрату ємності
    c_eff = ratedCapacity * pow(1 - ratedcapacityExp, years);
    //обчислюємо запас енергії при поточній зарядці
    e_stored = c_eff * charge / 100;
    //рахуємо корисну енергію, ка доходить до приладу
    e_useful = e_stored * eff / 100;
    //обчислюємо втрати енергії на перетворенні
    e_loss = e_stored - e_useful;
    //обчилюємо скільки часу працюватиме станція
    time = e_useful / power ;
    //беремо цілу частину від часу роботи
    hours = trunc(time);
    //рахуємо хвилини що залишились
    minutes = trunc((time - hours) * 60);

    // виводимо результати
    cout << "Модель станції:             " << stationModel << endl;
    cout << "Паспортна ємність:          " << ratedCapacity << " Вт*год" << endl;
    cout << "Вік станції:                " << years << " р." << endl;
    /* число яке потрібно округлити до десятків множимо на 10, округляємо, 
    а потім ділимо на 10, щоб отримати одне десяткове число.
     Я використовую це в декількох рядках*/
    cout << "Фактична ємність:           " << round(c_eff*10)/10 << " Вт*год" << endl;
    cout << "Рівень заряду:              " << charge << "%" << endl;
    cout << "ККД інвентора:              " << eff << "%" << endl;
    cout << "Запас енергії:              " << round(e_stored*10)/10 << " Вт * год" << endl;
    cout << "Корисна енергія:            " << round(e_useful*10)/10 << " Вт*год" << endl;
    cout << "Втрати на перетворенні:     " << round(e_loss*10)/10 <<" Bт*год" << endl;
    cout << "Час роботи:                 " << hours << " годин " << minutes << " хвилини" << endl;
   
    return 0;
}