/*Автономність портативної зарядної станції
Автор: Шведько Юлія
Група: ШІ-11*/

#include <iostream>
#include <string>
#include <iomanip>
#include <cmath>

using namespace std;

int main()
{
    string model; //Модель станції
    bool space = false;
    cout << "Модель станції: ";// Ввід моделі станції
    getline(cin, model);

    for (int a = 0; a < model.length(); a++)
    {
        if (model[a] == ' ')
        {
            space = true;
        }
    }

    if (model.length() > 31 || space)// Перевірка на допустимі значення
    {
        cout << "Назва станції має бути не довше 31 символа і не містити пробілів!" << endl;
        return 1;
    }

    double C;// Паспортна ємність, Вт*год
    cout << "Паспортна ємність(Вт*год): ";// Ввід паспортної ємності
    cin >> C;
    if(C<=0)// Перевірка на допустимі значення
    {
        cout << "Паспортна ємність має бути більше 0!" << endl;
        return 1;
    }

    int years;//Вік станції, р.
    cout << "Вік станції(років): ";//Ввід віку станції
    cin >> years;
    if(years<0 || years>20)// Перевірка на допустимі значення
    {
        cout << "Вік станції має бути від 0 до 20 років!" << endl;
        return 1;
    }

    int charge;// Рівень заряду, %
    cout << "Рівень заряду(%): ";//Ввід рівня заряду
    cin >> charge;
    if(charge<0 || charge>100)// Перевірка на допустимі значення
    {
        cout << "Рівень заряду має бути від 0 до 100 %!" << endl;
        return 1;
    }

    double eff;// ККД інвертора, %
    cout << "ККД інвентора(%): ";// Ввід ККД інвертора
    cin >> eff;
    if(eff<0 || eff>=100)// Перевірка на допустимі значення
    {
        cout << "ККД інвентора має бути більше 0 та не більше 100 %!" << endl;
        return 1;
    }

    double P;// Потужність приладу, Вт
    cout << "Потужність приладу(Вт): ";//Ввід потужності приладу
    cin >> P;
    if(P<=0)// Перевірка на допустимі значення
    {
        cout << "Потужність приладу має бути більше 0!" << endl;;
        return 1;
    }

    cout << endl;
    
    double C_eff = pow(1-2.0/100, years)*C;// Обчислюємо фактичну ємність з урахуванням віку, Вт*год
    double E_stored = C_eff * charge / 100;// Обчислюємо запас енергії при поточному заряді, Вт*год
    double E_useful = E_stored * eff / 100;// Обчислюємо корисну енергію що дійде до приладу, Вт*год
    double E_loss = E_stored - E_useful;// Обчислюємо втрати на перетворенні напруги, Вт*год
    double T = E_useful / P;// Обчислюємо загальний час роботи, год
    int h = T;// Обчислюємо скільки повних годин працював
    int m = (T-h)*60;// Обчислюємо скільки хвилин залишилося

    //Виводимо значення з необхідною точністю
    cout << "Модель станції: " << model << endl;
    cout << "Паспортна ємність: " << fixed << setprecision(1) << C << " Вт*год" << endl;
    cout << "Вік станції: " << years << " р." << endl;
    cout << "Фактична ємність: " << C_eff << " Вт*год" << endl;
    cout << "Рівень заряду: " << charge << " %" << endl;
    cout << "ККД інвентора: " << fixed << setprecision(2) << eff << " %" << endl;
    cout << "Запас енергії: " << fixed << setprecision(1) << E_stored << " Вт*год" << endl;
    cout << "Корисна енергія: " << E_useful << " Вт*год" << endl;
    cout << "Втрати на перетворенні: " << E_loss << " Вт*год" << endl;
    cout << "Час роботи: " << fixed << setprecision(2) << T << " год = " << h << " год " << setfill('0') << setw(2) << m << " хв" << endl;

    return 0;
}