/*
Task: lab 1 task 2 option 10
Name: Vasyl Yakubovskyi
Group: ШІ-14(II)
*/
#include <iostream>
#include <cmath>

using namespace std;
int main (){
    setlocale(LC_ALL, "uk_UA"); 


    //створюємо дві змінні та просимо користувача ввести їхнє значення
    int n = 0;
    cout << "Введіть ціле значення n: ";
    cin >> n;

    int m = 0;
    cout << "Введіть ціле значення m: ";
    cin >> m;

    //Виконуємо операції 

    cout << "====================РЕЗУЛЬТАТ===================" << endl;
    cout << endl;

    cout << "================ Операція №1 (n-- -m) ==========" << endl;
    cout << "Вхідні значеня до обчислення: n = " << n << " " << "m = " << m << endl;
    n--; //зменшує число на 1
    int operation1 = n-m; 
    cout << "Значення після обчислення: n = " << n << " " << "m = " << m <<endl;
    cout << "Результат обчислень: "<< operation1 << endl;


    cout << endl;
    cout << "=============== Операція №2 (m-- < n) ==========" << endl;
    cout << "Вхідні значеня до обчислення: n = " << n << " "  << "m = " << m <<endl;
    m--;  //зменшує число на 1
    cout << "Значення після обчислення: n = " << n << " " << "m = " << m << endl;
    // робимо перевірку на вірність виразу
    if(m < n){
    cout << "Чи вірний вираз №2 m-- < n - true" << endl;
    }else{
        cout << "Чи вірний вираз №2 m-- < n - false" << endl;
    }

    cout << endl;
    cout << "=============== Операція №3 (n++ > m) ==========" << endl;
    cout << "Вхідні значеня до обчислення: n = " << n << " "  << "m = " << m <<endl;
    n++; //збільшує вираз на 1
    cout << "Значення після обчислення: n = " << n << " " << "m = " << m <<endl;

     // робимо перевірку на вірність виразу
    if(n > m){
    cout << "Чи вірний вираз №3 n++ > m - true" << endl;
    }else{
        cout << "Чи вірний вираз №3 n++ > m - false" << endl;
    }

    return 0;
}
