/*Автономність портативної зарядної станції (Белаш Матвій Валерійович ШІ-12) */

#include <iostream> //додає можливість працювати з вводом у консоль та виводом на екран (cin, cout, endl)
#include <string> //дозволяє створювати та обробляти текстові змінні
#include <cmath> //містить математичні функції, зокрема pow() для піднесення до степеня
#include <iomanip> //дає інструменти для гарного форматування тексту та чисел
#include <windows.h> // дозволяє писати українською 

using namespace std;
int main() {

    SetConsoleCP(65001);       // Встановлює UTF-8 для вводу з клавіатури
    SetConsoleOutputCP(65001); // Встановлює UTF-8 для виводу в консоль

    string model; // робимо комірку для назви станції
    int years; // комірка з цілим числом для віку станції
    int charge; // комірка з цілим числом для рівня заряду
    double P;   //комірка з дробовим числом для потужності приладу

    const double DEGRADATION_RATE = 2.0; // константа, що визначає щорічне зниження ємності станції на 2%

    cout << "Введіть назву (модель) станції:"; // просимо користувача ввести назву станції
    getline(cin, model); // зчитуємо введену назву станції
    if (model.length() > 31) { // перевіряємо, чи не перевищує довжина назви 31 символ
    cout << "Помилка: назва моделі мусить бути не довше 31 символа!" << endl; // якщо перевищує, виводимо повідомлення про помилку
    return 0;
    }

    if (model.find(' ') != string::npos) { // перевіряємо, чи містить назва пробіли
    cout << "Помилка: назва моделі не повинна містити пробілів!" << endl; // якщо містить, виводимо повідомлення про помилку
    return 0;
    }

    string input_C; // робимо комірку для введення ємності станції
    cout << "Паспортна ємність, Вт·год (максимум один знак після коми): "; // просимо користувача ввести паспортну ємність станції
    cin >> input_C; 

    size_t dot_pos = input_C.find('.'); // знаходимо позицію крапки у введеному рядку
    if (dot_pos == string::npos) { // перевіряємо, чи є крапка у введеному рядку
    cout << "Помилка: це не має бути текст та обов'язково має бути знак після крапки (наприклад .0)!" << endl; // якщо крапки немає, виводимо повідомлення про помилку
    return 0;
    }

    if (input_C.length() - dot_pos - 1 != 1) { // перевіряємо, чи є лише один знак після крапки
        cout << "Помилка: можна ввести максимум 1 знак після крапки!" << endl; // якщо більше одного знака після крапки, виводимо повідомлення про помилку
        return 0;
    }

    double C = stod(input_C); // перетворюємо введений рядок на число з плаваючою комою

    if (C <= 0 || C > 100000) { // перевіряємо, чи є введене число більше 0 і не більше 100 000
        cout << "Помилка: паспортна ємність мусить бути більше 0 і не більше 100 000 Вт·год!" << endl; // якщо не відповідає умові, виводимо повідомлення про помилку
        return 0;
    }

    cout << "Вік станції, років (від 0 до 20):";// просимо користувача ввести вік станції
    cin >> years;  // зчитуємо введений вік станції
    if (years < 0 || years > 20 ) { // перевіряємо, чи є введене число більше або рівне 0 і не більше 20
        cout << "Помилка." << endl; // якщо не відповідає умові, виводимо повідомлення про помилку
        return 0;
    }

    if (years != (int)years) { // перевіряємо, чи є введене число цілим
    cout << "Помилка: вік станції мусить бути цілим числом!" << endl; // якщо не є цілим числом, виводимо повідомлення про помилку
    return 0; 
    }

    cout << "Початковий рівень заряду, % (від 0 до 100):"; // просимо користувача ввести початковий рівень заряду станції
    cin >> charge; // зчитуємо введений рівень заряду станції
    if (charge < 0 || charge > 100 ) { // перевіряємо, чи є введене число більше або рівне 0 і не більше 100
        cout << "Помилка." << endl; // якщо не відповідає умові, виводимо повідомлення про помилку
        return 0;
    }

    if (charge != (int)charge) { // перевіряємо, чи є введене число цілим
    cout << endl << "Помилка: рівень заряду мусить бути цілим числом!" << endl; // якщо не є цілим числом, виводимо повідомлення про помилку
    return 0;
    }

    string input_eff; // робимо комірку для введення ККД інвертора
    cout << "ККД інвертора, % (обов'язково з 2 знаками після крапки): "; // просимо користувача ввести ККД інвертора
    cin >> input_eff;

    size_t dot_pos_eff = input_eff.find('.'); // знаходимо позицію крапки у введеному рядку
    if (dot_pos_eff == string::npos) { // перевіряємо, чи є крапка у введеному рядку
        cout << "Помилка: обов'язково має бути крапка (наприклад .00)!" << endl; // якщо крапки немає, виводимо повідомлення про помилку
        return 0;
    }

    if (input_eff.length() - dot_pos_eff - 1 != 2) { // перевіряємо, чи є лише два знаки після крапки
        cout << "Помилка: після крапки має бути рівно 2 знаки!" << endl; // якщо більше або менше двох знаків після крапки, виводимо повідомлення про помилку
        return 0;
    }

    double eff = stod(input_eff); // перетворюємо введений рядок на число з плаваючою комою
    if (eff <= 0 || eff > 100.0) { // перевіряємо, чи є введене число більше 0 і не більше 100
        cout << "Помилка: ККД мусить бути більше 0 і не більше 100%!" << endl; // якщо не відповідає умові, виводимо повідомлення про помилку
        return 0;
    }

    double C_eff = C * pow(1-DEGRADATION_RATE/100, years); // обчислюємо фактичну ємність станції з урахуванням деградації
    double E_stored = C_eff * charge/100.0; // обчислюємо фактичну енергію, що зберігається в станції з урахуванням рівня заряду
    double E_useful = E_stored * eff/100.0; // обчислюємо корисну енергію, що може бути використана для живлення приладів з урахуванням ККД інвертора
    double E_loss = E_stored - E_useful; // обчислюємо втрати енергії на перетворенні напруги

    cout << "Потужність приладу, Вт: "; // просимо користувача ввести потужність приладу
    cin >> P; // зчитуємо введену потужність приладу
    if (P <= 0) { // перевіряємо, чи є введене число більше 0
        cout << "Помилка: потужність мусить бути більше 0." << endl; // якщо не відповідає умові, виводимо повідомлення про помилку
        return 0;
    }

    double T = E_useful/P; // обчислюємо час роботи станції відносно потужності приладу
    T = round(T*100.0)/100.0;// округлюємо час роботи до сотих

    int h = T; // отримуємо цілу частину часу роботи (години)
    int m = (T-h)*60; // отримуємо дробову частину часу роботи (хвилини)
    cout << "----------------------------------------" << endl;
    cout << "Модель станціЇ: " << model << endl;
    cout << "Фактична ємність: " << fixed << setprecision(1) << C_eff << " Вт * год" << endl;
    cout << "Корисна енергія: " << E_useful << " Вт * год" << endl;
    cout << "Втрати на перетворенні напруги: " << E_loss << " Вт * год" << endl;
    cout << "Час роботи: " << h << " годин " << m << " хвилин " << endl;
    cout << "----------------------------------------" << endl; // виводимо підсумкову інформацію про станцію та її роботу


}

