/*
Задача з алготестера, варіант 3 , Андрій Шикоряк 
Умова:
Lab 1v3
Limits: 1 sec., 256 MiB

Персонажу по одному дають сторони 5 кубів 𝑎1.⁢.5, з яких він будує піраміду.

Коли він отримує куб з ребром 𝑎𝑖 - він його ставить на існуючий, перший ставить на підлогу (вона безмежна).

Якщо в якийсь момент об’єм куба у руці (який будуть ставити) буде більший ніж у куба на вершині піраміди - персонаж програє і гра закінчується. Розмір усіх наступних кубів після програшу не враховується.

Тобто якщо 𝑎𝑖−1 <𝑎𝑖 - це програш.

Ваше завдання - сказати як закінчиться гра.

Input
5 цілих чисел 𝑎1..𝑎5 - сторони кубів

Output
Існуючі варіанти:

LOSS - якщо персонаж не зможе поставити куб.

WIN - якщо персонаж зможе поставити усі куби

ERROR - якщо сторона куба буде мати неможливу довжину, тобто 𝑎𝑖 <= 0

*/

#include <iostream>
using namespace std;

int main() 
{
    long long a1,a2,a3,a4,a5;
    cin >> a1;
    cin >> a2;
    cin >> a3;
    cin >> a4;
    cin >> a5;

    if (a1 <= 0) { cout << "ERROR"; return 0; }
    if (a2 <= 0) { cout << "ERROR"; return 0; }
    if (a2 > a1)  { cout << "LOSS";  return 0; }
    if (a3 <= 0) { cout << "ERROR"; return 0; }
    if (a3 > a2)  { cout << "LOSS";  return 0; }
    if (a4 <= 0) { cout << "ERROR"; return 0; }
    if (a4 > a3)  { cout << "LOSS";  return 0; }
    if (a5 <= 0) { cout << "ERROR"; return 0; }
    if (a5 > a4)  { cout << "LOSS";  return 0; }
    cout << "WIN";

    return 0;
}
// Результат Зараховано