// Lab 1,task 2, Андрій Шикоряк, ШІ-13, Варіант 6
#include <iostream>

#include <iomanip>
using namespace std;
int main()
{
    int m,n;
    
    cout << "Введіть значення m: ";
    cin >> m;
    cout << "Введіть значення n: ";
    cin >> n;
    cout << "\n";
    // 1 вираз m-++n;
    // спочатку, через пріоритетність, виконається постфіксний інкремент числа n, потім вкинається віднімання
    int result1 = m-++n;
    cout <<"Результат першої дії (m-++n): "<< result1 << endl;
    // 2 вираз ++m>--n
    // спочатку виконаєтся інкремент числа m потім дикремент числа n, після чого відбудеться порівняння
    bool result2 = ++m > --n;
    cout <<"Результат другої дії (++m > --n): "<< result2 << endl;
    //3 вираз --n<++m
    // спочатку виконаєтся дикремент числа n, потім інкремент числа m, після чого відбудеться порівняння
    bool result3 = ++n > --m;
    cout <<"Результат третьої дії(++n > --m): "<< result3 << endl;
    return 0;
}