#include <iostream>
using namespace std;
/*
    Умова:
    Зеник хоче підготуватись до інтерв’ю на роботу, але для цього йому потрібна шоколадка. 
    Шоколадка складається з 𝑛 на 𝑚 одинарних шоколадних квадратиків. Мама вчила Зеника постійно ділитися, а в 
    Зеника є рівно 𝑘 друзів. Скориставшись акцією, Зеник купив дві однакові шоколадки за ціною однієї, 
    тож він має намір поділити одну з шоколадок порівну між усіма друзями. Зеник може розрізати шоколадку вздовж і впоперек 
    між квадратиками скільки завгодно разів, але одинарні квадратики розрізати він не може. Чи вдасться йому розділити шоколадку 
    порівну між усіма друзями?

    Вхідні дані
    У єдиному рядку задані 3 цілі числа 𝑛, 𝑚, 𝑘 — розміри шоколадки та кількість друзів Зеника

    Вихідні дані
    Виведіть Yes, якщо Зеник зможе поділити шоколадку, та No, якщо не зможе.

*/

int main(){
    int n,m,k;
    cin >> n >> m >> k;
    if((n*m) % k == 0){
        cout << "Yes";
    }
    else{
        cout << "No";
    }

    return 0;
}