#include <iostream>
using namespace std;

/*
    Умова:
    Зеник дуже любить пити чай, адже це хороша профілактика від реп’яховірусу.

Зеник дуже відповідально ставиться до чаювання, а тому завжди дотримується строгих правил: він п’є чай кожної години, починаючи о 9-тій ранку та закінчуючи о 9-тій вечора, об’єм випитого чаю — завжди ціле число. До того ж, Зеник свято вірить, що для кращого ефекту всі різниці між об’ємами випитого чаю під час двох послідовних чаювань мають бути однаковими протягом усього дня. Тобто об’єми чаю, випитого протягом дня, мають утворювати арифметичну прогресію.

Щоранку Зеник прокидається та планує чаювання на цей день. Для цього він обирає два цілих числа 𝑎 — об’єм чаю, який потрібно випити о 9-тій годині ранку, та 𝑏 — об’єм чаю, який потрібно випити о 9-тій вечора.

Далі Зеник рахує, скільки ж чаю він вип’є сумарно за день, якщо дотримуватиметься всіх своїх правил? Ця щоденна процедура виснажує Зеника.

Чи зможете ви написати програму, яка допоможе йому в обчисленнях?

Вхідні дані
В одному рядку задано два цілих числа 𝑎 та 𝑏 — об’єми чаю, які треба випити о 9-ій годині ранку та вечора відповідно.

Вихідні дані
Якщо цілочисельної послідовності, що задовольняє всі вимоги не існує, то виведіть -1. Інакше виведіть ціле число — сумарний об’єм випитого за день чаю.
*/

int main(){
    long long a,b;
    cin >> a >> b;
    long long sum =0;
    if((b-a) % 12 == 0){
        sum +=13*(a+b)/2;
        cout << sum;
    }
    else{
        cout << -1;
    }
    
    return 0;
}
