/*
Lab 1v3

Персонажу по одному дають сторони 5 кубів 𝑎1.⁢.5, з яких він будує піраміду.
Коли він отримує куб з ребром 𝑎𝑖 - він його ставить на існуючий, перший ставить на підлогу (вона безмежна).
Якщо в якийсь момент об’єм куба у руці (який будуть ставити) буде більший ніж у куба на вершині піраміди - персонаж програє і гра закінчується. Розмір усіх наступних кубів після програшу не враховується.
Тобто якщо 𝑎𝑖−1 <𝑎𝑖 - це програш.
Ваше завдання - сказати як закінчиться гра.
*/

#include <iostream>
#include <cmath>

using namespace std;

int main() {
    double arr[5] = {};
    string result = "WIN";
    
    for (int i = 0; i < 5; i++) {
        cin >> arr[i];
        if (arr[i] <= 0) {
            result = "ERROR";
            break;
        }
        if (i >= 1) {
            if (arr[i] > arr[i-1]){
                result = "LOSS";
                break;
            }
            
        }
    }

    cout << result << endl;
    return 0;
}