/* Лабораторна робота N1(task 2)
Автор: Давидович Святослав
Група: ШІ-11
 */
#include <iostream>

using namespace std;

// запропоновані в завданні вирази
int op1(int n, int m){
    return m+--n;
}

bool op2(int n, int m){
    return m++<++n;
}

bool op3(int n, int m){
    return n--<--m;
}

// чому еквіваленті вирази(що фактично вони повертають)
int Eop1(int n, int m){
    return m + n - 1;
}

bool Eop2(int n, int m){
    return m < (n - 1);
}

bool Eop3(int n, int m){
    return n < (m - 1);
}

int main() {
    // будемо для наочності працювати з цілими числами
    int n,m;

    cout << "ціле число n: ";
    if (!(cin >> n)) return 1;

    cout << "ціле число m: ";
    if (!(cin >> m)) return 1;

    /* значення переданої змінної змінюється лише у локальній області функції,
    тому отримані при вводі значення n та m не зміняться в області видимості main при передачі як аргумент до наших функцій.*/
    cout << "Для даних n та m: " << endl;
    if (op1(n,m) == Eop1(n,m)){
        cout << "вираз m+--n логічно еквівалентний виразу m + n - 1" << endl;
    } else return 1;

    if (op2(n,m) == Eop2(n,m)){
        cout << "вираз m++<++n логічно еквівалентний виразу m < (n - 1)" << endl;
    } else return 1;

    if (op3(n,m) == Eop3(n,m)){
        cout << "вираз m+--n логічно еквівалентний виразу n < (m - 1)" << endl;
    } else return 1;

    // послідовне застосування операцій
    int act1 = m+--n;
    bool act2 = m++<++n;
    bool act3 = n--<--m;
    // використовуємо маніпулятор boolalpha для відображення булевих значень
    cout << boolalpha;
    cout << "значення операцій: \n1)" << act1 << "\n2)" << act2 << "\n3)" << act3 << endl;
    cout << "значення змінних n та m наприкінці: " <<  "\nn = " << n << "\nm = " << m << endl;
    cout << "пояснення: результати зумовлені приципом роботи постфіксних і префіксних інкремента та декремента:" << endl;
    cout << "при x++ чи x-- зміна значення не застосовується під час обчислення, при ++x чи --x - застосовується" << endl;
    
    return 0;
}