/* 
Аналізатор надійності пароля
Зубак Тетяна
ШІ-12
*/
#include <iostream>
#include <locale>

using namespace std;

int main(){

    setlocale(LC_ALL, "uk_UA");
    
//ввід
    int strong = 0; // для подальшого контролю на проходження мінімальних вимог

    int len;
    cout << "Введіть довжину пароля(від 1 до 64): ";
    cin >> len;
    if (len > 64 || len < 1){
    cout << "Помилка: довжина мусить бути від 1 до 64." << endl;
    return 1;
    }

    char numb;
    cout << "Чи містить пароль цифри(y/n): ";
    cin >> numb;
    if(numb != 'y' && numb != 'n'){
        cout << "Помилка: введіть дійсне значення." << endl;
        return 1;
    }
    if (numb == 'y')
    strong++;


    char blet;
    cout << "Чи містить пароль великі літери(y/n): ";
    cin >> blet;
    if(blet != 'y' && blet != 'n'){
        cout << "Помилка: введіть дійсне значення." << endl;
        return 1;
    }
    if (blet == 'y')
    strong++;

    char sym;
    cout << "Чи містить пароль символи(y/n): ";
    cin >> sym;
    if(sym != 'y' && sym != 'n'){
        cout << "Помилка: введіть дійсне значення." << endl;
        return 1;
    }
    if (sym == 'y')
    strong++;

//надійність + вивід
    if(len < 8 || strong < 2){
    cout << "Мінімальні вимоги: НЕ ПРОЙДЕНО." << endl;
    }
    else
    cout << "Мінімальні вимоги: ПРОЙДЕНО." << endl;

    int lvl; // для подальшого відстеження рівня надійності
    if(len < 6){
    lvl = 1;
    cout << "Рівень надійності: " << lvl << " - Дуже слабкий" << endl;
    }
    else if(len < 8 || strong == 0){
    lvl = 2;
    cout << "Рівень надійності: " << lvl << " - Слабкий" << endl;
    }
    else if(strong == 1){
    lvl = 3;
    cout << "Рівень надійності: " << lvl << " - Середній" << endl;
    }
    else if(len >= 12 && strong == 3){
    lvl = 5;
    cout << "Рівень надійності: " << lvl << " - Дуже надійний" << endl;
    }
    else{
    lvl = 4;
    cout << "Рівень надійності: " << lvl << " - Надійний" << endl;
    }
    
    switch(lvl){
        case 1: cout << "Рекомендація: Пароль надто короткий. Мінімум 8 символів." << endl; 
        break;
        case 2: cout << "Рекомендація: Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl; 
        break;
        case 3: cout << "Рекомендація: Додайте ще один тип символів або збільште довжину до 12." << endl; 
        break;
        case 4: cout << "Рекомендація: Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl; 
        break;
        default: cout << "Рекомендація: Відмінно. Змінювати нічого не потрібно." << endl; 
    }
    
    if( numb == 'n' && sym =='n' )
    cout << "Попередження: пароль тільки з літер підбирається швидше." << endl;

    return 0;
}