/*
Назва задачі:Аналізатор надійності пароля
Автор:Катерина Лисенко
Номер групи:ШІ-12
*/
#include <iostream>
using namespace std;
int main () {
 int len; // довжина пароля
 // Виводимо довжину і перевіряємо межі
  cout << "Довжина пароля: ";
  cin >> len;
  if (len< 1 || len > 64 ) {
    cout << "Довжина мусить буди від 1 до 64!";
    return 0;
  }
  char d, u, s; // цифри, великі літери, спеціальні символи(y/n)
// виводимо відповіді y/n
  cout << "Чи є цифри (y/n): ";
  cin >> d;
  cout << "Чи є великі літери (y/n): ";
  cin >> u;
  cout << "Чи є спеціальні символи (y/n): ";
  cin >> s;

// Перевірка, що введено саме y або n 
  if  (!(d == 'y' || d == 'n') ||
  !(u == 'y' || u == 'n') ||
  !(s == 'y' || s == 'n')) {
    cout << "Введіть корекні дані!";
    return 0;
  }
  // Рахуємо кількість типів символів
  int types = 0;
  if (d == 'y') types++;
  if (u == 'y') types++;
  if (s == 'y') types++;
  cout << endl;
  // мінімальні вимоги
  if (len >= 8 && types >= 2) 
   cout << "Пройдено" << endl;
   else
   cout << "Не пройдено" << endl;
// визначаємо рівень надійності
   int level;
   string name;
   if (len < 6 ) { level = 1; name = "Дуже слабкий"; }
else if (len < 8 || types == 0) { level = 2; name = "Слабкий"; }
else if ( types == 1) { level = 3; name = "Середній"; }
else if (len >= 12 && types == 3) { level = 5; name = "Дуже надійний"; }
else { level = 4; name = "Надійний"; }
cout << "Рівень дійсності: " << level <<  "-" << name <<endl;
// рекомендація за рівнем
switch (level) {
    case 1:
    cout << "Пароль надто короткий. Мінімум 8 символів." << endl; break;
    case 2:
    cout << "Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl; break;
    case 3:
    cout << "Додайте ще один тип символів або збільште довжину до 12." << endl; break;
    case 4:
    cout << "Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl; break;
    case 5:
    cout << "Відмінно. Змінювати нічого не потрібно." << endl; break;
    default:
    cout << "Помилка: Невідомий рівень." << endl; break;
}
// попередження про те, що немає цифр і спеціальних символів
if ( d == 'n' && s == 'n') 
    cout << "Попередження: пароль тільки з літер підбирається швидше." << endl;
return 0;
}


