/*
Лабораторна робота №1, Завдання №2, Варіант №23.
Онишко Даніель
ШІ-14
*/

#include <iostream>
using namespace std;

int main() {
        // Спочатку запитую у користувача початкові значення для змінних n та m
        int n, m; 
        cout << "Введіть n: ";
        cin >> n;
        cout << "Введіть m: ";
        cin >> m;
        cout << endl;

        // бере поточне n, віднімає m, а вже потім декрементує n
        cout << "Операція 1: n---m" << endl;
        cout << "Значення до обчислення n = " << n << endl;
        cout << "Значення до обчислення m = " << m << endl;
        
        int operation_1 = n--- m; //  операція зі зменшенням
        
        cout << "Результат: " << operation_1 << endl;
        cout << "Значення після обчислення n = " << n << endl; //  n  стало меншим на 1
        cout << "Значення після обчислення m = " << m << endl; // а m залишилось без змін
        cout << "-----------------------------------" << endl;


        // Порівнюємо поточне значення m із новим n, після чого m зменшується на 1
        cout << "Операція 2: m--<n" << endl;
        cout << "Значення до обчислення n = " << n << endl;
        cout << "Значення до обчислення m = " << m << endl;
        
        bool operation_2 = m--<n; // порівнюємо і зменшую m
        
        cout << "Результат (1 - true, 0 - false): " << operation_2 << endl;
        cout << "Значення після обчислення n = " << n << endl; // n не змінювалося в цій операції
        cout << "Значення після обчислення m = " << m << endl; // m тепер зменшилося на 1
        cout << "-----------------------------------" << endl;

        // Порівнюємо поточне n з m, після чого n збільшується на 1
        cout << "Операція 3: n++>m" << endl;
        cout << "Значення до обчислення n = " << n << endl;
        cout << "Значення до обчислення m = " << m << endl;
        
        bool operation_3 = n++>m; // порівнюємо і збільшую n
        
        cout << "Результат (1 - true, 0 - false): " << operation_3 << endl;
        cout << "Значення після обчислення n = " << n << endl; // n тепер збільшилося на 1
        cout << "Значення після обчислення m = " << m << endl; // m залишилось тим самим

        return 0;
}