/* 
Епік 2. practice_task_1_sofiia_lis
Авторка: Софія Ліс
Група: ші-11
*/

#include <iostream>

using namespace std;

int main() {
    int pl;
    char num;
    char cl;
    char sc;


    cout << "Введіть довжину пароля: ";
    cin >> pl; 
    if (pl < 1 || pl > 64) {
        cout << "Значення довжини пароля має бути від 1 до 64!" << endl;
        return 1;
    }

    cout << "Чи наявні цифри у вашому паролі (y/n)? ";
    cin >> num;
    if (num != 'y' && num != 'n' ) {
        cout << "Введіть дійсне значення (y/n)!" << endl;
        return 1;
    }

    cout << "Чи наявні великі літери у вашому паролі (y/n)? ";
    cin >> cl;
    if (cl != 'y' && cl != 'n') {
        cout << "Введіть дійсне значення (y/n)!" << endl;
        return 1;
    }

    cout << "Чи наявні спеціальні символи у вашому паролі (y/n)? ";
    cin >> sc;
    if (sc !='y' && sc !='n') {
        cout << "Введіть дійсне значення (y/n)!" << endl;
        return 1;
    }

    int ctc = 0; // кількість типів символів
    if (num == 'y') ctc++;
    if (cl == 'y') ctc++;
    if (sc == 'y') ctc++;

    // мінімальні вимоги

    if (pl >= 8 && ctc >= 2) {
        cout << "Мінімальні вимоги пройдено!" << endl;
    }
    else {
        cout << "Мінімальні вимоги не пройдено!" << endl;
    }

    // рівень надійності пароля

    int level;
    if (pl < 6) {
        level = 1;
        cout << "Рівень надійності пароля: 1 - Дуже слабкий" << endl;
    }
    else if (pl < 8 || ctc == 0) {
        level = 2;
        cout << "Рівень надійності пароля: 2 - Cлабкий" << endl;
    }
    else if (ctc == 1) {
        level = 3;
        cout << "Рівень надійності пароля: 3 - Середній" << endl;
    }
    else if (pl >= 12 && ctc == 3) {
        level = 5;
        cout << "Рівень надійності пароля: 5 - Дуже надійний" << endl;
    }
    else {
        level = 4;
        cout << "Рівень надійності пароля: 4 - Надійний" << endl;
    }

    // Рекомендація

    switch (level) {
        case 1:
        cout << "Пароль надто короткий. Мінімум 8 символів." << endl;
        break;

        case 2:
        cout << "Збільште довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи." << endl;
        break;

        case 3:
        cout << "Додайте ще один тип символів або збільште довжину до 12." << endl;
        break;

        case 4:
        cout << "Хороший пароль. Для максимуму 12+ символів і всі три типи символів." << endl;
        break;

        case 5:
        cout << "Відмінно. Змінювати нічого не потрібно." << endl;
        break;
    }

    return 0;
}