/*
   Задача: Депутатські гроші (алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Часто-густо громадяни намагаються з’ясувати, наскільки багатими є депутати. 
   Дехто вірить, що матеріальні статки окремих депутатів є необмеженими. Тож уявіть собі депутата, 
   у якого є необмежена кількість купюр усіх номіналів (1, 2, 5, 10, 20, 50, 100, 200 та 500 гривень). 
   Він хоче придбати подарунок для своєї тещі, що коштує 𝑛 гривень. Незважаючи на те, що наш герой-олігарх є нескінченно багатим, 
   він також є нескінченно скупим та педантичним. Саме тому він хоче оплатити покупку готівкою без решти. 
   Яка мінімальна кількість купюр йому для цього знадобиться?
   Вхідні дані: У єдиному рядку задано одне натуральне число 𝑛 — вартість подарунку.
   Вихідні дані: У єдиному рядку виведіть одне ціле число — мінімальну кількість купюр, що необхідна для покупки подарунка.

*/


#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;

    int a[9] = {500, 200, 100, 50, 20, 10, 5, 2, 1};
    int k = 0;

    for (int i = 0; i < 9; i++) {
        k += n / a[i];
        n %= a[i];
    }

    cout << k;

    return 0;
}