/*
   Задача: Баскетболіст (алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Колись давним-давно у Львові жив маленький, але дуже обдарований баскетболіст. 
   Він дуже красиво, а основне влучно вмів кидати м’яча. Єдиним недоліком був його низький зріст. 
   Він давно вже мріяв бути таким високим, як Яо Мінь. Тоді б він зміг робити на майданчику все, 
   що захоче. Тож з метою підрости подався наш маленький спортсмен за тридев’ять земель до відомого чародія. 
   Той сказав, що за одну гривню зможе збільшити його зріст у 𝑘 разів. Нехай 𝑛 — зріст нашого маленького баскетболіста 
   (у сантиметрах), а 𝑚 — мінімальний зріст, яким би був задоволений наш герой.
   Яку мінімальну суму має потратити хлопець, щоб бути задоволеним своїм зростом?
   Зверніть увагу на те, що маленький хлопець може звертатися до мага декілька разів, 
   за кожен із яких треба окремо платити по одній гривні.
   
   Вхідні дані: Єдиний рядок містить три цілих числа 𝑛, 𝑚 та 𝑘 — зріст баскетболіста (у сантиметрах), мінімальний зріст, 
   яким би був задоволений наш герой (у сантиметрах), та в скільки разів маг збільшить його зріст за один раз.
   Вихідні дані: У єдиному рядку виведіть ціле число — шукану мінімальну кількість гривень або -1, 
   якщо досягнути бажаного за допомогою мага баскетболіст не може.

*/


#include <iostream>
using namespace std;

int main() {
    long long a, b, k;
    cin >> a >> b >> k;

    if (a >= b) {
        cout << 0;
        return 0;
    }

    if (k == 1) {
        cout << -1;
        return 0;
    }

    int cnt = 0;

    while (a < b) {
        a *= k;
        cnt++;
    }

    cout << cnt;

    return 0;
}