#include <iostream>
#include <print>

int main() {
    int n{};
    std::cout << "Введіть n: ";
    std::cin >> n;

    int m{};
    std::cout << "Введить m: ";
    std::cin >> m;

    std::cout << "1: " << (m + --n) << std::endl;
    // префіксний декримент віднімає одиницю до того як повертає значення,
    // тому цей вираз можна переписати так:
    // n = n - 1;
    // m + n;

    std::cout << "25: " << (m++ < ++n) << std::endl;
    // постфіксний інкремент додає одиницю після того як повертає значення,
    // тому цей вираз можно переписати так:
    // n = n + 1;
    // m < n;
    // m = m + 1;

    std::cout << "3: " << (n-- < --m) << std::endl;
    // те саме що і у попередніх випадках, можна переписати так:
    // m = m - 1;
    // n < m;
    // n = n - 1;


    return 0;
}