/*
    Lab 4
    Михайловська Анна
    ШІ-14
    Варіант 8
*/
#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

int main() {

    const int N = 100; // Максимальна кількість елементів у масиві
    const int ZERO = 0; // Нуль який додається перед кожним парним елементом масиву

    int n, m, a[N], c[N*2];

    cout << "Ввеедіть кількість елементів масиву: ";

    //Перевірка чи користувач ввів коректне значення
    if(!(cin >> n) || n <= 0 || n > N){
        cout << "Помилка: кількість елементів має бути числом від 1 до 100";
        return 1;
    }

    srand(time(0));

    //Заповнення масиву рандомними значеннями та виведення його
    cout << "Згенерований масив: ";
    for (int i = 0; i < n; i++) {
        a[i] = rand() % 100;
        cout << a[i] << " ";
    }

    cout << "\nВведіть елемент, який буде знищено в масиві: ";

    //Перевірка чи користувач ввів коректне значення
    if (!(cin >> m)) {
        cout << "Помилка: потрібно ввести ціле число";
        return 1;
    }

    //Видалення елементу, що вибрав користувач
    int k = 0;
    for (int i = 0; i < n; i++){
        if (a[i] != m){
            a[k] = a[i];
            k++;
        }   
    }

    cout << "Масив після видалення елемента " << m << " та додавання 0 перед кожним парним числом: ";

    //Додавання у масив 0 перед кожним парним елементом
    int b = 0;
    for (int i = 0; i < k; i++) {
        if (a[i] % 2 == 0) {
            c[b] = ZERO;
            b++;
        }
        c[b] = a[i];
        b++;
    }

    //Виведення масиву після всіх перетворень
    for (int i = 0; i < b; i++)
        cout << c[i] << " ";

    return 0;
}

