#include <iostream>
#include <string>
using namespace std;

int main (){
    // Оголошення змінних
int Length = 0;
char Number;
char Bigsymbol;
char Symbol;

// Вивід з проханням у введенні кількості символів паролю, занесення даних у змінну, перевірка на кількість символів
cout << "Введіть кількість символів паролю: ";
cin >> Length;
if(Length < 1 || Length > 64){
cout << "Помилка: довжина мусить бути від 1 до 64" << endl;
return 0;
}

// Вивід з проханням у введенні (y/n) користувачем, занесення даних у змінну, перевірка чи правильно введенні символи
cout << "Чи є цифри у паролі? (y/n): ";
cin >> Number;
if(!(Number == 'y' || Number == 'n')){
    cout << "Помилка: введіть дійсне значення";
return 0;
}

// Вивід з проханням у введенні (y/n) користувачем, занесення даних у змінну, перевірка чи правильно введенні символи
cout << "Чи є великі літери у паролі? (y/n): ";
cin >> Bigsymbol;
if(!(Bigsymbol == 'y' || Bigsymbol == 'n')){
    cout << "Помилка: введіть дійсне значення";
return 0;
}

// Вивід з проханням у введенні (y/n) користувачем, занесення даних у змінну, перевірка чи правильно введенні символи
cout << "Чи є спеціальні символи у паролі? (y/n): ";
cin >> Symbol;
if(!(Symbol == 'y' || Symbol == 'n')){
    cout << "Помилка: введіть дійсне значення";
return 0;
}

// Перевірка на кількість типів символів у паролі
int calc = 0;
if (Number == 'y'){
    calc++;
}
if (Bigsymbol == 'y'){
    calc++;
}
if (Symbol == 'y'){
    calc++;
}

// Перевірка на мінімальні вимоги паролю
if(Length >= 8 && calc >= 2)
{cout << "Мінімальні вимоги: " << "Пройдено" << endl;}
else {
    cout << "Мінімальні вимоги: " << "Не пройдено" << endl;;
}

// Перевірка на рівень надійності паролю, вивід у термінал рівня відповідно до характеристик паролю
int level = 1;
if(Length < 6){
    level = 1;
    cout << "Рівень надійності: " << level << " - Дуже слабкий" << endl;
}
else if(Length < 8 || calc == 0){
    level = 2;
cout << "Рівень надійності: " << level << " - Cлабкий" << endl;
}
else if(calc == 1){
    level = 3;
    cout << "Рівень надійності: " << level << " - Середній" << endl;
}
else if(Length >= 12 && calc == 3){
    level = 5;
    cout << "Рівень надійності: " << level << " - Дуже надійний" << endl;
}
else{
    level = 4;
    cout << "Рівень надійності: " << level << " - Надійний" << endl;
}
cout << "Рекомендація: ";

// Використання switch case для виведення рекомендацій щодо паролю, залежно від його рівня надійності
switch(level){
    case 1: cout << "Пароль надто короткий. Мінімум 8 символів" << endl; break ;
    case 2: cout << "Збільшіть довжину до 8+ символів і додайте цифри, великі літери або спеціальні символи" << endl; break;
    case 3: cout << "Додайте ще один тип символів або збільште довжину до 12" << endl; break;
    case 4: cout << "Хороший пароль. Для максимуму 12+ символів і всі три типи символів" << endl; break;
    case 5: cout << "Відмінно. Змінювати нічого не потрібно" << endl; break;
    default: cout << "Помилка: Невідомий рівень надійності" << endl;
}

// Перевірка на наявність типів символів. У разі їхньої відсутності виводиться передження, у випадку наявності лише малих та великих літер також виводиться попередження
if(calc == 0){
    cout << "Попередження: пароль тільки з літер підбирається швидше" << endl;
}
else if(Number == 'n' && Bigsymbol == 'y' && Symbol == 'n' ){
    cout << "Попередження: пароль тільки з літер підбирається швидше" << endl;
}
return 0;

}



