/*
   Задача: Євро 2012(алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Євро 2012 уже в Україні. А саме в чотирьох містах: Львові, Києві, Донецьку та Харкові. І як ви, мабуть, знаєте, Зеник дуже любить дівчат. 
   І в кожному із цих чотирьох міст в Зеника є різна кількість дівчат. Зеник знає, що для перегляду матчів Євро 2012 він відвідає всі чотири міста, і, звісно ж, 
   не проґавить можливості зустрітися з усіма можливими знайомими дівчатами.
   Як справжній джентльмен, він не може приїхати в гості з порожніми руками, тому вирішив купити кожній дівчинці по сувеніру. І просить вас порахувати, скільки ж сувенірів йому прийдеться купити?
   Вхідні дані: У першому рядку задано чотири цілих числа — кількість дівчат у Львові, Києві, Донецьку та Харкові відповідно.

 */

 #include <iostream>

int main() {
    int a, b, c, d;
    std::cin >> a >> b >> c >> d;
    std::cout << a + b + c + d << std::endl;
}
