/*
   Задача: Спекотні дні пінгвінів(алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Ви собі навіть уявити не можете, як же спекотно пінгвінам на Мадагаскарі. Щоб хоч трішки охолодитись, вони випивають безалкогольні коктейлі, 
   однак і з цим проблемно — руки не пристосовані до такого способу життя. Вам потрібно допомогти визначити пінгвінам, чи зможуть вони випити коктейль, що лежить на столі.
   Для простоти будемо вважати, що коктейль на столі — круг із діаметром 𝑙, в той час, як рот пінгвіна в будь-який момент часу — прямокутник із шириною 𝑤, сторони якого паралельні осям координат. 
   В початковий момент часу рот пінгвіна закритий, тому прямокутник вироджений — його висота 0 (інакше кажучи, він є горизонтальним відрізком). 
   Верхня щелепа пінгвіна може розкритись не більше ніж на 𝑢 дюймів відносно початкової позиції, в той час, як нижня — на 𝑑 дюймів.
   Будемо вважати, що пінгвін може випити коктейль, якщо той повністю впишеться в його рот. Допоможіть пінгвіну за всіма заданими параметрами визначити, чи зможе він випити коктейль.
   Вхідні дані: У єдиному рядку задано 4 натуральні числа 𝑙, 𝑤, 𝑢 та 𝑑 — діаметр коктейлю, ширина роту і на скільки дюймів щелепи можуть розкритися відповідно.

 */

#include <iostream>

int main() {
    int l, w, u, d;
    std::cin >> l >> w >> u >> d;
    if (l <= u+d && l <= w) {
        std::cout << "Three times Sex on the Beach, please!" << std::endl;
    } else {
        std::cout << "Forget about the cocktails, man!" << std::endl;
    }
    return 0;
}

