/*
   Задача: А ти вже помив руки?(алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Страшний реп’яховірус вирує по всій планеті. Станом на сьогодні, він встиг заразити 𝑎 людей.
   Вченим відомо, що ситуація стабілізувалась, і відтепер вірус буде щодня заражати рівно 𝑏 людей. Скільки сумарно людей будуть зараженими через 𝑘 днів?
   Вхідні дані: У першому та єдиному рядку задано три цілих числа — 𝑎, 𝑏 та 𝑘.

 */

 #include <iostream>

int main() {
    int a, b, k;
    std::cin >> a >> b >> k;
    std::cout << b * k + a << std::endl;
}
