/*
   Задача: Апельсини(алготестер)
   Ільницька Софія
   Група ШІ-14
 
   Умова задачі: Діти міряються різними речима. У нашій задачі — апельсинами. Марічка і Софійка міряються з Петриком.
   Потрібно визначити, чи Марічка й Софійка разом мають більше апельсинів, ніж Петрик.
   Вхідні дані: У першому і єдиному рядку задано три цілі числа 𝑎, 𝑏 та 𝑐 — кількість апельсинів у Марічки, Софійки і Петрика відповідно.

 */

 #include <iostream>

int main() {
    int a, b, c;
    std::cin >> a >> b >> c;
    if (a+b > c)
        std::cout << "YES";
    else
        std::cout << "NO";
    return 0;
}
