/*

До Тойлет-мена, відомого вам білоруського супергероя, дуже часто звертаються по допомогу різні люди. Проте, очевидно, усім мужній гігант допомогти не зможе — не вистачить часу. Та й не дуже хоче.
Саме тому, коли до нього приходить певне SMS-повідомлення з проханням про допомогу, він погодиться допомогти тоді й лише тоді, коли в цьому повідомленні знайдеться хоча б 𝑘 входжень рядка TOILET, які не перетинаються.
За заданим повідомленням 𝑠, яке складається з великих латинських символів, виведіть YES, якщо Тойлет-мен погодиться допомогти людині, яка написала це повідомлення. У протилежному разі виведіть NO.

*/

#include <iostream>
#include <string>
using namespace std;

int main() {
    int k;
    string s;
    cin >> k >> s;

    int count = 0;
    int i = 0;
    int n = s.size();

    while (i + 5 < n) {
        if (s[i] == 'T' &&
            s[i + 1] == 'O' &&
            s[i + 2] == 'I' &&
            s[i + 3] == 'L' &&
            s[i + 4] == 'E' &&
            s[i + 5] == 'T') {
            count++;
            i += 6;
        } else {
            i++;
        }
    }

    if (count >= k) {
        cout << "YES";
    } else {
        cout << "NO";
    }

    return 0;
}