/*

Коли Коля та Вася прийшли робити ремонт на «Екстралогіку» — першим, що вони побачили в офісі, був стіл для настільного тенісу. Поки всі інші працювали, Коля та Вася вирішили пограти. Через декілька годин прийшов директор і накричав на заробітчан через те, що вони нічим не займаються. Тож Вася і Коля мусили йти працювати.

По дорозі вони сперечалися, хто ж виграв і з яким рахунком. Оскільки вони записували результати кожної подачі, то це можна порахувати. Але оскільки гра тривала дуже довго — порахувати це вручну дуже тяжко.

Всього відбулося 𝑛 подач. Про кожну з них ми знаємо, хто переміг. За виграну подачу гравець отримує одне очко. Партія вважається виграною, коли один з гравців набере не менше одинадцяти очок з перевагою щонайменше у два очки. Наприклад, за рахунків 11:9, 4:11, 15:13 партія закінчується, а за рахунків 11:10 та 99:98 — ні. Як тільки Коля і Вася закінчили одну партію — вони починають іншу.

Знаючи, хто переміг кожної подачі — виведіть загальний рахунок по партіях в грі Коля-Вася. А якщо вони не дограли останню партію, то і її рахунок теж.

*/

#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;

    int k = 0, v = 0;           // Очки
    int gamesK = 0, gamesV = 0; // Партії

    for (int i = 0; i < n; i++) {
        char c;
        cin >> c;

        if (c == 'K')
            k++;
        else
            v++;

        if (k >= 11 && k - v >= 2) {
            gamesK++;
            k = 0;
            v = 0;
        } else if (v >= 11 && v - k >= 2) {
            gamesV++;
            k = 0;
            v = 0;
        }
    }

    cout << gamesK << ':' << gamesV << '\n';

    // Незавершена партія
    if (k > 0 || v > 0)
        cout << k << ':' << v << '\n';

    return 0;
}