/*

Одного разу двоє друзів, Віталік та Роман, вирішили зіграти в лотерею і навіть купили відповідний білет. На лотерейному білеті є прямокутна таблиця розміром 𝑛 ×𝑚. У кожній клітинці таблиці записане одне ціле число. Для участі в лотереї необхідно замалювати рівно одне число з таблиці та відіслати білет організаторам.

Віталік переконаний, що необхідно обрати найменше число, проте Роман абсолютно впевнений, що переможе найбільше. Білет у хлопців лише один, і вони довго не могли вирішити, як їм учинити. Після декількох днів активних суперечок та наукових дискусій на тему «Чому малі числа кращі, ніж великі» чи навпаки, друзі вирішили зробити так: спочатку Віталік обирає стовпець, а тоді Роман вибирає число з цього стовпця.

Ваше завдання визначити, яке число все-таки оберуть хлопці.

*/

#include <iostream>
using namespace std;

int main() {
    int n, m;
    cin >> n >> m;

    int a[1000] = {0};

    // Максимуми стовпців
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            int x;
            cin >> x;

            if (x > a[j])
                a[j] = x;
        }
    }

    // Найменший максимум
    int answer = a[0];

    for (int j = 1; j < m; j++) {
        if (a[j] < answer)
            answer = a[j];
    }

    cout << answer << '\n';
    return 0;
}