/*
Епік 2. Лабораторна робота №1. Завдання №2. Варіант №10
Автор: Кучер Дмитро
Група: ШІ-11
*/

#include<iostream>
using namespace std;

int main() {

    short n, m;

    cout << "Введіть ціле значення n: "; cin >> n;
    cout << "Введіть ціле значення m: "; cin >> m;

    const short n0 = n;
    const short m0 = m;
    
    cout << "\n1) n---m\n";
    cout << "Значення до обчислення: n = " << n0 << ", m = " << m0 << endl;

    cout << "Перший варіант (n-- - m): \n";
    n--;
    cout << "Результат: " << n - m0 << endl;
    cout << "Значення після обчислення: n = " << n << ", m = " << m0 << endl;

    cout << "Другий варіант (n - --m): \n";
    --m;
    cout << "Результат: " << n0 - m << endl;
    cout << "Значення після обчислення: n = " << n0 << ", m = " << m << endl;

    n = n0;
    m = m0;

    cout << "\n2) m--<n\n";
    cout << "Значення до обчислення: n = " << n0 << ", m = " << m0 << endl;

    m--;
    if (m<n) cout << "Результат: True\n" << "Значення після обчислення: n = " << n << ", m = " << m << endl;
    else cout << "Результат: False\n" << "Значення після обчислення: n = " << n << ", m = " << m << endl;

    n = n0;
    m = m0;

    cout << "\n3) n++>m\n";
    cout << "Значення до обчислення: n = " << n0 << ", m = " << m0 << endl;

    n++;
    if (n>m) cout << "Результат: True\n" << "Значення після обчислення: n = " << n << ", m = " << m << endl;
    else cout << "Результат: False\n" << "Значення після обчислення: n = " << n << ", m = " << m << endl;





    return 0;
}